-------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood
> \codes\widowhood_new.log
  log type:  text
 opened on:  23 Sep 2023, 16:23:15

. 
. timer on 1

. 
. clear 

. clear matrix

. clear mata 

. set maxvar 32767


.  use "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\Data\rand_longitudinal\randhrs1992_2018v1_STATA\randhrs1992_2018v1
> .dta", clear 

. 
. *use "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/Data/rand_longitudinal/randhrs1992_2018v1_STATA/randhrs1992_20
> 18v1.dta", clear 
. 
. /********************************** STEP I: INITIAL DATA CLEANING *****
> *****************************************************************/
. /********** respondent's own demographic information *********/
. * interview year
. forvalues i = 1(1)14{
  2.         rename  r`i'iwendy int_year_wave_`i'
  3. }

. gen int_year_1998 = int_year_wave_4
(20,849 missing values generated)

. 
.         
. recode ragender(2=0), gen(male) /* we will establish models separately 
> for male and female */ 
(23,681 differences between ragender and male)

. 
. rename rabyear birth_year /* birth year */

. rename raracem race /*race category */

. rename raeduc educ /* education category */

. 
. * place of birth 
. rename rabplace birth_place 

. gen migration = 1 if birth_place == 11
(36,414 missing values generated)

. replace migration = 0 if migration != 1
(36,414 real changes made)

. 
. *religion 
. rename rarelig religion 

. 
. /*total income in every wave */
. forvalues i =1(1)14{
  2.         foreach j in r`i'iearn  r`i'ipena r`i'issdi r`i'isret r`i'iu
> nwc  r`i'igxfr{
  3.         replace `j'=. if `j'==.u
  4.         replace `j'=0 if `j'==.
  5.         }
  6. }
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(29,581 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(22,591 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(24,242 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(20,849 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(22,655 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(24,068 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(22,104 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(23,764 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(25,016 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(20,199 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(21,679 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(23,486 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(21,321 real changes made)
(0 real changes made)
(25,087 real changes made)
(0 real changes made)
(25,087 real changes made)
(0 real changes made)
(25,087 real changes made)
(0 real changes made)
(25,087 real changes made)
(0 real changes made)
(25,087 real changes made)
(0 real changes made)
(25,087 real changes made)

. forvalues i =1(1)14{
  2.         gen income_`i' = r`i'iearn + r`i'ipena+ r`i'issdi+ r`i'isret
> + r`i'iunwc + r`i'igxfr
  3.         gen log_income_`i' = log(income_`i'+10)
  4. }

. * whether have pension
. gen r1peninc=.
(42,233 missing values generated)

. forvalues i = 1(1)14{
  2.         gen pension_`i' = 1 if r`i'peninc == 1
  3.         replace pension_`i' = 0 if pension_`i'!=1
  4. }
(42,233 missing values generated)
(42,233 real changes made)
(40,469 missing values generated)
(40,469 real changes made)
(37,474 missing values generated)
(37,474 real changes made)
(36,679 missing values generated)
(36,679 real changes made)
(36,558 missing values generated)
(36,558 real changes made)
(36,871 missing values generated)
(36,871 real changes made)
(37,010 missing values generated)
(37,010 real changes made)
(37,268 missing values generated)
(37,268 real changes made)
(37,573 missing values generated)
(37,573 real changes made)
(38,211 missing values generated)
(38,211 real changes made)
(37,744 missing values generated)
(37,744 real changes made)
(37,861 missing values generated)
(37,861 real changes made)
(38,061 missing values generated)
(38,061 real changes made)
(38,827 missing values generated)
(38,827 real changes made)

. 
. 
. /******* spouse information *******************/
. * the information for spouse was updated en every wave 
. /* birthyear for spouse */ 
. forvalues i = 1(1)14{
  2.         rename s`i'byear s_birth_year_`i'  
  3. }

. /*race for spouse */
. forvalues i =1(1)14{
  2.         rename s`i'racem s_race_`i'
  3.         g s_white_`i' = 1 if s_race_`i' == 1
  4.         replace s_white_`i' = 0 if s_white_`i' ! = 1
  5.         g s_black_`i' = 1 if s_race_`i' == 2
  6.         replace s_black_`i' = 0 if s_black_`i' ! = 1
  7. }
(33,794 missing values generated)
(33,794 real changes made)
(40,920 missing values generated)
(40,920 real changes made)
(30,700 missing values generated)
(30,700 real changes made)
(40,679 missing values generated)
(40,679 real changes made)
(31,746 missing values generated)
(31,746 real changes made)
(40,901 missing values generated)
(40,901 real changes made)
(29,913 missing values generated)
(29,913 real changes made)
(40,694 missing values generated)
(40,694 real changes made)
(31,094 missing values generated)
(31,094 real changes made)
(40,893 missing values generated)
(40,893 real changes made)
(32,126 missing values generated)
(32,126 real changes made)
(40,995 missing values generated)
(40,995 real changes made)
(31,128 missing values generated)
(31,128 real changes made)
(40,824 missing values generated)
(40,824 real changes made)
(32,141 missing values generated)
(32,141 real changes made)
(41,006 missing values generated)
(41,006 real changes made)
(33,044 missing values generated)
(33,044 real changes made)
(41,119 missing values generated)
(41,119 real changes made)
(31,645 missing values generated)
(31,645 real changes made)
(40,215 missing values generated)
(40,215 real changes made)
(32,537 missing values generated)
(32,537 real changes made)
(40,355 missing values generated)
(40,355 real changes made)
(33,706 missing values generated)
(33,706 real changes made)
(40,563 missing values generated)
(40,563 real changes made)
(33,707 missing values generated)
(33,707 real changes made)
(40,211 missing values generated)
(40,211 real changes made)
(35,318 missing values generated)
(35,318 real changes made)
(40,552 missing values generated)
(40,552 real changes made)

. 
. /*education categories for spouse */
. forvalues i=1(1)14{
  2.         rename s`i'educ s_educ_`i'
  3. }

. 
. * place of birth
. forvalues i =1(1)14{
  2.         rename s`i'bplace s_birth_place_`i'
  3.         gen s_migration_`i' = 1 if s_birth_place_`i' == 11
  4.         replace s_migration_`i' = 0 if s_migration_`i' != 1
  5. 
. }
(41,129 missing values generated)
(41,129 real changes made)
(40,879 missing values generated)
(40,879 real changes made)
(41,004 missing values generated)
(41,004 real changes made)
(40,873 missing values generated)
(40,873 real changes made)
(40,960 missing values generated)
(40,960 real changes made)
(41,061 missing values generated)
(41,061 real changes made)
(40,748 missing values generated)
(40,748 real changes made)
(40,945 missing values generated)
(40,945 real changes made)
(41,008 missing values generated)
(41,008 real changes made)
(40,041 missing values generated)
(40,041 real changes made)
(40,152 missing values generated)
(40,152 real changes made)
(40,298 missing values generated)
(40,298 real changes made)
(39,904 missing values generated)
(39,904 real changes made)
(40,335 missing values generated)
(40,335 real changes made)

. 
. *religion 
. forvalues i =1(1)14{
  2.         rename s`i'relig s_religion_`i'
  3.         g s_protestant_`i' = 1 if s_religion_`i' == 1
  4.         replace s_protestant_`i' = 0 if s_protestant_`i' ! = 1
  5.         g s_catholic_`i' = 1 if s_religion_`i' == 2
  6.         replace s_catholic_`i' = 0 if s_catholic_`i' ! = 1
  7. 
. }
(35,710 missing values generated)
(35,710 real changes made)
(39,388 missing values generated)
(39,388 real changes made)
(33,614 missing values generated)
(33,614 real changes made)
(38,595 missing values generated)
(38,595 real changes made)
(34,421 missing values generated)
(34,421 real changes made)
(38,953 missing values generated)
(38,953 real changes made)
(33,109 missing values generated)
(33,109 real changes made)
(38,335 missing values generated)
(38,335 real changes made)
(34,038 missing values generated)
(34,038 real changes made)
(38,682 missing values generated)
(38,682 real changes made)
(34,788 missing values generated)
(34,788 real changes made)
(38,992 missing values generated)
(38,992 real changes made)
(34,115 missing values generated)
(34,115 real changes made)
(38,543 missing values generated)
(38,543 real changes made)
(34,845 missing values generated)
(34,845 real changes made)
(38,939 missing values generated)
(38,939 real changes made)
(35,518 missing values generated)
(35,518 real changes made)
(39,225 missing values generated)
(39,225 real changes made)
(34,230 missing values generated)
(34,230 real changes made)
(38,247 missing values generated)
(38,247 real changes made)
(34,898 missing values generated)
(34,898 real changes made)
(38,525 missing values generated)
(38,525 real changes made)
(35,815 missing values generated)
(35,815 real changes made)
(38,911 missing values generated)
(38,911 real changes made)
(35,683 missing values generated)
(35,683 real changes made)
(38,716 missing values generated)
(38,716 real changes made)
(37,002 missing values generated)
(37,002 real changes made)
(39,362 missing values generated)
(39,362 real changes made)

. 
. /*total income for spouse */
. forvalues i =1(1)14{
  2.         foreach j in s`i'iearn  s`i'ipena s`i'issdi s`i'isret s`i'iu
> nwc  s`i'igxfr {
  3.         replace `j'=. if `j'==.u
  4.         replace `j'=0 if `j'==.
  5.         }
  6. }
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(2,373 real changes made, 2,373 to missing)
(31,954 real changes made)
(5,968 real changes made, 5,968 to missing)
(28,559 real changes made)
(5,968 real changes made, 5,968 to missing)
(28,559 real changes made)
(5,968 real changes made, 5,968 to missing)
(28,559 real changes made)
(5,968 real changes made, 5,968 to missing)
(28,559 real changes made)
(2,295 real changes made, 2,295 to missing)
(24,886 real changes made)
(5,968 real changes made, 5,968 to missing)
(28,559 real changes made)
(5,657 real changes made, 5,657 to missing)
(29,899 real changes made)
(5,657 real changes made, 5,657 to missing)
(29,899 real changes made)
(5,657 real changes made, 5,657 to missing)
(29,899 real changes made)
(5,657 real changes made, 5,657 to missing)
(29,899 real changes made)
(2,334 real changes made, 2,334 to missing)
(26,576 real changes made)
(5,657 real changes made, 5,657 to missing)
(29,899 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,868 real changes made, 6,868 to missing)
(27,717 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,537 real changes made, 6,537 to missing)
(29,192 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,306 real changes made, 6,306 to missing)
(30,374 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,777 real changes made, 6,777 to missing)
(28,881 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,417 real changes made, 6,417 to missing)
(30,181 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(6,205 real changes made, 6,205 to missing)
(31,221 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,797 real changes made, 7,797 to missing)
(27,996 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,473 real changes made, 7,473 to missing)
(29,152 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(7,125 real changes made, 7,125 to missing)
(30,611 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(8,024 real changes made, 8,024 to missing)
(29,345 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)
(6,684 real changes made, 6,684 to missing)
(31,771 real changes made)

. forvalues i =1(1)14{
  2.         gen s_income_`i' = s`i'iearn + s`i'ipena+ s`i'issdi+ s`i'isr
> et+ s`i'iunwc + s`i'igxfr
  3.         gen s_log_income_`i' = log(s_income_`i'+10)
  4. }

. 
. * whether have pension
. gen s1peninc=.
(42,233 missing values generated)

. forvalues i = 1(1)14{
  2.         gen s_pension_`i' = 1 if s`i'peninc == 1
  3.         replace s_pension_`i' = 0 if s_pension_`i'!=1
  4. }
(42,233 missing values generated)
(42,233 real changes made)
(40,805 missing values generated)
(40,805 real changes made)
(39,270 missing values generated)
(39,270 real changes made)
(38,883 missing values generated)
(38,883 real changes made)
(38,853 missing values generated)
(38,853 real changes made)
(39,095 missing values generated)
(39,095 real changes made)
(39,197 missing values generated)
(39,197 real changes made)
(39,355 missing values generated)
(39,355 real changes made)
(39,579 missing values generated)
(39,579 real changes made)
(40,000 missing values generated)
(40,000 real changes made)
(40,775 missing values generated)
(40,775 real changes made)
(40,554 missing values generated)
(40,554 real changes made)
(40,731 missing values generated)
(40,731 real changes made)
(40,946 missing values generated)
(40,946 real changes made)

. 
. 
. 
. /******************** Module for respondent's own health **************
> **/
. 
. * drink 
. * information on drinking starts from wave 3
. forvalues i =3(1)14{
  2.         rename r`i'drinkd drink_days_`i'
  3. }

. forvalues i= 3(1)14{
  2.         rename r`i'drinkn drink_num_`i'
  3. }

. 
. /* health */
. * for the section of health, we extract three variables: self-reported 
> health, BMI, and days of hospital stays 
. * sum of conditions ever had
. forvalues i = 1(1)14{
  2.         rename r`i'conde cond_`i'
  3. }

. 
. *self-reported health
. forvalues i=1(1)14{
  2.         rename r`i'shlt health_`i'
  3. }

. 
. *hospital stays 
. /* note that the hospital stays in wave 1 was asked for the previous 12
>  months, while in the other waves were asked for the previous 2 years, 
> meanwhile, the information of # of hospital stays starts from wave 2, t
> herefore, we clean the data from wave 2 */
. 
. forvalues i = 2(1)14{
  2.         rename r`i'hosp hosp_`i'
  3.         rename r`i'hsptim hosp_time_`i'
  4. }

. 
. * BMI
. * after wave 8, we have the physical measured BMI, thus, we use the mea
> sured one to replace the self-reported one. 
. forvalues i = 1(1)7{
  2.         rename r`i'bmi bmi_`i'
  3. }

. forvalues i = 8(1)14{
  2.         rename r`i'pmbmi bmi_`i'
  3. }

. 
. * number of doctor visits (as in wave 1, the variable is measured by th
> e numbers in the previous 12 months, therefore, we start the measuremen
> t from wave 2)
. 
. forvalues i = 2(1)14{
  2.         rename r`i'doctim doct_time_`i'
  3. }

. 
. *probability of living over 75 (life expectancy; scale of 1-100) (dropp
> ed)
. 
. forvalues i = 1(1)14{
  2.         rename r`i'liv75 liv75_`i'
  3. }

. 
. * living in the nurse home (asked from wave 3)
. forvalues i = 3(1)14{
  2.         rename r`i'nhmliv nurs_home_`i'
  3. }

. 
. 
. /* mental health */
. * we apply CESD scores imputed in RAND data to measure mental health 
. /* note: the cesd scores starts from wave 2 */
. forvalues i = 2(1)14{
  2.         rename r`i'cesd cesd_`i'
  3. }

. 
. /*health expenditures (out of pocket) (wave 3 - 14) */
. forvalues i = 3(1)14{
  2.         rename r`i'oopmd expend_`i'
  3. }

. 
. 
. 
. /* several specific health conditions */
. * we take the variable of whether the respondent ever had such symptom 
. 
. * high blood pressure (note if someone ever had high BP, which might le
> ad her to take the antihypertentive drugs, and therefore, reports no hi
> gh BP symptom in the wave, but we regard that the respondent ever had h
> igh BP)
. 
. * diabetes 
. 
. * cancer 
. 
. * lung disease 
. 
. * heart problem 
. 
. * stroke 
. 
. * psychological problem 
. 
. * arthritis 
. forvalues i = 1(1)14{
  2.         rename r`i'hibpe high_bp_`i' 
  3.         rename r`i'diabe diabetes_`i'
  4.         rename r`i'cancre cancer_`i'
  5.         rename r`i'lunge lung_`i'
  6.         rename r`i'hearte heart_`i'
  7.         rename r`i'stroke stroke_`i'
  8.         rename r`i'psyche psych_`i'
  9.         recode psych_`i' (1 3 5 =1)(2 4 = 0)
 10.         rename r`i'arthre arthritis_`i'
 11. }
(0 changes made to psych_1)
(0 changes made to psych_2)
(0 changes made to psych_3)
(0 changes made to psych_4)
(0 changes made to psych_5)
(0 changes made to psych_6)
(0 changes made to psych_7)
(0 changes made to psych_8)
(0 changes made to psych_9)
(0 changes made to psych_10)
(0 changes made to psych_11)
(0 changes made to psych_12)
(0 changes made to psych_13)
(0 changes made to psych_14)

. 
. /* ever smoking */
. 
. forvalues i = 1(1)14{
  2.         rename r`i'smokev smoke_`i'
  3. }

. 
. * proxy rating of respondent memory (ordered variable)
. forvalues i = 2(1)14{
  2.         rename r`i'prmem proxy_memory_`i'
  3.         replace proxy_memory_`i' =. if proxy_memory_`i'<1 | proxy_me
> mory_`i' > 5
  4. }
(18,808 real changes made, 18,808 to missing)
(16,357 real changes made, 16,357 to missing)
(19,348 real changes made, 19,348 to missing)
(17,521 real changes made, 17,521 to missing)
(16,133 real changes made, 16,133 to missing)
(18,333 real changes made, 18,333 to missing)
(17,212 real changes made, 17,212 to missing)
(16,078 real changes made, 16,078 to missing)
(20,656 real changes made, 20,656 to missing)
(19,410 real changes made, 19,410 to missing)
(17,705 real changes made, 17,705 to missing)
(19,977 real changes made, 19,977 to missing)
(16,484 real changes made, 16,484 to missing)

. /*ADL */
. forvalues i = 2(1)14{
  2.         rename r`i'adla adl_`i'
  3. }

. /***************** health for spouse ********************/ 
. 
. /*drink */
. forvalues i =3(1)14{
  2.         rename s`i'drinkd s_drink_days_`i'
  3. }

. forvalues i= 3(1)14{
  2.         rename s`i'drinkn s_drink_num_`i'
  3. }

. 
. * sum of conditions ever had 
. forvalues i = 1(1)14{
  2.         rename s`i'conde s_cond_`i'
  3. }

. 
. *self-reported health
. forvalues i=1(1)14{
  2.         rename s`i'shlt s_health_`i'
  3. }

. 
. *hospital stays 
. /* note that the hospital stays in wave 1 was asked for the previous 12
>  months, while in the other waves were asked for the previous 2 years, 
> meanwhile, the information of # of hospital stays starts from wave 2, t
> herefore, we clean the data from wave 2 */
. 
. forvalues i = 2(1)14{
  2.         rename s`i'hosp s_hosp_`i'
  3.         rename s`i'hsptim s_hosp_time_`i'
  4. }

. 
. * BMI
. * after wave 8, we have the physical measured BMI, thus, we use the mea
> sured one to replace the self-reported one. 
. forvalues i = 1(1)7{
  2.         rename s`i'bmi s_bmi_`i'
  3. }

. forvalues i = 8(1)14{
  2.         rename s`i'pmbmi s_bmi_`i'
  3. }

. 
. 
. * number of doctor visits (as in wave 1, the variable is measured by th
> e numbers in the previous 12 months, therefore, we start the measuremen
> t from wave 2)
. 
. forvalues i = 2(1)14{
  2.         rename s`i'doctim s_doct_time_`i'
  3. }

. 
. *probability of living over 75 (life expectancy; scale of 1-100)
. forvalues i = 1(1)14{
  2.         rename s`i'liv75 s_liv75_`i'
  3. }

. 
. * living in the nurse home (asked from wave 3)
. forvalues i = 3(1)14{
  2.         rename s`i'nhmliv s_nurs_home_`i'
  3. }

. 
. /* mental health */
. * we apply CESD scores imputed in RAND data to measure mental health 
. /* note: the cesd scores starts from wave 2 */
. forvalues i = 2(1)14{
  2.         rename s`i'cesd s_cesd_`i'
  3. }

. 
. 
. /*health expenditures (out of pocket) (wave 3 - 14) */
. forvalues i = 3(1)14{
  2.         rename s`i'oopmd s_expend_`i'
  3. }

. 
. 
. /* several specific health conditions */
. * we take the variable of whether the respondent ever had such symptom 
. 
. * high blood pressure (note if someone ever had high BP, which might le
> ad her to take the antihypertentive drugs, and therefore, reports no hi
> gh BP symptom in the wave, but we regard that the respondent ever had h
> igh BP)
. 
. * diabetes 
. 
. * cancer 
. 
. * lung disease 
. 
. * heart problem 
. 
. * stroke 
. 
. * psychological problem 
. 
. * arthritis 
. forvalues i = 1(1)14{
  2.         rename s`i'hibpe s_high_bp_`i' 
  3.         rename s`i'diabe s_diabetes_`i'
  4.         rename s`i'cancre s_cancer_`i'
  5.         rename s`i'lunge s_lung_`i'
  6.         rename s`i'hearte s_heart_`i'
  7.         rename s`i'stroke s_stroke_`i'
  8.         rename s`i'psyche s_psych_`i'
  9.         recode s_psych_`i' (1 3 5 =1)(2 4 = 0)
 10.         rename s`i'arthre s_arthritis_`i'
 11. }
(0 changes made to s_psych_1)
(0 changes made to s_psych_2)
(0 changes made to s_psych_3)
(0 changes made to s_psych_4)
(0 changes made to s_psych_5)
(0 changes made to s_psych_6)
(0 changes made to s_psych_7)
(0 changes made to s_psych_8)
(0 changes made to s_psych_9)
(0 changes made to s_psych_10)
(0 changes made to s_psych_11)
(0 changes made to s_psych_12)
(0 changes made to s_psych_13)
(0 changes made to s_psych_14)

. 
. 
. /* ever smoking */
. 
. forvalues i = 1(1)14{
  2.         rename s`i'smokev s_smoke_`i'
  3. }

. 
. * proxy rating of respondent memory (ordered variable)
. forvalues i = 2(1)14{
  2.         rename s`i'prmem s_proxy_memory_`i'
  3.         replace s_proxy_memory_`i' =. if s_proxy_memory_`i'<1 | s_pr
> oxy_memory_`i' > 5
  4. }
(19,163 real changes made, 19,163 to missing)
(16,885 real changes made, 16,885 to missing)
(19,982 real changes made, 19,982 to missing)
(18,169 real changes made, 18,169 to missing)
(16,808 real changes made, 16,808 to missing)
(18,928 real changes made, 18,928 to missing)
(17,677 real changes made, 17,677 to missing)
(16,561 real changes made, 16,561 to missing)
(21,218 real changes made, 21,218 to missing)
(19,906 real changes made, 19,906 to missing)
(18,160 real changes made, 18,160 to missing)
(20,387 real changes made, 20,387 to missing)
(16,762 real changes made, 16,762 to missing)

. 
. /*ADL */
. forvalues i = 2(1)14{
  2.         rename s`i'adla s_adl_`i'
  3. }

. 
. 
. ****** Household Information *************************************
. /* asset in every wave */
. gen h3atotb = h3atota /* in wave 3, there's no total wealth including s
> econd residence, so we use the wealth without second residence in repla
> ce of it. However, as our calculation starts from wave 4, this doesn't 
> affect our results. */
(24,242 missing values generated)

. forvalues i=1(1)14{
  2.         rename h`i'atotb asset_`i'
  3. }

. 
. gen h3ahoub =.
(42,233 missing values generated)

. gen h3amrtb =.
(42,233 missing values generated)

. forvalues i=1(1)14{
  2. foreach w in h`i'ahous  h`i'ahoub  h`i'arles  h`i'atran  h`i'absns  
> h`i'aira  h`i'astck  h`i'achck  h`i'acd  h`i'abond  h`i'aothr  h`i'amor
> t h`i'ahmln  h`i'adebt  h`i'amrtb{
  3. replace `w' = 0 if `w' ==.
  4. }
  5. }
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(29,581 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(22,591 real changes made)
(24,242 real changes made)
(42,233 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(24,242 real changes made)
(42,233 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(20,849 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(22,655 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(24,068 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(22,104 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(23,764 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(25,016 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(20,199 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(21,679 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(23,486 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(21,321 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)
(25,087 real changes made)

. forvalues i=1(1)14{
  2.         replace asset_`i' = h`i'ahous + h`i'ahoub + h`i'arles + h`i'
> atran + h`i'absns + h`i'aira + h`i'astck + h`i'achck + h`i'acd + h`i'ab
> ond + h`i'aothr - h`i'amort - h`i'ahmln - h`i'adebt - h`i'amrtb if asse
> t_`i'==.
  3.         *replace asset_`i'=0 if asset_`i'<0
. }
(29,581 real changes made)
(22,591 real changes made)
(24,242 real changes made)
(20,849 real changes made)
(22,655 real changes made)
(24,068 real changes made)
(22,104 real changes made)
(23,764 real changes made)
(25,016 real changes made)
(20,199 real changes made)
(21,679 real changes made)
(23,486 real changes made)
(21,321 real changes made)
(25,087 real changes made)

. 
. /* number of living children */
. forvalues i = 1(1)14{
  2.         rename h`i'child child_liv_`i'
  3.         recode child_liv_`i' (.=0)
  4. }
(29,581 changes made to child_liv_1)
(22,591 changes made to child_liv_2)
(24,242 changes made to child_liv_3)
(20,849 changes made to child_liv_4)
(22,655 changes made to child_liv_5)
(24,068 changes made to child_liv_6)
(22,104 changes made to child_liv_7)
(23,764 changes made to child_liv_8)
(25,016 changes made to child_liv_9)
(20,199 changes made to child_liv_10)
(21,679 changes made to child_liv_11)
(23,486 changes made to child_liv_12)
(21,321 changes made to child_liv_13)
(25,087 changes made to child_liv_14)

. 
. * household capital income 
. forvalues i = 1(1)14{
  2.         rename h`i'icap capital_income_`i'
  3.         recode capital_income_`i' (. .u=0)
  4. 
. }
(29,581 changes made to capital_income_1)
(22,591 changes made to capital_income_2)
(24,242 changes made to capital_income_3)
(20,849 changes made to capital_income_4)
(22,655 changes made to capital_income_5)
(24,068 changes made to capital_income_6)
(22,104 changes made to capital_income_7)
(23,764 changes made to capital_income_8)
(25,016 changes made to capital_income_9)
(20,199 changes made to capital_income_10)
(21,679 changes made to capital_income_11)
(23,486 changes made to capital_income_12)
(21,321 changes made to capital_income_13)
(25,087 changes made to capital_income_14)

. 
. * total household income 
. forvalues i = 1(1)14{
  2.         gen fam_inc_`i' = income_`i' + s_income_`i' + capital_income
> _`i'
  3.         gen log_fam_inc_`i' = log(fam_inc_`i' + 10)
  4. }

. 
. * tabulate 
. preserve 

. 
.  use "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\Data\randhrsfam1992_2014v1_STATA\randhrsfamk1992_2014v1.dta" , cle
> ar 

. 
. * use "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data
> /Data_new/Data/randhrsfam1992_2014v1_STATA/randhrsfamk1992_2014v1.dta",
>  clear 
. 
. /* the data structure is: an individual stands for a kid */
. /* information on kids: number of shared children */
. * first, we need to clean the variable indicating whether the kid is al
> ive at every wave: 
. forvalues i = 1(1)12{
  2.         rename k`i'alive alive_`i'
  3. }

. gen child_dead = 0

. forvalues i = 1(1)12{
  2.         replace child_dead = 1 if alive_`i'==0 
  3. }
(0 real changes made)
(71 real changes made)
(253 real changes made)
(364 real changes made)
(311 real changes made)
(555 real changes made)
(422 real changes made)
(351 real changes made)
(394 real changes made)
(512 real changes made)
(423 real changes made)
(365 real changes made)

. 
. gen child_dead_wave = .
(128,908 missing values generated)

. forvalues i = 1(1)12{
  2.         replace child_dead_wave= `i' if alive_`i'==0 & child_dead_wa
> ve == . 
  3. }
(0 real changes made)
(71 real changes made)
(253 real changes made)
(364 real changes made)
(311 real changes made)
(555 real changes made)
(422 real changes made)
(351 real changes made)
(394 real changes made)
(512 real changes made)
(423 real changes made)
(365 real changes made)

. 
. 
. * the relationship between respondent and the children (best guess valu
> e)
. recode karel (2 6 7 12 = 0), gen(child) /* own child */ 
(23,526 differences between karel and child)

. /* in the dynamic model, the number of shared children would vary in di
> fferent waves, as some kids might not be alive in the waves */
. keep hhidpn child  child_dead child_dead_wave

. /*transform from long form to wide form */
. bysort hhidpn: gen kid_id = _n

. 
. * ever experienced kids' death 
. 
. 
. reshape wide child child_dead child_dead_wave, i(hhidpn) j(kid_id)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
>  27 28 29 30 31 32 33)

Data                               Long   ->   Wide
-------------------------------------------------------------------------
> ----
Number of observations          128,908   ->   34,413      
Number of variables                   5   ->   100         
j variable (33 values)           kid_id   ->   (dropped)
xij variables:
                                  child   ->   child1 child2 ... child33
                             child_dead   ->   child_dead1 child_dead2 ..
> . child_dead33
                        child_dead_wave   ->   child_dead_wave1 child_dea
> d_wave2 ... child_dead_wave33
-------------------------------------------------------------------------
> ----

. * calculate the number of shared children 
. gen child0 =0

. forvalues i = 1(1)33{
  2.         replace child0 = child0 + child`i' if child`i' != .
  3. }
(30,027 real changes made)
(26,394 real changes made)
(17,945 real changes made)
(11,420 real changes made)
(7,049 real changes made)
(4,492 real changes made)
(2,750 real changes made)
(1,809 real changes made)
(1,166 real changes made)
(773 real changes made)
(476 real changes made)
(318 real changes made)
(228 real changes made)
(166 real changes made)
(105 real changes made)
(70 real changes made)
(56 real changes made)
(32 real changes made)
(22 real changes made)
(18 real changes made)
(16 real changes made)
(10 real changes made)
(11 real changes made)
(6 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)

. rename child0 num_shared_child

. gen child_dead = 0

. gen child_dead_wave = .
(34,413 missing values generated)

. forvalues i = 1(1)33{
  2.         replace child_dead = 1 if child_dead`i' == 1
  3.         replace child_dead_wave = child_dead_wave`i' if child_dead_w
> ave`i'!=. & child_dead_wave`i'< child_dead_wave
  4. }
(1,166 real changes made)
(1,166 real changes made)
(765 real changes made)
(800 real changes made)
(483 real changes made)
(524 real changes made)
(326 real changes made)
(354 real changes made)
(186 real changes made)
(218 real changes made)
(135 real changes made)
(161 real changes made)
(70 real changes made)
(88 real changes made)
(58 real changes made)
(70 real changes made)
(23 real changes made)
(27 real changes made)
(22 real changes made)
(24 real changes made)
(12 real changes made)
(14 real changes made)
(9 real changes made)
(11 real changes made)
(6 real changes made)
(6 real changes made)
(2 real changes made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. 
. keep hhidpn num_shared_child child_dead child_dead_wave

. 
.  save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\rand_num_child.dta", replace 
file C:\Users\pangu\OneDrive -
    Nexus365\projects\HRS_project\Data\Data_new\rand_num_child.dta
    saved

. * save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Dat
> a/Data_new/rand_num_child.dta", replace
. 
. restore

.  merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\rand_num_child.dta" 

    Result                      Number of obs
    -----------------------------------------
    Not matched                         7,824
        from master                     7,822  (_merge==1)
        from using                          2  (_merge==2)

    Matched                            34,411  (_merge==3)
    -----------------------------------------

. * merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projec
> ts/HRS_project/Data/Data_new/rand_num_child.dta"
.  
.  /* 7822 cases from the master data doesn't contain information on kids
> , we assume they do not have shared kids */
. replace num_shared_child = 0 if _merge==1
(7,822 real changes made)

. drop if _m == 2 /* 2 cases dropped */ 
(2 observations deleted)

. drop _m 

. 
. /* merge with the marital history data */ 
.  merge 1:1 hhid pn using "C:\Users\pangu\OneDrive - Nexus365\projects\H
> RS_project\Data\Data_new\mar_history_revised.dta" 
(variable pn was str3, now str4 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,403
        from master                       501  (_merge==1)
        from using                        902  (_merge==2)

    Matched                            41,732  (_merge==3)
    -----------------------------------------

. *merge 1:1 hhid pn using "/Users/guanghuipan/OneDrive - Nexus365/projec
> ts/HRS_project/Data/Data_new/mar_history_revised.dta" 
. 
. 
. drop if _m == 1 | _m == 2 /*1403 cases dropped */
(1,403 observations deleted)

. drop _m 

. 
. 
. 
. /* marital related variables */ 
. * times of divorces
. forvalues i =1(1)14{
  2.         rename r`i'mdiv times_div_`i'
  3. }

. 
. * times of divorces for spouse 
. forvalues i =1(1)14{
  2.         rename s`i'mdiv s_times_div_`i'
  3. }

. 
. *length of longest marriage 
. 
. forvalues i = 1(1)14{
  2.         rename r`i'mlen marriage_len_`i'
  3. }

. 
. *length of longest marriage for spouse 
. forvalues i = 1(1)14{
  2.         rename s`i'mlen s_marriage_len_`i'
  3. }

. 
. *length of current marriage 
. forvalues i = 1(1)14{
  2.         rename r`i'mcurln cur_mar_len_`i'
  3. }

. 
. *length of current marriage for spouse 
. forvalues i = 1(1)14{
  2.         rename s`i'mcurln s_cur_mar_len_`i'
  3. }

. 
. * total times of marriage 
. forvalues i = 1(1)14{
  2.         rename r`i'mrct times_mar_`i'
  3. }

. 
. forvalues i = 1(1)14{
  2.         rename s`i'mrct s_times_mar_`i'
  3. }

. 
. * times widowed 
. forvalues i =1(1)14{
  2.         rename r`i'mwid times_wid_`i'
  3. }

. 
. * times widowed for spouse
. forvalues i =1(1)14{
  2.         rename s`i'mwid s_times_wid_`i'
  3. }

. 
. 
. /* covariates */ 
. 
. *respondents' information 
. 
. forvalues i=1(1)14{
  2.         gen log_asset_`i' = log(asset_`i'+100)
  3.         gen log_caital_income_`i' = log(capital_income_`i' + 10)
  4. }
(563 missing values generated)
(8,631 missing values generated)
(506 missing values generated)
(639 missing values generated)
(549 missing values generated)
(516 missing values generated)
(731 missing values generated)
(694 missing values generated)
(681 missing values generated)
(1,770 missing values generated)
(1,598 missing values generated)
(1,195 missing values generated)
(1,416 missing values generated)
(1,139 missing values generated)

.  *sum survival_year divorce ragender birth_year race educ birth_place m
> igration religion rank_income_4 drink_days_4 drink_num_4 cond_4 health_
> 4 hosp_4 hosp_time_4 cesd_4 s_birth_year_4 s_race_4 s_educ_4 s_birth_pl
> ace_4 s_migration_4 s_religion_4 s_rank_income_4 s_drink_days_4 s_drink
> _num_4 s_cond_4 s_health_4 s_hosp_4 s_hosp_time_4 s_cesd_4  rank_asset_
> 4 child_liv_4 num_shared_child times_div_4 s_times_div_4 times_mar_4 s_
> times_mar_4 times_wid_4 s_times_wid_4 marriage_len_4 s_marriage_len_4 c
> ur_mar_len_4 rawtsamp
. 
. /* find the information on wave 4 (wave of 1998) */ 
. * locate wave 4
. /* generating time-varying variables with the three-previous wave avera
> ge */
. gen drink_days_1 =.
(41,732 missing values generated)

. gen drink_days_2 =.
(41,732 missing values generated)

. gen drink_num_1 = .
(41,732 missing values generated)

. gen drink_num_2 = .
(41,732 missing values generated)

. gen hosp_time_1 = .
(41,732 missing values generated)

. gen hosp_1 = .
(41,732 missing values generated)

. gen doct_time_1 = . 
(41,732 missing values generated)

. gen nurs_home_1 = .
(41,732 missing values generated)

. gen nurs_home_2 = .
(41,732 missing values generated)

. gen cesd_1 = .
(41,732 missing values generated)

. gen proxy_memory_1 = .
(41,732 missing values generated)

. gen expend_1 = .
(41,732 missing values generated)

. gen expend_2 = . 
(41,732 missing values generated)

. gen adl_1 = .
(41,732 missing values generated)

. gen s_drink_days_1 =.
(41,732 missing values generated)

. gen s_drink_days_2 =.
(41,732 missing values generated)

. gen s_drink_num_1 = .
(41,732 missing values generated)

. gen s_drink_num_2 = .
(41,732 missing values generated)

. gen s_hosp_time_1 = .
(41,732 missing values generated)

. gen s_hosp_1 = .
(41,732 missing values generated)

. gen s_doct_time_1 = . 
(41,732 missing values generated)

. gen s_nurs_home_1 = .
(41,732 missing values generated)

. gen s_nurs_home_2 = .
(41,732 missing values generated)

. gen s_cesd_1 = .
(41,732 missing values generated)

. gen s_proxy_memory_1 = .
(41,732 missing values generated)

. gen s_expend_1 = .
(41,732 missing values generated)

. gen s_expend_2 = . 
(41,732 missing values generated)

. gen s_adl_1 = .
(41,732 missing values generated)

. 
. forvalues i = 4(1)14{
  2.         local j = `i' - 1
  3.         local k = `i' - 2
  4.         local m = `i' - 3
  5.         egen mean_drink_days_`i' = rowmean(drink_days_`j' drink_days
> _`k' drink_days_`m') 
  6.         egen mean_drink_num_`i' = rowmean(drink_num_`j' drink_num_`k
> ' drink_num_`m') 
  7.         egen max_cond_`i' = rowmax(cond_`j' cond_`k' cond_`m') 
  8.         egen mean_health_`i' = rowmean(health_`j' health_`k' health_
> `m') 
  9.         egen mean_hosp_time_`i' = rowmean(hosp_time_`j' hosp_time_`k
> ' hosp_time_`m') 
 10.         egen max_hosp_visit_`i' = rowmax(hosp_`j' hosp_`k' hosp_`m')
>  
 11.         egen mean_bmi_`i' =rowmean(bmi_`j' bmi_`k' bmi_`m')
 12.         egen max_nurs_home_`i'= rowmax(nurs_home_`j' nurs_home_`k' n
> urs_home_`m')
 13.         egen mean_cesd_`i' = rowmean(cesd_`j' cesd_`k' cesd_`m')
 14.         egen mean_expend_`i'= rowmean(expend_`j' expend_`k' expend_`
> m')
 15.         egen max_high_bp_`i' = rowmax(high_bp_`j' high_bp_`k' high_b
> p_`m')
 16.         egen max_diabetes_`i' = rowmax(diabetes_`j' diabetes_`k' dia
> betes_`m')
 17.         egen max_cancer_`i' = rowmax(cancer_`j' cancer_`k' cancer_`m
> ')
 18.         egen max_lung_`i' = rowmax(lung_`j' lung_`k' lung_`m')
 19.         egen max_heart_`i'= rowmax(heart_`j' heart_`k' heart_`m')
 20.         egen max_stroke_`i' = rowmax(stroke_`j' stroke_`k' stroke_`m
> ')
 21.         egen max_psych_`i' = rowmax(psych_`j' psych_`k' psych_`m')
 22.         egen max_arthritis_`i' = rowmax(arthritis_`j' arthritis_`k' 
> arthritis_`m')
 23.         egen max_smoke_`i' = rowmax(smoke_`j' smoke_`k' smoke_`m')
 24.         egen min_proxy_memory_`i' = rowmin(proxy_memory_`j' proxy_me
> mory_`k' proxy_memory_`m')
 25.         egen max_adl_`i'= rowmax(adl_`j' adl_`k' adl_`m')
 26.         egen s_mean_drink_days_`i' = rowmean(s_drink_days_`j' s_drin
> k_days_`k' s_drink_days_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn =
> = s`m'hhidpn
 27.         egen s_mean_drink_num_`i' = rowmean(s_drink_num_`j' s_drink_
> num_`k' s_drink_num_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`
> m'hhidpn
 28.         egen s_max_cond_`i' = rowmax(s_cond_`j' s_cond_`k' s_cond_`m
> ') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 29.         egen s_mean_health_`i' = rowmean(s_health_`j' s_health_`k' h
> ealth_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 30.         egen s_mean_hosp_time_`i' = rowmean(s_hosp_time_`j' s_hosp_t
> ime_`k' s_hosp_time_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`
> m'hhidpn
 31.         egen s_max_hosp_visit_`i' = rowmax(s_hosp_`j' s_hosp_`k' s_h
> osp_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 32.         egen s_mean_bmi_`i' =rowmean(s_bmi_`j' s_bmi_`k' s_bmi_`m') 
> if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 33.         egen s_max_nurs_home_`i'= rowmax(s_nurs_home_`j' s_nurs_home
> _`k' s_nurs_home_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'h
> hidpn
 34.         egen s_mean_cesd_`i' = rowmean(s_cesd_`j' s_cesd_`k' s_cesd_
> `m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 35.         egen s_mean_expend_`i'= rowmean(s_expend_`j' s_expend_`k' s_
> expend_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 36.         egen s_max_high_bp_`i' = rowmax(s_high_bp_`j' s_high_bp_`k' 
> s_high_bp_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 37.         egen s_max_diabetes_`i' = rowmax(s_diabetes_`j' s_diabetes_`
> k' s_diabetes_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhid
> pn
 38.         egen s_max_cancer_`i' = rowmax(s_cancer_`j' s_cancer_`k' s_c
> ancer_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 39.         egen s_max_lung_`i' = rowmax(s_lung_`j' s_lung_`k' s_lung_`m
> ') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 40.         egen s_max_heart_`i'= rowmax(s_heart_`j' s_heart_`k' s_heart
> _`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 41.         egen s_max_stroke_`i' = rowmax(s_stroke_`j' s_stroke_`k' s_s
> troke_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 42.         egen s_max_psych_`i' = rowmax(s_psych_`j' s_psych_`k' s_psyc
> h_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 43.         egen s_max_arthritis_`i' = rowmax(s_arthritis_`j' s_arthriti
> s_`k' s_arthritis_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'
> hhidpn
 44.         egen s_max_smoke_`i' = rowmax(s_smoke_`j' s_smoke_`k' s_smok
> e_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 45.         egen s_min_proxy_memory_`i' = rowmin(s_proxy_memory_`j' s_pr
> oxy_memory_`k' s_proxy_memory_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hh
> idpn == s`m'hhidpn
 46.         egen s_max_adl_`i'= rowmax(s_adl_`j' s_adl_`k' s_adl_`m') if
>  s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 47.         egen mean_log_fam_inc_`i' = rowmean(log_fam_inc_`i' log_fam_
> inc_`j' log_fam_inc_`k')
 48. }
(23,809 missing values generated)
(23,835 missing values generated)
(20,595 missing values generated)
(20,597 missing values generated)
(21,301 missing values generated)
(21,290 missing values generated)
(20,665 missing values generated)
(23,743 missing values generated)
(22,855 missing values generated)
(23,743 missing values generated)
(20,605 missing values generated)
(20,600 missing values generated)
(20,599 missing values generated)
(20,599 missing values generated)
(20,603 missing values generated)
(20,598 missing values generated)
(20,597 missing values generated)
(20,599 missing values generated)
(20,864 missing values generated)
(39,708 missing values generated)
(21,462 missing values generated)
(33,988 missing values generated)
(33,999 missing values generated)
(33,854 missing values generated)
(32,045 missing values generated)
(33,867 missing values generated)
(33,867 missing values generated)
(33,858 missing values generated)
(33,956 missing values generated)
(34,312 missing values generated)
(33,956 missing values generated)
(33,855 missing values generated)
(33,854 missing values generated)
(33,854 missing values generated)
(33,854 missing values generated)
(33,855 missing values generated)
(33,855 missing values generated)
(33,854 missing values generated)
(33,855 missing values generated)
(33,935 missing values generated)
(41,104 missing values generated)
(33,867 missing values generated)
(18,137 missing values generated)
(18,164 missing values generated)
(16,250 missing values generated)
(16,251 missing values generated)
(16,110 missing values generated)
(16,097 missing values generated)
(16,429 missing values generated)
(18,124 missing values generated)
(17,902 missing values generated)
(18,124 missing values generated)
(16,268 missing values generated)
(16,263 missing values generated)
(16,263 missing values generated)
(16,259 missing values generated)
(16,262 missing values generated)
(16,256 missing values generated)
(16,257 missing values generated)
(16,264 missing values generated)
(16,516 missing values generated)
(38,640 missing values generated)
(16,269 missing values generated)
(32,010 missing values generated)
(32,013 missing values generated)
(31,988 missing values generated)
(27,895 missing values generated)
(31,989 missing values generated)
(31,976 missing values generated)
(32,020 missing values generated)
(32,008 missing values generated)
(32,490 missing values generated)
(32,008 missing values generated)
(31,991 missing values generated)
(31,990 missing values generated)
(31,992 missing values generated)
(31,991 missing values generated)
(31,989 missing values generated)
(31,989 missing values generated)
(31,989 missing values generated)
(31,992 missing values generated)
(32,130 missing values generated)
(40,494 missing values generated)
(31,989 missing values generated)
(17,718 missing values generated)
(17,728 missing values generated)
(17,706 missing values generated)
(17,706 missing values generated)
(17,744 missing values generated)
(17,737 missing values generated)
(17,848 missing values generated)
(17,705 missing values generated)
(19,533 missing values generated)
(17,705 missing values generated)
(17,723 missing values generated)
(17,725 missing values generated)
(17,725 missing values generated)
(17,714 missing values generated)
(17,717 missing values generated)
(17,715 missing values generated)
(17,717 missing values generated)
(17,719 missing values generated)
(17,960 missing values generated)
(38,237 missing values generated)
(17,734 missing values generated)
(33,001 missing values generated)
(33,003 missing values generated)
(33,000 missing values generated)
(29,156 missing values generated)
(33,001 missing values generated)
(33,001 missing values generated)
(33,042 missing values generated)
(33,000 missing values generated)
(33,530 missing values generated)
(33,000 missing values generated)
(33,004 missing values generated)
(33,004 missing values generated)
(33,007 missing values generated)
(33,004 missing values generated)
(33,002 missing values generated)
(33,002 missing values generated)
(33,002 missing values generated)
(33,002 missing values generated)
(33,147 missing values generated)
(40,486 missing values generated)
(33,001 missing values generated)
(19,189 missing values generated)
(19,201 missing values generated)
(19,188 missing values generated)
(19,188 missing values generated)
(19,221 missing values generated)
(19,207 missing values generated)
(19,348 missing values generated)
(19,185 missing values generated)
(21,101 missing values generated)
(19,185 missing values generated)
(19,202 missing values generated)
(19,206 missing values generated)
(19,208 missing values generated)
(19,199 missing values generated)
(19,199 missing values generated)
(19,198 missing values generated)
(19,199 missing values generated)
(19,205 missing values generated)
(19,411 missing values generated)
(38,160 missing values generated)
(19,200 missing values generated)
(31,242 missing values generated)
(31,244 missing values generated)
(31,242 missing values generated)
(26,529 missing values generated)
(31,243 missing values generated)
(31,242 missing values generated)
(31,289 missing values generated)
(31,242 missing values generated)
(31,946 missing values generated)
(31,242 missing values generated)
(31,246 missing values generated)
(31,246 missing values generated)
(31,250 missing values generated)
(31,245 missing values generated)
(31,245 missing values generated)
(31,244 missing values generated)
(31,244 missing values generated)
(31,245 missing values generated)
(31,372 missing values generated)
(40,195 missing values generated)
(31,242 missing values generated)
(17,603 missing values generated)
(17,618 missing values generated)
(17,586 missing values generated)
(17,589 missing values generated)
(17,641 missing values generated)
(17,625 missing values generated)
(17,837 missing values generated)
(17,586 missing values generated)
(19,605 missing values generated)
(17,586 missing values generated)
(17,607 missing values generated)
(17,608 missing values generated)
(17,618 missing values generated)
(17,600 missing values generated)
(17,598 missing values generated)
(17,596 missing values generated)
(17,610 missing values generated)
(17,605 missing values generated)
(17,792 missing values generated)
(38,247 missing values generated)
(17,602 missing values generated)
(32,078 missing values generated)
(32,078 missing values generated)
(32,077 missing values generated)
(27,585 missing values generated)
(32,077 missing values generated)
(32,077 missing values generated)
(32,116 missing values generated)
(32,077 missing values generated)
(32,674 missing values generated)
(32,077 missing values generated)
(32,081 missing values generated)
(32,082 missing values generated)
(32,083 missing values generated)
(32,081 missing values generated)
(32,080 missing values generated)
(32,080 missing values generated)
(32,079 missing values generated)
(32,082 missing values generated)
(32,190 missing values generated)
(40,370 missing values generated)
(32,077 missing values generated)
(19,290 missing values generated)
(19,294 missing values generated)
(19,276 missing values generated)
(19,279 missing values generated)
(19,326 missing values generated)
(19,304 missing values generated)
(19,825 missing values generated)
(19,276 missing values generated)
(20,889 missing values generated)
(19,276 missing values generated)
(19,294 missing values generated)
(19,294 missing values generated)
(19,307 missing values generated)
(19,294 missing values generated)
(19,294 missing values generated)
(19,290 missing values generated)
(19,297 missing values generated)
(19,294 missing values generated)
(19,464 missing values generated)
(38,578 missing values generated)
(19,282 missing values generated)
(32,908 missing values generated)
(32,909 missing values generated)
(32,908 missing values generated)
(28,545 missing values generated)
(32,908 missing values generated)
(32,908 missing values generated)
(32,969 missing values generated)
(32,908 missing values generated)
(33,310 missing values generated)
(32,908 missing values generated)
(32,911 missing values generated)
(32,915 missing values generated)
(32,918 missing values generated)
(32,915 missing values generated)
(32,914 missing values generated)
(32,913 missing values generated)
(32,912 missing values generated)
(32,916 missing values generated)
(33,016 missing values generated)
(40,592 missing values generated)
(32,908 missing values generated)
(20,671 missing values generated)
(20,679 missing values generated)
(20,665 missing values generated)
(20,671 missing values generated)
(20,718 missing values generated)
(20,692 missing values generated)
(21,458 missing values generated)
(20,665 missing values generated)
(21,966 missing values generated)
(20,665 missing values generated)
(20,684 missing values generated)
(20,687 missing values generated)
(20,701 missing values generated)
(20,684 missing values generated)
(20,688 missing values generated)
(20,679 missing values generated)
(20,694 missing values generated)
(20,685 missing values generated)
(20,840 missing values generated)
(39,014 missing values generated)
(20,671 missing values generated)
(31,914 missing values generated)
(31,916 missing values generated)
(31,913 missing values generated)
(27,149 missing values generated)
(31,914 missing values generated)
(31,914 missing values generated)
(32,052 missing values generated)
(31,913 missing values generated)
(32,259 missing values generated)
(31,913 missing values generated)
(31,917 missing values generated)
(31,918 missing values generated)
(31,924 missing values generated)
(31,917 missing values generated)
(31,918 missing values generated)
(31,917 missing values generated)
(31,919 missing values generated)
(31,919 missing values generated)
(32,011 missing values generated)
(40,635 missing values generated)
(31,913 missing values generated)
(16,000 missing values generated)
(16,011 missing values generated)
(15,985 missing values generated)
(15,992 missing values generated)
(16,256 missing values generated)
(16,228 missing values generated)
(24,885 missing values generated)
(15,984 missing values generated)
(17,245 missing values generated)
(15,984 missing values generated)
(16,008 missing values generated)
(16,009 missing values generated)
(16,027 missing values generated)
(16,014 missing values generated)
(16,014 missing values generated)
(16,008 missing values generated)
(16,019 missing values generated)
(16,006 missing values generated)
(16,150 missing values generated)
(39,202 missing values generated)
(16,112 missing values generated)
(33,064 missing values generated)
(33,066 missing values generated)
(33,064 missing values generated)
(28,627 missing values generated)
(33,065 missing values generated)
(33,065 missing values generated)
(34,309 missing values generated)
(33,063 missing values generated)
(33,333 missing values generated)
(33,063 missing values generated)
(33,068 missing values generated)
(33,070 missing values generated)
(33,075 missing values generated)
(33,068 missing values generated)
(33,068 missing values generated)
(33,070 missing values generated)
(33,074 missing values generated)
(33,068 missing values generated)
(33,149 missing values generated)
(40,870 missing values generated)
(33,063 missing values generated)
(17,181 missing values generated)
(17,179 missing values generated)
(17,172 missing values generated)
(17,177 missing values generated)
(17,264 missing values generated)
(17,236 missing values generated)
(23,635 missing values generated)
(17,169 missing values generated)
(18,345 missing values generated)
(17,169 missing values generated)
(17,203 missing values generated)
(17,194 missing values generated)
(17,209 missing values generated)
(17,193 missing values generated)
(17,199 missing values generated)
(17,191 missing values generated)
(17,200 missing values generated)
(17,188 missing values generated)
(17,321 missing values generated)
(39,354 missing values generated)
(17,196 missing values generated)
(33,884 missing values generated)
(33,885 missing values generated)
(33,885 missing values generated)
(29,560 missing values generated)
(33,883 missing values generated)
(33,883 missing values generated)
(35,184 missing values generated)
(33,883 missing values generated)
(34,137 missing values generated)
(33,883 missing values generated)
(33,892 missing values generated)
(33,891 missing values generated)
(33,897 missing values generated)
(33,888 missing values generated)
(33,891 missing values generated)
(33,890 missing values generated)
(33,893 missing values generated)
(33,889 missing values generated)
(33,956 missing values generated)
(40,995 missing values generated)
(33,883 missing values generated)
(18,813 missing values generated)
(18,817 missing values generated)
(18,809 missing values generated)
(18,811 missing values generated)
(18,893 missing values generated)
(18,869 missing values generated)
(24,340 missing values generated)
(18,807 missing values generated)
(19,992 missing values generated)
(18,807 missing values generated)
(18,841 missing values generated)
(18,838 missing values generated)
(18,851 missing values generated)
(18,829 missing values generated)
(18,834 missing values generated)
(18,825 missing values generated)
(18,838 missing values generated)
(18,832 missing values generated)
(18,942 missing values generated)
(39,489 missing values generated)
(18,826 missing values generated)
(31,654 missing values generated)
(31,656 missing values generated)
(31,655 missing values generated)
(25,939 missing values generated)
(31,658 missing values generated)
(31,657 missing values generated)
(33,043 missing values generated)
(31,653 missing values generated)
(31,931 missing values generated)
(31,653 missing values generated)
(31,663 missing values generated)
(31,661 missing values generated)
(31,666 missing values generated)
(31,657 missing values generated)
(31,661 missing values generated)
(31,661 missing values generated)
(31,665 missing values generated)
(31,661 missing values generated)
(31,715 missing values generated)
(40,930 missing values generated)
(31,655 missing values generated)
(16,336 missing values generated)
(16,350 missing values generated)
(16,312 missing values generated)
(16,320 missing values generated)
(16,460 missing values generated)
(16,426 missing values generated)
(24,225 missing values generated)
(16,311 missing values generated)
(17,444 missing values generated)
(16,311 missing values generated)
(16,345 missing values generated)
(16,348 missing values generated)
(16,358 missing values generated)
(16,334 missing values generated)
(16,341 missing values generated)
(16,329 missing values generated)
(16,348 missing values generated)
(16,338 missing values generated)
(16,434 missing values generated)
(39,683 missing values generated)
(16,336 missing values generated)
(32,998 missing values generated)
(33,000 missing values generated)
(32,999 missing values generated)
(27,944 missing values generated)
(32,998 missing values generated)
(32,998 missing values generated)
(34,191 missing values generated)
(32,998 missing values generated)
(33,240 missing values generated)
(32,998 missing values generated)
(33,012 missing values generated)
(33,005 missing values generated)
(33,012 missing values generated)
(33,004 missing values generated)
(33,007 missing values generated)
(33,002 missing values generated)
(33,008 missing values generated)
(33,004 missing values generated)
(33,046 missing values generated)
(41,084 missing values generated)
(32,998 missing values generated)

. 
. 
. /* cases selection */ 
. 
. keep if r4mstat == 1 /* 27913 cases deleted, 13819 cases remaining */ 
(27,913 observations deleted)

. drop if birth_year >= 1948 /* set as older than 50 */
(775 observations deleted)

. forvalues i = 4(1)14{
  2.         drop if r`i'mstat ==8
  3. } /* drop the individuals with never married */
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2 observations deleted)
(2 observations deleted)
(1 observation deleted)
(9 observations deleted)
(6 observations deleted)
(9 observations deleted)
(5 observations deleted)
(4 observations deleted)

. 
. forvalues i = 4(1)14{
  2.         drop if s`i'gender == ragender 
  3. } /* drop same-sex marriage */ 
(1 observation deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(1 observation deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

. 
. 
. /* treatment variable: whether widowed after the observed year*/
. forvalues i = 4(1)14{
  2.         gen widow_`i' = 0 
  3. }

. 
. replace widow_4 = 1 if r4mstat == 7
(0 real changes made)

. /* calculate the widowhood age */
. gen year_widow = 1998 if widow_4 == 1
(13,004 missing values generated)

.  
. forvalues i = 5(1)14{
  2.         local j =  `i' - 1
  3.         replace widow_`i' = 1 if widow_`j' == 1 
  4.         replace widow_`i'  = 1 if r`i'mstat == 7
  5. }
(0 real changes made)
(471 real changes made)
(471 real changes made)
(461 real changes made)
(932 real changes made)
(398 real changes made)
(1,330 real changes made)
(416 real changes made)
(1,746 real changes made)
(377 real changes made)
(2,123 real changes made)
(389 real changes made)
(2,512 real changes made)
(326 real changes made)
(2,838 real changes made)
(326 real changes made)
(3,164 real changes made)
(298 real changes made)
(3,462 real changes made)
(223 real changes made)

. 
. *find the newly-widowed 
. forvalues i = 5(1)14{
  2.         local j = `i' - 1
  3.         replace year_widow = `i'* 2 + 1990 if widow_`i' == 1 & widow
> _`j' == 0
  4. }
(471 real changes made)
(461 real changes made)
(398 real changes made)
(416 real changes made)
(377 real changes made)
(389 real changes made)
(326 real changes made)
(326 real changes made)
(298 real changes made)
(223 real changes made)

. 
. 
. /* find out the cases widowed and again remarried */ 
. forvalues i = 4(1)14{
  2.         gen wid_remar_`i' = 0
  3. }

. 
. 
. forvalues i = 5(1)14{
  2.         local j = `i' - 1
  3.         replace wid_remar_`i' = 1 if wid_remar_`j' == 1
  4.         replace wid_remar_`i' = 1 if widow_`i' == 1 & (r`i'mstat == 
> 1 | r`i'mstat == 2 | r`i'mstat == 3) 
  5. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21 real changes made)
(21 real changes made)
(31 real changes made)
(52 real changes made)
(26 real changes made)
(78 real changes made)
(16 real changes made)
(94 real changes made)
(35 real changes made)
(129 real changes made)
(19 real changes made)
(148 real changes made)
(16 real changes made)
(164 real changes made)
(14 real changes made)
(178 real changes made)
(14 real changes made)

. *drop all the cases which widowed and then remarried 
. forvalues i = 5(1)14{
  2.         drop if wid_remar_`i' == 1
  3. }
(0 observations deleted)
(21 observations deleted)
(31 observations deleted)
(26 observations deleted)
(16 observations deleted)
(35 observations deleted)
(19 observations deleted)
(16 observations deleted)
(14 observations deleted)
(14 observations deleted)

. 
. /* status of divorce */ 
. 
. 
. forvalues i = 4(1)14{
  2.         gen divorce_`i' = 0
  3. }

. replace divorce_4 = 1 if r4mstat== 4 | r4mstat == 5 | r4mstat == 6 
(0 real changes made)

. 
. forvalues i = 5(1)14{
  2.         local j = `i' - 1
  3.         replace divorce_`i' = 1 if divorce_`j' == 1
  4.         replace divorce_`i' = 1 if r`i'mstat == 4 | r`i'mstat == 5| 
> r`i'mstat == 6 
  5. }
(0 real changes made)
(61 real changes made)
(61 real changes made)
(71 real changes made)
(132 real changes made)
(44 real changes made)
(176 real changes made)
(51 real changes made)
(227 real changes made)
(43 real changes made)
(270 real changes made)
(42 real changes made)
(312 real changes made)
(24 real changes made)
(336 real changes made)
(16 real changes made)
(352 real changes made)
(13 real changes made)
(365 real changes made)
(14 real changes made)

. 
. /* generate the variables for time */ 
. 
. gen failure_year = death_year - int_year_1998 /* we define the survival
>  time as the year interval between the observation start year (1998) an
> d the death year*/ 
(6,722 missing values generated)

. 
. gen censor_year =  rexityr - int_year_1998 if death_year == . 
(12,757 missing values generated)

. replace censor_year = int_year_2018 - int_year_1998 if rexityr == . 
(0 real changes made)

. replace censor_year = 2018 - int_year_1998 if censor_year == . /* right
>  censored */ 
(12,757 real changes made)

. 
. gen censor_age =  rexityr - birth_year if death_year == . 
(12,757 missing values generated)

. replace censor_age = int_year_2018 - birth_year if rexityr == . 
(0 real changes made)

. replace censor_age = 2018 - birth_year if censor_age == . /* right cens
> ored */ 
(12,757 real changes made)

. 
. gen survival_year = min(failure_year, censor_year)

. gen right_censor = 0 if failure_year <= censor_year
(6,728 missing values generated)

. replace right_censor = 1 if right_censor != 0
(6,728 real changes made)

. drop if survival_year< 0
(0 observations deleted)

. 
. gen right_censor_alive = 1 if right_censor == 1 & rexityr == .
(12,812 missing values generated)

. replace right_censor_alive = 0 if right_censor_alive != 1
(12,812 real changes made)

. 
. gen right_censor_exit = 1 if right_censor == 1 & rexityr != .
(6,084 missing values generated)

. replace right_censor_exit = 0 if right_censor_exit != 1
(6,084 real changes made)

. 
. gen death = 1 if death_year != .
(6,722 missing values generated)

. 
. gen year_gap = survival_year - year_widow + int_year_1998 /* robustness
>  check for shorter/longer period effects of widowhood */
(9,319 missing values generated)

. 
. * generate a wave-specific gap between widowhood and interview year 
. forvalues i = 4(1)14{
  2.         gen year_since_widow_`i' = int_year_wave_`i' - year_widow if
>  int_year_wave_`i'>= year_widow
  3. }
(12,812 missing values generated)
(12,382 missing values generated)
(12,019 missing values generated)
(11,769 missing values generated)
(11,530 missing values generated)
(11,353 missing values generated)
(11,243 missing values generated)
(11,153 missing values generated)
(11,108 missing values generated)
(11,217 missing values generated)
(11,433 missing values generated)

. replace death = 0 if death != 1
(6,722 real changes made)

. 
. gen wid = widow_14

. tab wid death if male == 1

           |         death
       wid |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,576      3,095 |     5,671 
         1 |       461        535 |       996 
-----------+----------------------+----------
     Total |     3,037      3,630 |     6,667 

. tab wid death if male == 0 

           |         death
       wid |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,192      1,456 |     3,648 
         1 |     1,493      1,004 |     2,497 
-----------+----------------------+----------
     Total |     3,685      2,460 |     6,145 

. 
. * tabulate for each subgroups 
. 
. /* generate the variables indicating homogamy */ 
. /*educational homogamy */ 
. gen educ_homo = 1 if educ == s_educ_4
(7,201 missing values generated)

. replace educ_homo = 0 if educ_homo != 1
(7,201 real changes made)

. 
. 
. /* religion homogamy */ 
. gen reli_homo = 1 if religion == s_religion_4
(2,108 missing values generated)

. replace reli_homo = 0 if reli_homo != 1
(2,108 real changes made)

. 
. 
. /* geographical homogamy */ 
. gen geo_homo = 1 if birth_place == s_birth_place_4
(4,214 missing values generated)

. replace geo_homo = 0 if geo_homo != 1
(4,214 real changes made)

. 
. /* asset missing */ 
. gen asset_miss = 1 if asset_4 ==.
(12,812 missing values generated)

. replace asset_miss = 0 if asset_miss != 1
(12,812 real changes made)

. replace asset_4 = 0 if asset_4 == . 
(0 real changes made)

. 
. /* age difference */ 
. gen age_diff = abs(birth_year - s_birth_year_4)
(5 missing values generated)

. 
. * education 
. recode educ (1 2 3 .m = 0)(4 5 = 1), gen(college)
(12,812 differences between educ and college)

. recode s_educ_4 (1 2 3 .m= 0)(4 5 = 1), gen(s_college)
(12,704 differences between s_educ_4 and s_college)

. 
. * college homogamy
. gen college_homo = 1 if college == 1 & s_college == 1
(9,593 missing values generated)

. replace college_homo = 2 if college == 1 & s_college == 0
(1,734 real changes made)

. replace college_homo = 3 if college == 0 & s_college == 1
(1,729 real changes made)

. replace college_homo = 4 if college == 0 & s_college == 0
(6,022 real changes made)

. 
. * race 
. gen white = 1 if race == 1
(1,699 missing values generated)

. replace white = 0 if white != 1
(1,699 real changes made)

. 
. gen black = 1 if race == 2
(11,526 missing values generated)

. replace black = 0 if black != 1
(11,526 real changes made)

. 
. * racial homogamy 
. gen racial_homo = 1 if white == 1 & s_white_4 == 1
(1,970 missing values generated)

. replace racial_homo = 2 if white == 1 & s_white_4 != 1
(271 real changes made)

. replace racial_homo = 3 if white == 0 & s_white_4 == 1
(196 real changes made)

. replace racial_homo = 4 if white == 0 & s_white_4 == 0
(1,503 real changes made)

. * after selecting the cases, we can generate the percentile variables
. /* transfer income to income rank */ 
. forvalues i = 1(1)14{
  2.         xtile rank_income_`i' = income_`i', nq(5)
  3.         xtile s_rank_income_`i' = s_income_`i', nq(5)
  4.         xtile rank_fam_inc_`i' = fam_inc_`i', nq(3)
  5.         xtile rank_asset_`i' = asset_`i', nq(3)
  6. }

. 
. forvalues i = 4(1)14{
  2.         local j = `i' - 1
  3.         local k = `i' - 2
  4.         local m = `i' - 3
  5.         egen min_income_rank_`i' = rowmin(rank_income_`m' rank_incom
> e_`j' rank_income_`k') 
  6.         egen min_asset_rank_`i' = rowmin(rank_asset_`m' rank_asset_`
> j' rank_asset_`k')
  7.         egen s_min_income_rank_`i' = rowmin(s_rank_income_`m' s_rank
> _income_`j' s_rank_income_`k') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn
>  == s`m'hhidpn
  8.         egen mean_log_fam_income_`i' = rowmean(log_fam_inc_`m' log_f
> am_inc_`j' log_fam_inc_`k')
  9.         egen mean_log_asset_`i' = rowmean(log_asset_`m' log_asset_`j
> ' log_asset_`k')
 10.         egen mean_log_income_`i' = rowmean(log_income_`m' log_income
> _`j' log_income_`k')
 11.         egen s_mean_log_income_`i' = rowmean(s_log_income_`m' s_log_
> income_`j' s_log_income_`k') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn =
> = s`m'hhidpn
 12.         egen max_pension_`i' = rowmax(pension_`j' pension_`k' pensio
> n_`m')
 13.         egen s_max_pension_`i' = rowmax(s_pension_`j' s_pension_`k' 
> s_pension_`m') if s`j'hhidpn == s`k'hhidpn & s`j'hhidpn == s`m'hhidpn
 14. }
(3,274 missing values generated)
(19 missing values generated)
(3,274 missing values generated)
(3,274 missing values generated)
(3,733 missing values generated)
(24 missing values generated)
(3,733 missing values generated)
(3,733 missing values generated)
(4,675 missing values generated)
(9 missing values generated)
(4,675 missing values generated)
(4,675 missing values generated)
(3,356 missing values generated)
(16 missing values generated)
(3,356 missing values generated)
(3,356 missing values generated)
(3,127 missing values generated)
(11 missing values generated)
(3,127 missing values generated)
(3,127 missing values generated)
(2,844 missing values generated)
(15 missing values generated)
(2,844 missing values generated)
(2,844 missing values generated)
(2,803 missing values generated)
(13 missing values generated)
(2,803 missing values generated)
(2,803 missing values generated)
(2,959 missing values generated)
(22 missing values generated)
(2,959 missing values generated)
(2,959 missing values generated)
(2,797 missing values generated)
(30 missing values generated)
(2,797 missing values generated)
(2,797 missing values generated)
(2,582 missing values generated)
(35 missing values generated)
(2,582 missing values generated)
(2,582 missing values generated)
(2,763 missing values generated)
(17 missing values generated)
(2,763 missing values generated)
(2,763 missing values generated)

. /* income homogamy */
. gen inc_homo = 1 if rank_income_4 == s_rank_income_4
(10,055 missing values generated)

. replace inc_homo = 0 if inc_homo != 1
(10,055 real changes made)

. gen inc_miss = 1 if rank_income_4 == . 
(12,812 missing values generated)

. replace inc_miss = 0 if inc_miss != 1
(12,812 real changes made)

. 
. *asset distribution 
. gen asset_class = 1 if rank_asset_4 == 1
(8,540 missing values generated)

. replace asset_class = 2 if rank_asset_4 == 2
(4,273 real changes made)

. replace asset_class = 3 if rank_asset_4 == 3
(4,267 real changes made)

. 
. 
. * descriptive table 
. *education level
. foreach i in college college_homo white black racial_homo asset_class{
  2.         sort `i'
  3.         by `i': tab death wid if male == 1
  4.         by `i': tab death wid if male == 0 
  5. }

-------------------------------------------------------------------------
-> college = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,276        289 |     1,565 
         1 |     1,983        369 |     2,352 
-----------+----------------------+----------
     Total |     3,259        658 |     3,917 

-------------------------------------------------------------------------
-> college = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,300        172 |     1,472 
         1 |     1,112        166 |     1,278 
-----------+----------------------+----------
     Total |     2,412        338 |     2,750 


-------------------------------------------------------------------------
-> college = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,197        962 |     2,159 
         1 |     1,012        717 |     1,729 
-----------+----------------------+----------
     Total |     2,209      1,679 |     3,888 

-------------------------------------------------------------------------
-> college = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       995        531 |     1,526 
         1 |       444        287 |       731 
-----------+----------------------+----------
     Total |     1,439        818 |     2,257 


-------------------------------------------------------------------------
-> college_homo = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       871        100 |       971 
         1 |       643         99 |       742 
-----------+----------------------+----------
     Total |     1,514        199 |     1,713 

-------------------------------------------------------------------------
-> college_homo = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       404         70 |       474 
         1 |       464         66 |       530 
-----------+----------------------+----------
     Total |       868        136 |     1,004 

-------------------------------------------------------------------------
-> college_homo = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       301         52 |       353 
         1 |       385         61 |       446 
-----------+----------------------+----------
     Total |       686        113 |       799 

-------------------------------------------------------------------------
-> college_homo = 4

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       956        237 |     1,193 
         1 |     1,597        304 |     1,901 
-----------+----------------------+----------
     Total |     2,553        541 |     3,094 

-------------------------------------------------------------------------
-> college_homo = .

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        44          2 |        46 
         1 |         6          5 |        11 
-----------+----------------------+----------
     Total |        50          7 |        57 


-------------------------------------------------------------------------
-> college_homo = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       713        339 |     1,052 
         1 |       282        172 |       454 
-----------+----------------------+----------
     Total |       995        511 |     1,506 

-------------------------------------------------------------------------
-> college_homo = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       270        186 |       456 
         1 |       161        113 |       274 
-----------+----------------------+----------
     Total |       431        299 |       730 

-------------------------------------------------------------------------
-> college_homo = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       346        238 |       584 
         1 |       212        134 |       346 
-----------+----------------------+----------
     Total |       558        372 |       930 

-------------------------------------------------------------------------
-> college_homo = 4

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       827        723 |     1,550 
         1 |       798        580 |     1,378 
-----------+----------------------+----------
     Total |     1,625      1,303 |     2,928 

-------------------------------------------------------------------------
-> college_homo = .

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        36          7 |        43 
         1 |         3          5 |         8 
-----------+----------------------+----------
     Total |        39         12 |        51 


-------------------------------------------------------------------------
-> white = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       338         69 |       407 
         1 |       408         70 |       478 
-----------+----------------------+----------
     Total |       746        139 |       885 

-------------------------------------------------------------------------
-> white = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,238        392 |     2,630 
         1 |     2,687        465 |     3,152 
-----------+----------------------+----------
     Total |     4,925        857 |     5,782 


-------------------------------------------------------------------------
-> white = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       269        221 |       490 
         1 |       200        124 |       324 
-----------+----------------------+----------
     Total |       469        345 |       814 

-------------------------------------------------------------------------
-> white = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,923      1,272 |     3,195 
         1 |     1,256        880 |     2,136 
-----------+----------------------+----------
     Total |     3,179      2,152 |     5,331 


-------------------------------------------------------------------------
-> black = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,349        403 |     2,752 
         1 |     2,775        479 |     3,254 
-----------+----------------------+----------
     Total |     5,124        882 |     6,006 

-------------------------------------------------------------------------
-> black = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       227         58 |       285 
         1 |       320         56 |       376 
-----------+----------------------+----------
     Total |       547        114 |       661 


-------------------------------------------------------------------------
-> black = 0

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,994      1,334 |     3,328 
         1 |     1,293        899 |     2,192 
-----------+----------------------+----------
     Total |     3,287      2,233 |     5,520 

-------------------------------------------------------------------------
-> black = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       198        159 |       357 
         1 |       163        105 |       268 
-----------+----------------------+----------
     Total |       361        264 |       625 


-------------------------------------------------------------------------
-> racial_homo = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,167        379 |     2,546 
         1 |     2,632        459 |     3,091 
-----------+----------------------+----------
     Total |     4,799        838 |     5,637 

-------------------------------------------------------------------------
-> racial_homo = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        71         13 |        84 
         1 |        55          6 |        61 
-----------+----------------------+----------
     Total |       126         19 |       145 

-------------------------------------------------------------------------
-> racial_homo = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        54          6 |        60 
         1 |        45          6 |        51 
-----------+----------------------+----------
     Total |        99         12 |       111 

-------------------------------------------------------------------------
-> racial_homo = 4

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       284         63 |       347 
         1 |       363         64 |       427 
-----------+----------------------+----------
     Total |       647        127 |       774 


-------------------------------------------------------------------------
-> racial_homo = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,857      1,244 |     3,101 
         1 |     1,235        869 |     2,104 
-----------+----------------------+----------
     Total |     3,092      2,113 |     5,205 

-------------------------------------------------------------------------
-> racial_homo = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        66         28 |        94 
         1 |        21         11 |        32 
-----------+----------------------+----------
     Total |        87         39 |       126 

-------------------------------------------------------------------------
-> racial_homo = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |        30         28 |        58 
         1 |        18          9 |        27 
-----------+----------------------+----------
     Total |        48         37 |        85 

-------------------------------------------------------------------------
-> racial_homo = 4

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       239        193 |       432 
         1 |       182        115 |       297 
-----------+----------------------+----------
     Total |       421        308 |       729 


-------------------------------------------------------------------------
-> asset_class = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       721        169 |       890 
         1 |     1,151        209 |     1,360 
-----------+----------------------+----------
     Total |     1,872        378 |     2,250 

-------------------------------------------------------------------------
-> asset_class = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       889        139 |     1,028 
         1 |     1,031        152 |     1,183 
-----------+----------------------+----------
     Total |     1,920        291 |     2,211 

-------------------------------------------------------------------------
-> asset_class = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       966        153 |     1,119 
         1 |       913        174 |     1,087 
-----------+----------------------+----------
     Total |     1,879        327 |     2,206 


-------------------------------------------------------------------------
-> asset_class = 1

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       566        520 |     1,086 
         1 |       548        388 |       936 
-----------+----------------------+----------
     Total |     1,114        908 |     2,022 

-------------------------------------------------------------------------
-> asset_class = 2

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       770        492 |     1,262 
         1 |       460        340 |       800 
-----------+----------------------+----------
     Total |     1,230        832 |     2,062 

-------------------------------------------------------------------------
-> asset_class = 3

           |          wid
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |       856        481 |     1,337 
         1 |       448        276 |       724 
-----------+----------------------+----------
     Total |     1,304        757 |     2,061 


. 
. 
. /* if survival year = ., it means right censored */ 
. /* transfer death year into death wave */
. recode death_year (1998 1999 = 4)(2000 2001 = 5)(2002 2003 = 6)(2004 20
> 05 = 7)(2006 2007 =8)(2008 2009 = 9)(2010 2011 = 10)(2012 2013 = 11)(20
> 14 2015 = 12)(2016 2017 = 13)(2018 2019 =14), gen(death_wave)
(6,090 differences between death_year and death_wave)

. recode rexityr (1998 1999 = 4)(2000 2001 = 5)(2002 2003 = 6)(2004 2005 
> = 7)(2006 2007 =8)(2008 2009 = 9)(2010 2011 = 10)(2012 2013 = 11)(2014 
> 2015 = 12)(2016 2017 = 13)(2018 2019 =14), gen(exit_wave)
(5,644 differences between rexityr and exit_wave)

. replace death_wave = exit_wave if death_wave == . & exit_wave != .y & e
> xit_wave != .z
(55 real changes made)

. replace death_wave = 14 if right_censor == 1
(6,722 real changes made)

. 
. forvalues i = 4(1)14{
  2.         gen wave_start_`i' = 2*`i'+ 1990
  3.         gen wave_end_`i' = 2*`i' + 1991 
  4. }

. 
. 
. forvalues i = 4(1)14{
  2.         gen wave_start_age_`i' = wave_start_`i' - birth_year
  3.         gen wave_end_age_`i' = wave_end_`i' - birth_year
  4. }

. * age at current wave 
. forvalues i = 4(1)14{
  2.         gen wave_age_`i' = int_year_wave_`i' - birth_year
  3.         gen s_wave_age_`i' = int_year_wave_`i' - s_birth_year_4
  4. }
(5 missing values generated)
(1,306 missing values generated)
(1,308 missing values generated)
(2,144 missing values generated)
(2,145 missing values generated)
(2,906 missing values generated)
(2,908 missing values generated)
(3,634 missing values generated)
(3,636 missing values generated)
(4,322 missing values generated)
(4,324 missing values generated)
(5,179 missing values generated)
(5,180 missing values generated)
(5,807 missing values generated)
(5,808 missing values generated)
(6,670 missing values generated)
(6,671 missing values generated)
(7,673 missing values generated)
(7,673 missing values generated)
(8,745 missing values generated)
(8,745 missing values generated)

. 
. gen divorce_censor = 0

. forvalues i = 4(1)14{
  2.         replace divorce_censor = 1 if divorce_`i'== 1
  3. }
(0 real changes made)
(61 real changes made)
(71 real changes made)
(44 real changes made)
(51 real changes made)
(43 real changes made)
(42 real changes made)
(24 real changes made)
(16 real changes made)
(13 real changes made)
(14 real changes made)

. 
. save "C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood\main
> _all_variables_wide.dta", replace
file C:\Users\pangu\OneDrive -
    Nexus365\thesis\survival\widowhood\main_all_variables_wide.dta
    saved

. 
. 
. 
. 
. clear 

. clear matrix

. clear mata 

. set maxvar 32767


. use "C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood\main_
> all_variables_wide.dta" , clear

. 
. * tabulate the variables for description 
. * demographic information
. 
. recode raedyrs (.m = 0), gen(eduyrs)
(3 differences between raedyrs and eduyrs)

. 
. recode s4edyrs (.m .v = 0), gen(s_eduyrs)
(111 differences between s4edyrs and s_eduyrs)

. 
. 
. g s_race = s_race_4
(108 missing values generated)

. gen s_white = 1 if s_race == 1
(1,774 missing values generated)

. replace s_white = 0 if s_race != 1
(1,774 real changes made)

. gen s_black = 1 if s_race == 2
(11,535 missing values generated)

. replace s_black = 0 if s_race != 2 
(11,535 real changes made)

. 
. gen protestant = 1 if religion == 1
(4,598 missing values generated)

. replace protestant= 0 if religion != 1
(4,598 real changes made)

. g catholic = 1 if religion == 2
(9,326 missing values generated)

. replace catholic = 0 if religion != 2
(9,326 real changes made)

. 
. gen s_religion = s_religion_4
(151 missing values generated)

. gen s_protestant = 1 if s_religion == 1
(4,674 missing values generated)

. replace s_protestant= 0 if s_religion != 1
(4,674 real changes made)

. g s_catholic = 1 if s_religion == 2
(9,332 missing values generated)

. replace s_catholic = 0 if s_religion != 2
(9,332 real changes made)

. 
. g s_migration = s_migration_4

. 
. * generate widowhood age and death age 
. 
. gen widow_age = year_widow - birthyear 
(9,319 missing values generated)

. 
. gen death_age = death_year - birthyear 
(6,722 missing values generated)

. 
. 
. * generate widow wave
. gen widow_dummy = widow_14 

. gen widow_wave = .
(12,812 missing values generated)

. forvalues i = 5(1)14{
  2.         local j = `i' - 1
  3.         replace widow_wave = `i' if widow_`i' == 1 & widow_`j' == 0
  4. }
(430 real changes made)
(427 real changes made)
(367 real changes made)
(388 real changes made)
(356 real changes made)
(374 real changes made)
(317 real changes made)
(319 real changes made)
(292 real changes made)
(223 real changes made)

. * the dummy for death exists 
. 
. * years between widowhood and death 
. gen year_diff = death_age - widow_age
(11,273 missing values generated)

. 
. * year of retirement 
. *check the first retirement status 
. 
. * we regard both partial retirement and complete retirement as retired.
>  
. 
. forvalues i =1(1)14{
  2.         recode r`i'sayret (1 2 = 1), gen(retire_`i')
  3. }
(503 differences between r1sayret and retire_1)
(650 differences between r2sayret and retire_2)
(1,011 differences between r3sayret and retire_3)
(1,295 differences between r4sayret and retire_4)
(1,215 differences between r5sayret and retire_5)
(1,135 differences between r6sayret and retire_6)
(1,221 differences between r7sayret and retire_7)
(1,110 differences between r8sayret and retire_8)
(1,050 differences between r9sayret and retire_9)
(1,011 differences between r10sayret and retire_10)
(911 differences between r11sayret and retire_11)
(750 differences between r12sayret and retire_12)
(516 differences between r13sayret and retire_13)
(361 differences between r14sayret and retire_14)

. 
. *ever retired
. gen ever_retired = 0

. forvalues i = 1(1)14{
  2.         replace ever_retired = 1 if retire_`i' == 1 & ever_retired!=
> 1
  3. }
(1,462 real changes made)
(799 real changes made)
(2,095 real changes made)
(2,518 real changes made)
(1,146 real changes made)
(768 real changes made)
(748 real changes made)
(557 real changes made)
(438 real changes made)
(449 real changes made)
(260 real changes made)
(183 real changes made)
(105 real changes made)
(51 real changes made)

. *check the retirement year (for the first retirement)
. gen retire_year = .
(12,812 missing values generated)

. forvalues i = 1(1)14{
  2.         replace retire_year = r`i'retyr if retire_`i'== 1 & r`i'rety
> r != .
  3. }
(1,462 real changes made, 8 to missing)
(1,229 real changes made, 19 to missing)
(2,337 real changes made, 32 to missing)
(2,929 real changes made, 72 to missing)
(1,764 real changes made, 72 to missing)
(1,492 real changes made, 53 to missing)
(1,400 real changes made, 72 to missing)
(1,243 real changes made, 60 to missing)
(1,010 real changes made, 55 to missing)
(1,106 real changes made, 89 to missing)
(837 real changes made, 74 to missing)
(693 real changes made, 77 to missing)
(557 real changes made, 74 to missing)
(350 real changes made, 35 to missing)

. 
. *generate year diff between retirement year
. 
. gen yrs_diff_retire = death_year - retire_year 
(7,470 missing values generated)

. * generate the year difference between current year and retirement year
> */
. 
. forvalues i = 4(1)14{
  2.         gen year_since_retire_`i' = int_year_wave_`i' - retire_year 
> if int_year_wave_`i'>= retire_year
  3.         replace year_since_retire_`i' = 0 if int_year_wave_`i'< reti
> re_year
  4. }
(5,941 missing values generated)
(5,941 real changes made)
(5,956 missing values generated)
(4,674 real changes made)
(5,943 missing values generated)
(3,846 real changes made)
(6,000 missing values generated)
(3,151 real changes made)
(6,031 missing values generated)
(2,472 real changes made)
(6,187 missing values generated)
(1,958 real changes made)
(6,498 missing values generated)
(1,430 real changes made)
(6,801 missing values generated)
(1,130 real changes made)
(7,321 missing values generated)
(808 real changes made)
(8,065 missing values generated)
(588 real changes made)
(8,963 missing values generated)
(443 real changes made)

. *labor force participation 
. forvalues i = 1(1)14{
  2.         gen labor_force_`i' = r`i'inlbrf
  3.         replace labor_force_`i'= 0 if labor_force_`i'==.
  4. }
(5,700 missing values generated)
(5,696 real changes made)
(3,960 missing values generated)
(3,349 real changes made)
(3,285 missing values generated)
(3,258 real changes made)
(49 missing values generated)
(0 real changes made)
(1,397 missing values generated)
(1,306 real changes made)
(2,252 missing values generated)
(2,144 real changes made)
(3,039 missing values generated)
(2,906 real changes made)
(3,791 missing values generated)
(3,634 real changes made)
(4,496 missing values generated)
(4,322 real changes made)
(5,407 missing values generated)
(5,179 real changes made)
(6,031 missing values generated)
(5,807 real changes made)
(6,881 missing values generated)
(6,670 real changes made)
(7,820 missing values generated)
(7,673 real changes made)
(8,933 missing values generated)
(8,745 real changes made)

. 
. 
. *ever retired
. forvalues i =1(1)14{
  2.         recode s`i'sayret (1 2 = 1), gen(s_retire_`i')
  3. }
(476 differences between s1sayret and s_retire_1)
(620 differences between s2sayret and s_retire_2)
(973 differences between s3sayret and s_retire_3)
(1,249 differences between s4sayret and s_retire_4)
(1,145 differences between s5sayret and s_retire_5)
(1,010 differences between s6sayret and s_retire_6)
(1,063 differences between s7sayret and s_retire_7)
(939 differences between s8sayret and s_retire_8)
(866 differences between s9sayret and s_retire_9)
(788 differences between s10sayret and s_retire_10)
(677 differences between s11sayret and s_retire_11)
(536 differences between s12sayret and s_retire_12)
(371 differences between s13sayret and s_retire_13)
(232 differences between s14sayret and s_retire_14)

. 
. 
. gen s_ever_retired = 0

. forvalues i = 1(1)14{
  2.         replace s_ever_retired = 1 if s_retire_`i' == 1 & s_ever_ret
> ired!=1
  3. }
(1,396 real changes made)
(757 real changes made)
(2,037 real changes made)
(2,418 real changes made)
(1,095 real changes made)
(678 real changes made)
(632 real changes made)
(481 real changes made)
(348 real changes made)
(360 real changes made)
(212 real changes made)
(136 real changes made)
(107 real changes made)
(55 real changes made)

. 
. *check the retirement year (for the first retirement)
. gen s_retire_year = .
(12,812 missing values generated)

. forvalues i = 1(1)14{
  2.         replace s_retire_year = s`i'retyr if s_retire_`i'== 1 & s_re
> tire_year==.
  3. }
(1,396 real changes made, 5 to missing)
(757 real changes made, 16 to missing)
(2,037 real changes made, 28 to missing)
(2,418 real changes made, 60 to missing)
(1,095 real changes made, 33 to missing)
(678 real changes made, 15 to missing)
(632 real changes made, 28 to missing)
(481 real changes made, 19 to missing)
(348 real changes made, 17 to missing)
(360 real changes made, 21 to missing)
(212 real changes made, 18 to missing)
(136 real changes made, 7 to missing)
(107 real changes made, 8 to missing)
(55 real changes made, 6 to missing)

. gen s_yrs_diff_retire = year_widow - s_retire_year 
(9,789 missing values generated)

. replace s_yrs_diff_retire = . if s_yrs_diff_retire<0
(0 real changes made)

. forvalues i = 4(1)14{
  2.         gen s_year_since_retire_`i' = int_year_wave_`i' - s_retire_y
> ear if int_year_wave_`i'>= s_retire_year
  3.         replace s_year_since_retire_`i' = 0 if int_year_wave_`i'< s_
> retire_year
  4. }
(5,161 missing values generated)
(5,161 real changes made)
(5,179 missing values generated)
(3,895 real changes made)
(5,206 missing values generated)
(3,104 real changes made)
(5,328 missing values generated)
(2,482 real changes made)
(5,543 missing values generated)
(1,982 real changes made)
(5,868 missing values generated)
(1,632 real changes made)
(6,346 missing values generated)
(1,277 real changes made)
(6,760 missing values generated)
(1,074 real changes made)
(7,419 missing values generated)
(893 real changes made)
(8,235 missing values generated)
(726 real changes made)
(9,152 missing values generated)
(595 real changes made)

. *labor force participation 
. forvalues i = 1(1)14{
  2.         gen s_labor_force_`i' = s`i'inlbrf
  3.         replace s_labor_force_`i'= 0 if s_labor_force_`i'==.
  4. }
(5,986 missing values generated)
(5,696 real changes made)
(4,304 missing values generated)
(3,349 real changes made)
(3,540 missing values generated)
(3,258 real changes made)
(464 missing values generated)
(0 real changes made)
(2,060 missing values generated)
(1,306 real changes made)
(3,242 missing values generated)
(2,144 real changes made)
(4,259 missing values generated)
(2,906 real changes made)
(5,261 missing values generated)
(3,634 real changes made)
(6,146 missing values generated)
(4,322 real changes made)
(7,141 missing values generated)
(5,179 real changes made)
(7,839 missing values generated)
(5,807 real changes made)
(8,704 missing values generated)
(6,670 real changes made)
(9,563 missing values generated)
(7,673 real changes made)
(10,407 missing values generated)
(8,745 real changes made)

. 
. 
. * health status 
. * drink days 
. egen mean_drink_days = rowmean(mean_drink_days_4 mean_drink_days_5 mean
> _drink_days_6 mean_drink_days_7 mean_drink_days_8 mean_drink_days_9 mea
> n_drink_days_10 mean_drink_days_11 mean_drink_days_12 mean_drink_days_1
> 3 mean_drink_days_14)

. 
. gen mean_drink_days_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_drink_days_before_death = mean_drink_days_`i' i
> f death_wave == `i'
  3. }
(387 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,575 real changes made)

. 
. egen s_mean_drink_days = rowmean(s_mean_drink_days_4 s_mean_drink_days_
> 5 s_mean_drink_days_6 s_mean_drink_days_7 s_mean_drink_days_8 s_mean_dr
> ink_days_9 s_mean_drink_days_10 s_mean_drink_days_11 s_mean_drink_days_
> 12 s_mean_drink_days_13 s_mean_drink_days_14)
(801 missing values generated)

. 
. gen s_mean_drink_days_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_drink_days_before_widow = s_mean_drink_days_`
> i' if widow_wave == `i'
  3. }
(0 real changes made)
(349 real changes made)
(318 real changes made)
(316 real changes made)
(331 real changes made)
(298 real changes made)
(337 real changes made)
(260 real changes made)
(273 real changes made)
(246 real changes made)
(189 real changes made)

. 
. egen mean_drink_num = rowmean(mean_drink_num_4 mean_drink_num_5 mean_dr
> ink_num_6 mean_drink_num_7 mean_drink_num_8 mean_drink_num_9 mean_drink
> _num_10 mean_drink_num_11 mean_drink_num_12 mean_drink_num_13 mean_drin
> k_num_14)
(2 missing values generated)

. 
. gen mean_drink_num_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_drink_num_before_death = mean_drink_num_`i' if 
> death_wave == `i'
  3. }
(387 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,574 real changes made)

. 
. egen s_mean_drink_num = rowmean(s_mean_drink_num_4 s_mean_drink_num_5 s
> _mean_drink_num_6 s_mean_drink_num_7 s_mean_drink_num_8 s_mean_drink_nu
> m_9 s_mean_drink_num_10 s_mean_drink_num_11 s_mean_drink_num_12 s_mean_
> drink_num_13 s_mean_drink_num_14)
(804 missing values generated)

. 
. gen s_mean_drink_num_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_drink_num_before_widow = s_mean_drink_num_`i'
>  if widow_wave == `i'
  3. }
(0 real changes made)
(349 real changes made)
(318 real changes made)
(316 real changes made)
(331 real changes made)
(298 real changes made)
(337 real changes made)
(260 real changes made)
(273 real changes made)
(246 real changes made)
(189 real changes made)

. 
. egen max_cond = rowmax(max_cond_4 max_cond_5 max_cond_6 max_cond_7 max_
> cond_8 max_cond_9 max_cond_10 max_cond_11 max_cond_12 max_cond_13 max_c
> ond_14)

. 
. gen max_cond_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_cond_before_death = max_cond_`i' if death_wave =
> = `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made)

. 
. egen s_max_cond = rowmax(s_max_cond_4 s_max_cond_5 s_max_cond_6 s_max_c
> ond_7 s_max_cond_8 s_max_cond_9 s_max_cond_10 s_max_cond_11 s_max_cond_
> 12 s_max_cond_13 s_max_cond_14)
(787 missing values generated)

. 
. gen s_max_cond_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_cond_before_widow = s_max_cond_`i' if widow_wa
> ve == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 5 to missing)
(337 real changes made)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen mean_health = rowmean(mean_health_4 mean_health_5 mean_health_6 me
> an_health_7 mean_health_8 mean_health_9 mean_health_10 mean_health_11 m
> ean_health_12 mean_health_13 mean_health_14)

. 
. gen mean_health_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_health_before_death = mean_health_`i' if death_
> wave == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(664 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made)

. 
. egen s_mean_health = rowmean(s_mean_health_4 s_mean_health_5 s_mean_hea
> lth_6 s_mean_health_7 s_mean_health_8 s_mean_health_9 s_mean_health_10 
> s_mean_health_11 s_mean_health_12 s_mean_health_13 s_mean_health_14)
(559 missing values generated)

. 
. gen s_mean_health_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_health_before_widow = s_mean_health_`i' if wi
> dow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made)
(318 real changes made)
(316 real changes made)
(332 real changes made)
(303 real changes made)
(337 real changes made)
(263 real changes made)
(280 real changes made)
(249 real changes made)
(197 real changes made)

. 
. egen mean_hosp_time = rowmean(mean_hosp_time_4 mean_hosp_time_5 mean_ho
> sp_time_6 mean_hosp_time_7 mean_hosp_time_8 mean_hosp_time_9 mean_hosp_
> time_10 mean_hosp_time_11 mean_hosp_time_12 mean_hosp_time_13 mean_hosp
> _time_14)
(3 missing values generated)

. 
. gen mean_hosp_time_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_hosp_time_before_death = mean_hosp_time_`i' if 
> death_wave == `i'
  3. }
(393 real changes made)
(546 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(560 real changes made)
(5,567 real changes made)

. 
. egen s_mean_hosp_time = rowmean(s_mean_hosp_time_4 s_mean_hosp_time_5 s
> _mean_hosp_time_6 s_mean_hosp_time_7 s_mean_hosp_time_8 s_mean_hosp_tim
> e_9 s_mean_hosp_time_10 s_mean_hosp_time_11 s_mean_hosp_time_12 s_mean_
> hosp_time_13 s_mean_hosp_time_14)
(791 missing values generated)

. 
. gen s_mean_hosp_time_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_hosp_time_before_widow = s_mean_hosp_time_`i'
>  if widow_wave == `i'
  3. }
(0 real changes made)
(349 real changes made)
(318 real changes made)
(316 real changes made)
(331 real changes made)
(298 real changes made)
(337 real changes made)
(260 real changes made)
(273 real changes made)
(246 real changes made)
(189 real changes made)

. 
. egen max_hosp_visit = rowmax(max_hosp_visit_4 max_hosp_visit_5 max_hosp
> _visit_6 max_hosp_visit_7 max_hosp_visit_8 max_hosp_visit_9 max_hosp_vi
> sit_10 max_hosp_visit_11 max_hosp_visit_12 max_hosp_visit_13 max_hosp_v
> isit_14)
(3 missing values generated)

. 
. gen max_hosp_visit_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_hosp_visit_before_death = max_hosp_visit_`i' if 
> death_wave == `i'
  3. }
(393 real changes made)
(546 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made, 1 to missing)
(5,575 real changes made, 6 to missing)

. 
. egen s_max_hosp_visit = rowmax(s_max_hosp_visit_4 s_max_hosp_visit_5 s_
> max_hosp_visit_6 s_max_hosp_visit_7 s_max_hosp_visit_8 s_max_hosp_visit
> _9 s_max_hosp_visit_10 s_max_hosp_visit_11 s_max_hosp_visit_12 s_max_ho
> sp_visit_13 s_max_hosp_visit_14)
(785 missing values generated)

. 
. gen s_max_hosp_visit_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_hosp_visit_before_widow = s_max_hosp_visit_`i'
>  if widow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 5 to missing)
(337 real changes made)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_nurs_home = rowmax(max_nurs_home_4 max_nurs_home_5 max_nurs_ho
> me_6 max_nurs_home_7 max_nurs_home_8 max_nurs_home_9 max_nurs_home_10 m
> ax_nurs_home_11 max_nurs_home_12 max_nurs_home_13 max_nurs_home_14)

. 
. gen max_nurs_home_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_nurs_home_before_death = max_nurs_home_`i' if de
> ath_wave == `i'
  3. }
(387 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made)

. 
. egen s_max_nurs_home = rowmax(s_max_nurs_home_4 s_max_nurs_home_5 s_max
> _nurs_home_6 s_max_nurs_home_7 s_max_nurs_home_8 s_max_nurs_home_9 s_ma
> x_nurs_home_10 s_max_nurs_home_11 s_max_nurs_home_12 s_max_nurs_home_13
>  s_max_nurs_home_14)
(799 missing values generated)

. 
. gen s_max_nurs_home_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_nurs_home_before_widow = s_max_nurs_home_`i' i
> f widow_wave == `i'
  3. }
(0 real changes made)
(349 real changes made)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 5 to missing)
(337 real changes made)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen mean_bmi = rowmean(mean_bmi_4 mean_bmi_5 mean_bmi_6 mean_bmi_7 mea
> n_bmi_8 mean_bmi_9 mean_bmi_10 mean_bmi_11 mean_bmi_12 mean_bmi_13 mean
> _bmi_14)
(14 missing values generated)

. 
. gen mean_bmi_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_bmi_before_death = mean_bmi_`i' if death_wave =
> = `i'
  3. }
(393 real changes made)
(544 real changes made)
(563 real changes made)
(616 real changes made)
(589 real changes made)
(626 real changes made)
(641 real changes made)
(515 real changes made)
(419 real changes made)
(421 real changes made)
(4,505 real changes made)

. 
. egen s_mean_bmi = rowmean(s_mean_bmi_4 s_mean_bmi_5 s_mean_bmi_6 s_mean
> _bmi_7 s_mean_bmi_8 s_mean_bmi_9 s_mean_bmi_10 s_mean_bmi_11 s_mean_bmi
> _12 s_mean_bmi_13 s_mean_bmi_14)
(816 missing values generated)

. 
. gen s_mean_bmi_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_bmi_before_widow = s_mean_bmi_`i' if widow_wa
> ve == `i'
  3. }
(0 real changes made)
(349 real changes made)
(317 real changes made)
(315 real changes made)
(330 real changes made)
(296 real changes made)
(334 real changes made)
(200 real changes made)
(192 real changes made)
(182 real changes made)
(155 real changes made)

. 
. egen mean_cesd = rowmean(mean_cesd_4 mean_cesd_5 mean_cesd_6 mean_cesd_
> 7 mean_cesd_8 mean_cesd_9 mean_cesd_10 mean_cesd_11 mean_cesd_12 mean_c
> esd_13 mean_cesd_14)
(350 missing values generated)

. 
. gen mean_cesd_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_cesd_before_death = mean_cesd_`i' if death_wave
>  == `i'
  3. }
(352 real changes made)
(500 real changes made)
(506 real changes made)
(561 real changes made)
(538 real changes made)
(592 real changes made)
(619 real changes made)
(617 real changes made)
(551 real changes made)
(514 real changes made)
(5,373 real changes made)

. 
. egen s_mean_cesd = rowmean(s_mean_cesd_4 s_mean_cesd_5 s_mean_cesd_6 s_
> mean_cesd_7 s_mean_cesd_8 s_mean_cesd_9 s_mean_cesd_10 s_mean_cesd_11 s
> _mean_cesd_12 s_mean_cesd_13 s_mean_cesd_14)
(1,145 missing values generated)

. 
. gen s_mean_cesd_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_cesd_before_widow = s_mean_cesd_`i' if widow_
> wave == `i'
  3. }
(0 real changes made)
(316 real changes made)
(283 real changes made)
(270 real changes made)
(303 real changes made)
(275 real changes made)
(314 real changes made)
(241 real changes made)
(250 real changes made)
(222 real changes made)
(179 real changes made)

. 
. egen mean_expend = rowmean(mean_expend_4 mean_expend_5 mean_expend_6 me
> an_expend_7 mean_expend_8 mean_expend_9 mean_expend_10 mean_expend_11 m
> ean_expend_12 mean_expend_13 mean_expend_14)

. 
. gen mean_expend_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_expend_before_death = mean_expend_`i' if death_
> wave == `i'
  3. }
(387 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made)

. 
. egen s_mean_expend = rowmean(s_mean_expend_4 s_mean_expend_5 s_mean_exp
> end_6 s_mean_expend_7 s_mean_expend_8 s_mean_expend_9 s_mean_expend_10 
> s_mean_expend_11 s_mean_expend_12 s_mean_expend_13 s_mean_expend_14)
(799 missing values generated)

. 
. gen s_mean_expend_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_expend_before_widow = s_mean_expend_`i' if wi
> dow_wave == `i'
  3. }
(0 real changes made)
(349 real changes made)
(318 real changes made)
(316 real changes made)
(331 real changes made)
(298 real changes made)
(337 real changes made)
(260 real changes made)
(273 real changes made)
(246 real changes made)
(189 real changes made)

. 
. egen max_high_bp = rowmax(max_high_bp_4 max_high_bp_5 max_high_bp_6 max
> _high_bp_7 max_high_bp_8 max_high_bp_9 max_high_bp_10 max_high_bp_11 ma
> x_high_bp_12 max_high_bp_13 max_high_bp_14)

. 
. gen max_high_bp_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_high_bp_before_death = max_high_bp_`i' if death_
> wave == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(662 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,579 real changes made, 7 to missing)

. 
. egen s_max_high_bp = rowmax(s_max_high_bp_4 s_max_high_bp_5 s_max_high_
> bp_6 s_max_high_bp_7 s_max_high_bp_8 s_max_high_bp_9 s_max_high_bp_10 s
> _max_high_bp_11 s_max_high_bp_12 s_max_high_bp_13 s_max_high_bp_14)
(787 missing values generated)

. 
. gen s_max_high_bp_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_high_bp_before_widow = s_max_high_bp_`i' if wi
> dow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made, 1 to missing)
(332 real changes made, 1 to missing)
(303 real changes made, 5 to missing)
(337 real changes made)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_diabetes = rowmax(max_diabetes_4 max_diabetes_5 max_diabetes_6
>  max_diabetes_7 max_diabetes_8 max_diabetes_9 max_diabetes_10 max_diabe
> tes_11 max_diabetes_12 max_diabetes_13 max_diabetes_14)

. 
. gen max_diabetes_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_diabetes_before_death = max_diabetes_`i' if deat
> h_wave == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made, 1 to missing)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made, 1 to missing)
(5,579 real changes made, 5 to missing)

. 
. egen s_max_diabetes = rowmax(s_max_diabetes_4 s_max_diabetes_5 s_max_di
> abetes_6 s_max_diabetes_7 s_max_diabetes_8 s_max_diabetes_9 s_max_diabe
> tes_10 s_max_diabetes_11 s_max_diabetes_12 s_max_diabetes_13 s_max_diab
> etes_14)
(789 missing values generated)

. 
. gen s_max_diabetes_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_diabetes_before_widow = s_max_diabetes_`i' if 
> widow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 6 to missing)
(337 real changes made)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_cancer = rowmax(max_cancer_4 max_cancer_5 max_cancer_6 max_can
> cer_7 max_cancer_8 max_cancer_9 max_cancer_10 max_cancer_11 max_cancer_
> 12 max_cancer_13 max_cancer_14)
(1 missing value generated)

. 
. gen max_cancer_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_cancer_before_death = max_cancer_`i' if death_wa
> ve == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made, 3 to missing)
(617 real changes made)
(593 real changes made)
(637 real changes made)
(663 real changes made, 2 to missing)
(665 real changes made)
(596 real changes made, 1 to missing)
(561 real changes made, 2 to missing)
(5,580 real changes made, 11 to missing)

. 
. egen s_max_cancer = rowmax(s_max_cancer_4 s_max_cancer_5 s_max_cancer_6
>  s_max_cancer_7 s_max_cancer_8 s_max_cancer_9 s_max_cancer_10 s_max_can
> cer_11 s_max_cancer_12 s_max_cancer_13 s_max_cancer_14)
(789 missing values generated)

. 
. gen s_max_cancer_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_cancer_before_widow = s_max_cancer_`i' if wido
> w_wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made, 3 to missing)
(332 real changes made, 1 to missing)
(303 real changes made, 6 to missing)
(337 real changes made, 1 to missing)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 4 to missing)
(197 real changes made, 9 to missing)

. 
. egen max_lung = rowmax(max_lung_4 max_lung_5 max_lung_6 max_lung_7 max_
> lung_8 max_lung_9 max_lung_10 max_lung_11 max_lung_12 max_lung_13 max_l
> ung_14)
(1 missing value generated)

. 
. gen max_lung_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_lung_before_death = max_lung_`i' if death_wave =
> = `i'
  3. }
(393 real changes made)
(547 real changes made, 1 to missing)
(564 real changes made)
(617 real changes made)
(593 real changes made, 1 to missing)
(637 real changes made, 2 to missing)
(663 real changes made, 1 to missing)
(665 real changes made)
(596 real changes made)
(561 real changes made, 1 to missing)
(5,580 real changes made, 5 to missing)

. 
. egen s_max_lung = rowmax(s_max_lung_4 s_max_lung_5 s_max_lung_6 s_max_l
> ung_7 s_max_lung_8 s_max_lung_9 s_max_lung_10 s_max_lung_11 s_max_lung_
> 12 s_max_lung_13 s_max_lung_14)
(789 missing values generated)

. 
. gen s_max_lung_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_lung_before_widow = s_max_lung_`i' if widow_wa
> ve == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 6 to missing)
(337 real changes made, 1 to missing)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_heart = rowmax(max_heart_4 max_heart_5 max_heart_6 max_heart_7
>  max_heart_8 max_heart_9 max_heart_10 max_heart_11 max_heart_12 max_hea
> rt_13 max_heart_14)
(1 missing value generated)

. 
. gen max_heart_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_heart_before_death = max_heart_`i' if death_wave
>  == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made, 2 to missing)
(663 real changes made, 1 to missing)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made, 5 to missing)

. 
. egen s_max_heart = rowmax(s_max_heart_4 s_max_heart_5 s_max_heart_6 s_m
> ax_heart_7 s_max_heart_8 s_max_heart_9 s_max_heart_10 s_max_heart_11 s_
> max_heart_12 s_max_heart_13 s_max_heart_14)
(790 missing values generated)

. 
. gen s_max_heart_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_heart_before_widow = s_max_heart_`i' if widow_
> wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 6 to missing)
(337 real changes made, 1 to missing)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 3 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_stroke = rowmax(max_stroke_4 max_stroke_5 max_stroke_6 max_str
> oke_7 max_stroke_8 max_stroke_9 max_stroke_10 max_stroke_11 max_stroke_
> 12 max_stroke_13 max_stroke_14)
(1 missing value generated)

. 
. gen max_stroke_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_stroke_before_death = max_stroke_`i' if death_wa
> ve == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made, 2 to missing)
(663 real changes made)
(665 real changes made, 1 to missing)
(596 real changes made, 1 to missing)
(561 real changes made)
(5,580 real changes made, 3 to missing)

. 
. egen s_max_stroke = rowmax(s_max_stroke_4 s_max_stroke_5 s_max_stroke_6
>  s_max_stroke_7 s_max_stroke_8 s_max_stroke_9 s_max_stroke_10 s_max_str
> oke_11 s_max_stroke_12 s_max_stroke_13 s_max_stroke_14)
(790 missing values generated)

. 
. gen s_max_stroke_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_stroke_before_widow = s_max_stroke_`i' if wido
> w_wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 6 to missing)
(337 real changes made, 1 to missing)
(263 real changes made, 4 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 4 to missing)
(197 real changes made, 8 to missing)

. 
. 
. * calculate total number of symptoms 
. gen num_symptoms = max_high_bp + max_diabetes + max_cancer + max_lung +
>  max_heart + max_stroke 
(3 missing values generated)

. gen s_num_symptoms = s_max_high_bp + s_max_diabetes + s_max_cancer + s_
> max_lung + s_max_heart + s_max_stroke 
(791 missing values generated)

. 
. gen num_symptoms_before_death = max_high_bp_before_death + max_diabetes
> _before_death + max_cancer_before_death + max_lung_before_death + max_h
> eart_before_death + max_stroke_before_death
(1,448 missing values generated)

.  
. gen s_num_symptoms_before_widow = s_max_high_bp_before_widow + s_max_di
> abetes_before_widow + s_max_cancer_before_widow + s_max_lung_before_wid
> ow + s_max_heart_before_widow + s_max_stroke_before_widow
(9,906 missing values generated)

. 
. egen max_psych = rowmax(max_psych_4 max_psych_5 max_psych_6 max_psych_7
>  max_psych_8 max_psych_9 max_psych_10 max_psych_11 max_psych_12 max_psy
> ch_13 max_psych_14)

. 
. gen max_psych_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_psych_before_death = max_psych_`i' if death_wave
>  == `i'
  3. }
(393 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(593 real changes made)
(637 real changes made, 2 to missing)
(663 real changes made)
(665 real changes made)
(596 real changes made)
(561 real changes made)
(5,580 real changes made, 6 to missing)

. 
. egen s_max_psych = rowmax(s_max_psych_4 s_max_psych_5 s_max_psych_6 s_m
> ax_psych_7 s_max_psych_8 s_max_psych_9 s_max_psych_10 s_max_psych_11 s_
> max_psych_12 s_max_psych_13 s_max_psych_14)
(789 missing values generated)

. 
. gen s_max_psych_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_psych_before_widow = s_max_psych_`i' if widow_
> wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 2 to missing)
(318 real changes made)
(316 real changes made)
(332 real changes made, 1 to missing)
(303 real changes made, 5 to missing)
(337 real changes made, 1 to missing)
(263 real changes made, 3 to missing)
(280 real changes made, 7 to missing)
(249 real changes made, 5 to missing)
(197 real changes made, 8 to missing)

. 
. egen max_smoke = rowmax(max_smoke_4 max_smoke_5 max_smoke_6 max_smoke_7
>  max_smoke_8 max_smoke_9 max_smoke_10 max_smoke_11 max_smoke_12 max_smo
> ke_13 max_smoke_14)
(136 missing values generated)

. 
. gen max_smoke_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_smoke_before_death = max_smoke_`i' if death_wave
>  == `i'
  3. }
(389 real changes made)
(543 real changes made)
(563 real changes made, 8 to missing)
(617 real changes made, 6 to missing)
(593 real changes made, 8 to missing)
(637 real changes made, 6 to missing)
(663 real changes made, 8 to missing)
(664 real changes made, 5 to missing)
(595 real changes made, 6 to missing)
(560 real changes made, 7 to missing)
(5,578 real changes made, 47 to missing)

. 
. egen s_max_smoke = rowmax(s_max_smoke_4 s_max_smoke_5 s_max_smoke_6 s_m
> ax_smoke_7 s_max_smoke_8 s_max_smoke_9 s_max_smoke_10 s_max_smoke_11 s_
> max_smoke_12 s_max_smoke_13 s_max_smoke_14)
(933 missing values generated)

. 
. gen s_max_smoke_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_smoke_before_widow = s_max_smoke_`i' if widow_
> wave == `i'
  3. }
(0 real changes made)
(351 real changes made, 4 to missing)
(318 real changes made, 5 to missing)
(316 real changes made, 6 to missing)
(332 real changes made, 6 to missing)
(303 real changes made, 10 to missing)
(337 real changes made, 4 to missing)
(263 real changes made, 8 to missing)
(280 real changes made, 9 to missing)
(249 real changes made, 5 to missing)
(197 real changes made, 14 to missing)

. 
. egen mean_proxy_memory = rowmean(min_proxy_memory_4 min_proxy_memory_5 
> min_proxy_memory_6 min_proxy_memory_7 min_proxy_memory_8 min_proxy_memo
> ry_9 min_proxy_memory_10 min_proxy_memory_11 min_proxy_memory_12 min_pr
> oxy_memory_13 min_proxy_memory_14)
(9,519 missing values generated)

. 
. gen min_proxy_memory_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace min_proxy_memory_before_death = min_proxy_memory_`i'
>  if death_wave == `i'
  3. }
(61 real changes made)
(121 real changes made)
(155 real changes made)
(150 real changes made)
(155 real changes made)
(147 real changes made)
(137 real changes made)
(163 real changes made)
(145 real changes made)
(120 real changes made)
(489 real changes made)

. 
. egen s_mean_proxy_memory = rowmean(s_min_proxy_memory_4 s_min_proxy_mem
> ory_5 s_min_proxy_memory_6 s_min_proxy_memory_7 s_min_proxy_memory_8 s_
> min_proxy_memory_9 s_min_proxy_memory_10 s_min_proxy_memory_11 s_min_pr
> oxy_memory_12 s_min_proxy_memory_13 s_min_proxy_memory_14)
(10,210 missing values generated)

. 
. gen s_min_proxy_memory_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_min_proxy_memory_before_widow = s_min_proxy_memory
> _`i' if widow_wave == `i'
  3. }
(0 real changes made)
(94 real changes made)
(106 real changes made)
(119 real changes made)
(96 real changes made)
(92 real changes made)
(87 real changes made)
(76 real changes made)
(71 real changes made)
(66 real changes made)
(40 real changes made)

. 
. * SES
. egen min_income_rank = rowmin(min_income_rank_4 min_income_rank_5 min_i
> ncome_rank_6 min_income_rank_7 min_income_rank_8 min_income_rank_9 min_
> income_rank_10 min_income_rank_11 min_income_rank_12 min_income_rank_13
>  min_income_rank_14)

. 
. gen min_income_rank_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace min_income_rank_before_death = min_income_rank_`i' i
> f death_wave == `i'
  3. }
(447 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(599 real changes made)
(647 real changes made)
(671 real changes made)
(669 real changes made)
(598 real changes made)
(564 real changes made)
(6,889 real changes made)

. 
. egen s_min_income_rank = rowmin(s_min_income_rank_4 s_min_income_rank_5
>  s_min_income_rank_6 s_min_income_rank_7 s_min_income_rank_8 s_min_inco
> me_rank_9 s_min_income_rank_10 s_min_income_rank_11 s_min_income_rank_1
> 2 s_min_income_rank_13 s_min_income_rank_14)
(2 missing values generated)

. 
. gen s_min_income_rank_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_min_income_rank_before_widow = s_min_income_rank_`
> i' if widow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made)
(318 real changes made)
(316 real changes made)
(335 real changes made)
(313 real changes made)
(344 real changes made)
(274 real changes made)
(287 real changes made)
(251 real changes made)
(198 real changes made)

. 
. egen min_asset_rank = rowmin(min_asset_rank_4 min_asset_rank_5 min_asse
> t_rank_6 min_asset_rank_7 min_asset_rank_8 min_asset_rank_9 min_asset_r
> ank_10 min_asset_rank_11 min_asset_rank_12 min_asset_rank_13 min_asset_
> rank_14)

. 
. gen min_asset_rank_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace min_asset_rank_before_death = min_asset_rank_`i' if 
> death_wave == `i'
  3. }
(447 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(599 real changes made)
(647 real changes made)
(671 real changes made)
(669 real changes made)
(598 real changes made)
(564 real changes made)
(6,889 real changes made)

. 
. egen mean_log_asset = rowmean(mean_log_asset_4 mean_log_asset_5 mean_lo
> g_asset_6 mean_log_asset_7 mean_log_asset_8 mean_log_asset_9 mean_log_a
> sset_10 mean_log_asset_11 mean_log_asset_12 mean_log_asset_13 mean_log_
> asset_14)

. 
. gen mean_log_asset_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_log_asset_before_death = mean_log_asset_`i' if 
> death_wave == `i'
  3. }
(446 real changes made)
(546 real changes made)
(564 real changes made)
(615 real changes made)
(599 real changes made)
(646 real changes made)
(668 real changes made)
(666 real changes made)
(594 real changes made)
(560 real changes made)
(6,873 real changes made)

. 
. egen mean_log_family_inc = rowmean(mean_log_fam_income_4 mean_log_fam_i
> ncome_5 mean_log_fam_income_6 mean_log_fam_income_7 mean_log_fam_income
> _8 mean_log_fam_income_9 mean_log_fam_income_10 mean_log_fam_income_11 
> mean_log_fam_income_12 mean_log_fam_income_13 mean_log_fam_income_14)

. 
. gen mean_log_family_inc_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_log_family_inc_before_death = mean_log_fam_inco
> me_`i' if death_wave == `i'
  3. }
(447 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(599 real changes made)
(647 real changes made)
(671 real changes made)
(669 real changes made)
(598 real changes made)
(564 real changes made)
(6,889 real changes made)

. 
. 
. egen mean_log_income = rowmean(mean_log_income_4 mean_log_income_5 mean
> _log_income_6 mean_log_income_7 mean_log_income_8 mean_log_income_9 mea
> n_log_income_10 mean_log_income_11 mean_log_income_12 mean_log_income_1
> 3 mean_log_income_14)

. 
. gen mean_log_income_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace mean_log_income_before_death = mean_log_income_`i' i
> f death_wave == `i'
  3. }
(447 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(599 real changes made)
(647 real changes made)
(671 real changes made)
(669 real changes made)
(598 real changes made)
(564 real changes made)
(6,889 real changes made)

. 
. egen s_mean_log_income = rowmean(s_mean_log_income_4 s_mean_log_income_
> 5 s_mean_log_income_6 s_mean_log_income_7 s_mean_log_income_8 s_mean_lo
> g_income_9 s_mean_log_income_10 s_mean_log_income_11 s_mean_log_income_
> 12 s_mean_log_income_13 s_mean_log_income_14)
(2 missing values generated)

. 
. gen s_mean_log_income_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_mean_log_income_before_widow = s_mean_log_income_`
> i' if widow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made)
(318 real changes made)
(316 real changes made)
(335 real changes made)
(313 real changes made)
(344 real changes made)
(274 real changes made)
(287 real changes made)
(251 real changes made)
(198 real changes made)

. 
. egen max_pension = rowmax(max_pension_4 max_pension_5 max_pension_6 max
> _pension_7 max_pension_8 max_pension_9 max_pension_10 max_pension_11 ma
> x_pension_12 max_pension_13 max_pension_14)

. 
. gen max_pension_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace max_pension_before_death = max_pension_`i' if death_
> wave == `i'
  3. }
(447 real changes made)
(547 real changes made)
(564 real changes made)
(617 real changes made)
(599 real changes made)
(647 real changes made)
(671 real changes made)
(669 real changes made)
(598 real changes made)
(564 real changes made)
(6,889 real changes made)

. 
. egen s_max_pension = rowmax(s_max_pension_4 s_max_pension_5 s_max_pensi
> on_6 s_max_pension_7 s_max_pension_8 s_max_pension_9 s_max_pension_10 s
> _max_pension_11 s_max_pension_12 s_max_pension_13 s_max_pension_14)
(2 missing values generated)

. 
. gen s_max_pension_before_widow = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_max_pension_before_widow = s_max_pension_`i' if wi
> dow_wave == `i'
  3. }
(0 real changes made)
(351 real changes made)
(318 real changes made)
(316 real changes made)
(335 real changes made)
(313 real changes made)
(344 real changes made)
(274 real changes made)
(287 real changes made)
(251 real changes made)
(198 real changes made)

. 
. egen mean_labor_force = rowmean(labor_force_4 labor_force_5 labor_force
> _6 labor_force_7 labor_force_8 labor_force_9 labor_force_10 labor_force
> _11 labor_force_12 labor_force_13 labor_force_14)

. 
. gen labor_force_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace labor_force_before_death = labor_force_`i' if death_
> wave == `i'
  3. }
(447 real changes made, 13 to missing)
(547 real changes made, 37 to missing)
(564 real changes made, 38 to missing)
(617 real changes made, 49 to missing)
(599 real changes made, 48 to missing)
(647 real changes made, 56 to missing)
(671 real changes made, 57 to missing)
(669 real changes made, 71 to missing)
(598 real changes made, 83 to missing)
(564 real changes made, 41 to missing)
(6,889 real changes made, 188 to missing)

. 
. egen s_mean_labor_force = rowmean(s_labor_force_4 s_labor_force_5 s_lab
> or_force_6 s_labor_force_7 s_labor_force_8 s_labor_force_9 s_labor_forc
> e_10 s_labor_force_11 s_labor_force_12 s_labor_force_13 s_labor_force_1
> 4)
(10 missing values generated)

. 
. gen s_labor_force_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_labor_force_before_death = s_labor_force_`i' if wi
> dow_wave == `i'
  3. }
(0 real changes made)
(430 real changes made, 430 to missing)
(427 real changes made, 427 to missing)
(367 real changes made, 367 to missing)
(388 real changes made, 388 to missing)
(356 real changes made, 356 to missing)
(374 real changes made, 374 to missing)
(317 real changes made, 317 to missing)
(319 real changes made, 319 to missing)
(292 real changes made, 292 to missing)
(223 real changes made, 223 to missing)

. **** information on children 
. gen child_dead_year = .
(12,812 missing values generated)

. 
. forvalues i = 1(1)12{
  2.         replace child_dead_year = `i'*2 + 1990 if child_dead_wave ==
>  `i'
  3. }
(0 real changes made)
(36 real changes made)
(101 real changes made)
(162 real changes made)
(125 real changes made)
(192 real changes made)
(162 real changes made)
(141 real changes made)
(154 real changes made)
(152 real changes made)
(139 real changes made)
(120 real changes made)

. * calculate the year between child death and mortaility, child death an
> d widowhood 
. 
. gen yrs_diff_child_dead = death_year - child_dead_year
(12,112 missing values generated)

. gen s_yrs_diff_child_dead = year_widow - child_dead_year
(12,231 missing values generated)

. 
. *years since lossing children 
. forvalues i = 4(1)14{
  2.         gen year_since_child_dead_`i' = int_year_wave_`i' - child_de
> ad_year if int_year_wave_`i'>= retire_year
  3.         replace year_since_child_dead_`i' = 0 if int_year_wave_`i'< 
> child_dead_year
  4. }
(11,940 missing values generated)
(12,513 real changes made)
(11,910 missing values generated)
(11,120 real changes made)
(11,888 missing values generated)
(10,137 real changes made)
(11,870 missing values generated)
(9,270 real changes made)
(11,875 missing values generated)
(8,477 real changes made)
(11,866 missing values generated)
(7,709 real changes made)
(11,901 missing values generated)
(6,809 real changes made)
(11,947 missing values generated)
(6,131 real changes made)
(12,024 missing values generated)
(5,272 real changes made)
(12,180 missing values generated)
(4,462 real changes made)
(12,300 missing values generated)
(3,528 real changes made)

. 
. 
. * average number of living children 
. 
. egen child_liv = rowmean(child_liv_4 child_liv_5 child_liv_6 child_liv_
> 7 child_liv_8 child_liv_9 child_liv_10 child_liv_11 child_liv_12 child_
> liv_13 child_liv_14)

. 
. gen child_liv_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace child_liv_before_death = child_liv_`i' if death_wave
>  == `i'
  3. }
(447 real changes made, 3 to missing)
(547 real changes made, 2 to missing)
(564 real changes made, 7 to missing)
(617 real changes made, 10 to missing)
(599 real changes made, 8 to missing)
(647 real changes made, 7 to missing)
(671 real changes made, 4 to missing)
(669 real changes made, 5 to missing)
(598 real changes made, 9 to missing)
(564 real changes made, 6 to missing)
(6,889 real changes made, 115 to missing)

. 
. gen s_child_liv_before_death = .
(12,812 missing values generated)

. forvalues i = 4(1)14{
  2.         replace s_child_liv_before_death = child_liv_`i' if widow_wa
> ve == `i'
  3. }
(0 real changes made)
(430 real changes made, 5 to missing)
(427 real changes made, 6 to missing)
(367 real changes made, 11 to missing)
(388 real changes made, 6 to missing)
(356 real changes made, 8 to missing)
(374 real changes made, 3 to missing)
(317 real changes made, 5 to missing)
(319 real changes made, 9 to missing)
(292 real changes made, 7 to missing)
(223 real changes made, 8 to missing)

. 
. * weight 
. forvalues i = 1(1)13{
  2.         rename r`i'wtresp wt_`i'
  3. }

. g wt_14 = wt_13
(7,673 missing values generated)

. 
. gen group = 1 if male==1 & widow_dummy == 1
(11,816 missing values generated)

. replace group = 2 if male == 1 & widow_dummy == 0
(5,671 real changes made)

. replace group = 3 if male == 0 & widow_dummy== 1
(2,497 real changes made)

. replace group = 4 if male == 0 & widow_dummy == 0
(3,648 real changes made)

. 
. recode racial_homo (2 3 4 . = 0)
(1,970 changes made to racial_homo)

. 
. sort group

. by group: sum eduyrs s_eduyrs white black s_white s_black migration s_m
> igration protestant catholic s_protestant s_catholic death death_age wi
> dow_age year_diff ever_retired yrs_diff_retire s_ever_retired s_yrs_dif
> f_retire child_dead yrs_diff_child_dead s_yrs_diff_child_dead child_liv
>  child_liv_before_death s_child_liv_before_death mean_drink_days mean_d
> rink_days_before_death s_mean_drink_days s_mean_drink_days_before_widow
>  mean_drink_num mean_drink_num_before_death s_mean_drink_num s_mean_dri
> nk_num_before_widow max_hosp_visit max_hosp_visit_before_death s_max_ho
> sp_visit s_max_hosp_visit_before_widow mean_hosp_time mean_hosp_time_be
> fore_death s_mean_hosp_time s_mean_hosp_time_before_widow max_nurs_home
>  max_nurs_home_before_death s_max_nurs_home s_max_nurs_home_before_wido
> w mean_bmi mean_bmi_before_death s_mean_bmi s_mean_bmi_before_widow mea
> n_cesd mean_cesd_before_death s_mean_cesd s_mean_cesd_before_widow mean
> _expend mean_expend_before_death s_mean_expend s_mean_expend_before_wid
> ow num_symptoms num_symptoms_before_death s_num_symptoms s_num_symptoms
> _before_widow max_psych max_psych_before_death s_max_psych s_max_psych_
> before_widow mean_proxy_memory min_proxy_memory_before_death s_mean_pro
> xy_memory s_min_proxy_memory_before_widow mean_log_asset mean_log_asset
> _before_death mean_log_family_inc mean_log_family_inc_before_death mean
> _log_income mean_log_income_before_death s_mean_log_income s_mean_log_i
> ncome_before_widow max_pension max_pension_before_death s_max_pension s
> _max_pension_before_widow mean_labor_force labor_force_before_death s_m
> ean_labor_force s_labor_force_before_death num_shared_child age_diff ed
> uc_homo racial_homo reli_homo geo_homo inc_homo 

-------------------------------------------------------------------------
-> group = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      eduyrs |        996    11.77209    3.537774          0         17
    s_eduyrs |        996    11.70683    3.109783          0         17
       white |        996    .8604418    .3467022          0          1
       black |        996    .1144578    .3185265          0          1
     s_white |        996    .8534137    .3538708          0          1
-------------+---------------------------------------------------------
     s_black |        996    .1134538    .3173061          0          1
   migration |        996    .0823293    .2750039          0          1
 s_migration |        996    .0783133    .2687989          0          1
  protestant |        996    .6355422    .4815196          0          1
    catholic |        996    .2670683    .4426506          0          1
-------------+---------------------------------------------------------
s_protestant |        996    .6666667    .4716413          0          1
  s_catholic |        996    .2630522    .4405117          0          1
       death |        996    .5371486    .4988686          0          1
   death_age |        535    86.00748    7.713257         54        103
   widow_age |        996    79.85141    8.092183         54        102
-------------+---------------------------------------------------------
   year_diff |        535    4.811215    3.701891          0         18
ever_retired |        996    .9909639    .0946757          0          1
yrs_diff_r~e |        521    21.41267    10.19901          1         71
s_ever_ret~d |        996    .8253012       .3799          0          1
s_yrs_diff~e |        774    20.41731    11.42444          2         66
-------------+---------------------------------------------------------
  child_dead |        953    .1668416    .3730301          0          1
yrs_diff_c~d |         75        5.72    4.098648          0         21
s_yrs_diff~d |        159    3.798742        6.74        -12         24
   child_liv |        996    2.443118    1.800685          0       10.2
child_liv_~h |        978    1.977505    2.191335          0         11
-------------+---------------------------------------------------------
s_child_li~h |        978    3.288344    2.079949          0         11
mean_drink~s |        996    1.321431    1.926729          0          7
mean_drink.. |        956    1.250174    2.079058          0          7
s_mean_dri~s |        928    .7658004    1.623757          0          7
s_mean_dri.. |        822    .6839011    1.623249          0          7
-------------+---------------------------------------------------------
mean_drink~m |        996     .724999     1.04914          0   9.433333
mean_drink.. |        956    .6586471    1.191078          0       16.5
s_mean_dri~m |        928    .3462404    .6798587          0   5.714286
s_mean_dri.. |        822    .2716951    .6270068          0   6.333333
max_hosp_v~t |        996    .8594378     .347744          0          1
-------------+---------------------------------------------------------
max_hosp_v~h |        956    .6495816    .4773507          0          1
s_max_hosp~t |        930    .8268817    .3785531          0          1
s_max_hosp~w |        822    .7518248     .432217          0          1
mean_hosp_~e |        996    .5286127    .6031572          0        5.3
mean_hosp_~h |        956    .7088564    1.054792          0         15
-------------+---------------------------------------------------------
s_mean_hos~e |        929    .6824894    .8940942          0        6.8
s_mean_hos~w |        822     1.06914     1.66794          0   21.66667
max_nurs_h~e |        996    .1546185    .3617222          0          1
max_nurs_h~h |        957    .1034483    .3047027          0          1
s_max_nurs~e |        929    .1001076    .3003051          0          1
-------------+---------------------------------------------------------
s_max_nurs~w |        822    .1021898    .3030821          0          1
    mean_bmi |        996    27.50136    4.329255   17.59762   45.11481
mean_bmi_b~h |        812    27.87619    4.975121       15.7       48.6
  s_mean_bmi |        927    27.17216    6.060873       14.8   56.32666
s_mean_bmi~w |        731     27.0741    6.524179       13.5       64.1
-------------+---------------------------------------------------------
   mean_cesd |        977    1.413358    1.349811          0   7.333333
mean_cesd_~h |        896    1.721726     1.71679          0          8
 s_mean_cesd |        913    1.681195    1.609892          0          8
s_mean_ces~w |        771    1.894942    1.838184          0          8
 mean_expend |        996     3520.66    5971.869          0   101369.3
-------------+---------------------------------------------------------
mean_expen~h |        957    4622.331    12296.76          0     274800
s_mean_exp~d |        929    4084.466     5390.27          0   53621.11
s_mean_exp~w |        822    5834.523    9577.067          0     109584
num_symptoms |        996    2.222892    1.235374          0          6
num_sympto~h |        954    2.145702    1.227846          0          6
-------------+---------------------------------------------------------
s_num_symp~s |        929     2.17761    1.281371          0          6
s_num_symp~w |        820    2.219512    1.267846          0          6
   max_psych |        996    .1646586    .3710585          0          1
max_psych_~h |        957    .1494253    .3566936          0          1
 s_max_psych |        929    .2508073    .4337113          0          1
-------------+---------------------------------------------------------
s_max_psyc~w |        821    .2606577    .4392611          0          1
mean_proxy~y |        329    3.179591      1.1961          1          5
min_proxy_~h |        172    3.546512    1.303679          1          5
s_mean_pro~y |        230    3.536608    1.349798          1          5
s_min_prox~w |        191    3.795812    1.303914          1          5
-------------+---------------------------------------------------------
mean_log_a~t |        996    10.20093    2.152211    4.60517   15.52453
mean_log_a~h |        995    10.94299    2.660234    4.60517   16.12561
mean_log_f~c |        996    8.691377     1.81608   3.582826   12.89113
mean_log_f~h |        996    9.489588    2.093658   2.302585   13.18814
mean_log_i~e |        996    8.155275    1.731711    2.97219   11.57161
-------------+---------------------------------------------------------
mean_log_i~h |        996    9.109058    1.990659   2.302585   12.07998
s_mean_log~e |        996    5.955405    2.224454   2.302585   11.70139
s_mean_log~w |        844    8.420779    1.727201   2.302585   11.38266
 max_pension |        996    .6395582    .4803698          0          1
max_pensio~h |        996    .5401606    .4986349          0          1
-------------+---------------------------------------------------------
s_max_pens~n |        996    .2329317    .4229115          0          1
s_max_pens~w |        844    .2251185     .417908          0          1
mean_labor~e |        996    .1776024    .2529895          0          1
labor_forc~h |        894    .0391499      .19406          0          1
s_mean_lab~e |        994    .1136434    .2274166          0          1
-------------+---------------------------------------------------------
s_labor_fo~h |          0
num_shared~d |        996    3.190763    2.153355          0         18
    age_diff |        995    3.857286    3.795016          0         32
   educ_homo |        996    .4618474    .4987927          0          1
 racial_homo |        996    .8413655    .3655185          0          1
-------------+---------------------------------------------------------
   reli_homo |        996    .8604418    .3467022          0          1
    geo_homo |        996    .6827309     .465647          0          1
    inc_homo |        996    .2008032    .4008024          0          1

-------------------------------------------------------------------------
-> group = 2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      eduyrs |      5,671    12.29342    3.571091          0         17
    s_eduyrs |      5,671    12.27032     3.16458          0         17
       white |      5,671    .8684535    .3380268          0          1
       black |      5,671    .0964557    .2952411          0          1
     s_white |      5,671    .8636925    .3431451          0          1
-------------+---------------------------------------------------------
     s_black |      5,671    .0948686    .2930592          0          1
   migration |      5,671    .0916946    .2886198          0          1
 s_migration |      5,671    .1013931    .3018751          0          1
  protestant |      5,671    .6222888    .4848576          0          1
    catholic |      5,671    .2720861    .4450732          0          1
-------------+---------------------------------------------------------
s_protestant |      5,671    .6420384     .479443          0          1
  s_catholic |      5,671    .2782578    .4481806          0          1
       death |      5,671    .5457591    .4979456          0          1
   death_age |      3,095    79.12569    8.723248         51        103
   widow_age |          0
-------------+---------------------------------------------------------
   year_diff |          0
ever_retired |      5,671    .9000176    .3000029          0          1
yrs_diff_r~e |      2,796    16.83512     9.01799          0         63
s_ever_ret~d |      5,671    .7832834    .4120443          0          1
s_yrs_diff~e |          0
-------------+---------------------------------------------------------
  child_dead |      5,494     .098107    .2974864          0          1
yrs_diff_c~d |        309    6.352751    4.714082          0         23
s_yrs_diff~d |          0
   child_liv |      5,671    1.987284     1.66339          0         11
child_liv_~h |      5,608    2.023003    2.263222          0         11
-------------+---------------------------------------------------------
s_child_li~h |          0
mean_drink~s |      5,671    1.406724    2.002474          0          7
mean_drink.. |      4,996    1.381105    2.166115          0          7
s_mean_dri~s |      5,319    .8773879     1.65007          0          7
s_mean_dri.. |          0
-------------+---------------------------------------------------------
mean_drink~m |      5,669    .8309131    1.250414          0         21
mean_drink.. |      4,995    .7460127    1.271642          0         24
s_mean_dri~m |      5,319    .4374252    .7343966          0       11.5
s_mean_dri.. |          0
max_hosp_v~t |      5,670    .7871252    .4093759          0          1
-------------+---------------------------------------------------------
max_hosp_v~h |      4,999    .6239248    .4844477          0          1
s_max_hosp~t |      5,327    .6482072    .4775745          0          1
s_max_hosp~w |          0
mean_hosp_~e |      5,670    .5924044     .909349          0         20
mean_hosp_~h |      4,998     .692477    1.123107          0   25.66667
-------------+---------------------------------------------------------
s_mean_hos~e |      5,322    .3110316    .4989451          0   6.666667
s_mean_hos~w |          0
max_nurs_h~e |      5,671     .045142    .2076337          0          1
max_nurs_h~h |      4,998    .0266106    .1609587          0          1
s_max_nurs~e |      5,319    .0236887    .1520916          0          1
-------------+---------------------------------------------------------
s_max_nurs~w |          0
    mean_bmi |      5,669    27.56823    4.365393   14.47083       53.8
mean_bmi_b~h |      4,418    28.07663    4.960284        3.2   57.13334
  s_mean_bmi |      5,302     27.4935    5.425208   15.26667   65.61945
s_mean_bmi~w |          0
-------------+---------------------------------------------------------
   mean_cesd |      5,405    1.132329    1.264295          0          8
mean_cesd_~h |      4,609    1.167245    1.435011          0          8
 s_mean_cesd |      5,268    1.328323    1.414251          0          8
s_mean_ces~w |          0
 mean_expend |      5,671    3020.046    5145.304          0     159418
-------------+---------------------------------------------------------
mean_expen~h |      4,998    3589.146    8915.335          0   419758.3
s_mean_exp~d |      5,319    2877.001    4360.736          0     111486
s_mean_exp~w |          0
num_symptoms |      5,669    2.037573    1.276034          0          6
num_sympto~h |      4,980    1.993976    1.235465          0          6
-------------+---------------------------------------------------------
s_num_symp~s |      5,322    1.376362    1.135704          0          6
s_num_symp~w |          0
   max_psych |      5,671    .1426556    .3497521          0          1
max_psych_~h |      4,997    .1358815     .342697          0          1
 s_max_psych |      5,323    .1882397    .3909402          0          1
-------------+---------------------------------------------------------
s_max_psyc~w |          0
mean_proxy~y |      1,754    3.020988    1.191296          1          5
min_proxy_~h |        944     3.20339    1.240424          1          5
s_mean_pro~y |        610    2.793197    1.355673          1          5
s_min_prox~w |          0
-------------+---------------------------------------------------------
mean_log_a~t |      5,671    9.596133    2.481678    4.60517    15.9426
mean_log_a~h |      5,658    10.72917    3.039108   4.258596   16.88828
mean_log_f~c |      5,671    7.877531    2.444596   2.302585   13.15521
mean_log_f~h |      5,671    9.114968    2.921215   2.302585   14.19571
mean_log_i~e |      5,671    7.206385    2.266191   2.302585   12.94962
-------------+---------------------------------------------------------
mean_log_i~h |      5,671    8.470771    2.735022   2.302585   12.76389
s_mean_log~e |      5,670    6.249966    2.473362   2.302585   11.43354
s_mean_log~w |          0
 max_pension |      5,671    .6013049     .489673          0          1
max_pensio~h |      5,671    .4872157    .4998806          0          1
-------------+---------------------------------------------------------
s_max_pens~n |      5,670    .2820106    .4500181          0          1
s_max_pens~w |          0
mean_labor~e |      5,671    .2211795    .2814503          0          1
labor_forc~h |      5,483    .0793361    .2702873          0          1
s_mean_lab~e |      5,667    .1995375    .2735573          0          1
-------------+---------------------------------------------------------
s_labor_fo~h |          0
num_shared~d |      5,671    3.285311    2.158955          0         21
    age_diff |      5,669    4.745987    4.618705          0         35
   educ_homo |      5,671    .4329042    .4955214          0          1
 racial_homo |      5,671    .8462352    .3607549          0          1
-------------+---------------------------------------------------------
   reli_homo |      5,671    .8278963    .3775038          0          1
    geo_homo |      5,671    .6663728    .4715499          0          1
    inc_homo |      5,671    .2292365    .4203787          0          1

-------------------------------------------------------------------------
-> group = 3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      eduyrs |      2,497    11.94954    3.018349          0         17
    s_eduyrs |      2,497     11.5803     3.78764          0         17
       white |      2,497    .8618342     .345143          0          1
       black |      2,497    .1057269    .3075493          0          1
     s_white |      2,497    .8610332    .3459811          0          1
-------------+---------------------------------------------------------
     s_black |      2,497    .1077293    .3101003          0          1
   migration |      2,497     .093312    .2909274          0          1
 s_migration |      2,497    .0804966     .272115          0          1
  protestant |      2,497    .6688026    .4707382          0          1
    catholic |      2,497     .267521     .442755          0          1
-------------+---------------------------------------------------------
s_protestant |      2,497    .6363636     .481142          0          1
  s_catholic |      2,497    .2607129    .4391115          0          1
       death |      2,497    .4020825    .4904166          0          1
   death_age |      1,004    85.00498    7.962085         58        111
   widow_age |      2,497    76.56308    8.300118         53        105
-------------+---------------------------------------------------------
   year_diff |      1,004    6.148406    4.107587          0         18
ever_retired |      2,497    .9531438    .2113732          0          1
yrs_diff_r~e |        867    24.24221    13.44363          1         83
s_ever_ret~d |      2,497    .9098919     .286394          0          1
s_yrs_diff~e |      2,249     19.1494    8.330415          2         64
-------------+---------------------------------------------------------
  child_dead |      2,416    .1746689    .3797622          0          1
yrs_diff_c~d |        165    7.963636    4.956999          0         23
s_yrs_diff~d |        422    1.952607    7.004419        -14         24
   child_liv |      2,497    2.728617     1.89284          0         11
child_liv_~h |      2,436    2.183498    2.312805          0         11
-------------+---------------------------------------------------------
s_child_li~h |      2,447    3.402534    2.132422          0         11
mean_drink~s |      2,497    .7338626    1.495882          0          7
mean_drink.. |      2,389    .6723176     1.54928          0          7
s_mean_dri~s |      2,343    1.314686    2.039887          0          7
s_mean_dri.. |      2,095    1.124344    1.976223          0          7
-------------+---------------------------------------------------------
mean_drink~m |      2,497     .338523    .5923167          0   6.121212
mean_drink.. |      2,390    .2957462     .606898          0          6
s_mean_dri~m |      2,343    .7161713    1.158065          0   11.16667
s_mean_dri.. |      2,095    .5627685     1.02343          0         10
max_hosp_v~t |      2,497    .8394073    .3672284          0          1
-------------+---------------------------------------------------------
max_hosp_v~h |      2,386    .6156748    .4865373          0          1
s_max_hosp~t |      2,346    .8354646    .3708397          0          1
s_max_hosp~w |      2,095    .7618138    .4260753          0          1
mean_hosp_~e |      2,497    .4750207    .6937996          0   15.88095
mean_hosp_~h |      2,385     .695877    1.194053          0         27
-------------+---------------------------------------------------------
s_mean_hos~e |      2,346    .6635063    .8399132          0   10.22222
s_mean_hos~w |      2,095    .9870326    1.518564          0         38
max_nurs_h~e |      2,497    .1577893    .3646164          0          1
max_nurs_h~h |      2,391    .1183605    .3231021          0          1
s_max_nurs~e |      2,344    .0674061    .2507776          0          1
-------------+---------------------------------------------------------
s_max_nurs~w |      2,095     .071599    .2578844          0          1
    mean_bmi |      2,494    27.37436    5.450534   15.71429   53.73333
mean_bmi_b~h |      1,947    27.87882    6.243225       15.4       54.1
  s_mean_bmi |      2,347    26.95705    4.347841   14.53333      56.15
s_mean_bmi~w |      1,939    26.71889     4.70049   14.53333   55.16667
-------------+---------------------------------------------------------
   mean_cesd |      2,486    1.681277    1.452468          0   7.783333
mean_cesd_~h |      2,264    1.847394    1.745952          0          8
 s_mean_cesd |      2,198    1.282077    1.332314          0       7.75
s_mean_ces~w |      1,882     1.48344    1.525321          0          8
 mean_expend |      2,497      4226.9    6578.755          0    81941.3
-------------+---------------------------------------------------------
mean_expen~h |      2,391      5818.6    13356.39          0     212359
s_mean_exp~d |      2,344    3256.677     7303.38          0     183816
s_mean_exp~w |      2,095     4328.06    7603.042          0   110413.7
num_symptoms |      2,497    1.976372    1.203228          0          6
num_sympto~h |      2,379     1.92644    1.175179          0          6
-------------+---------------------------------------------------------
s_num_symp~s |      2,346    2.263853    1.295502          0          6
s_num_symp~w |      2,086    2.288591      1.2849          0          6
   max_psych |      2,497    .2863436    .4521425          0          1
max_psych_~h |      2,389    .2674759    .4427354          0          1
 s_max_psych |      2,347    .1657435    .3719295          0          1
-------------+---------------------------------------------------------
s_max_psyc~w |      2,093    .1677019    .3736906          0          1
mean_proxy~y |        578    3.798056    1.249227          1          5
min_proxy_~h |        399    3.964912    1.159957          1          5
s_mean_pro~y |        856    3.266038     1.20632          1          5
s_min_prox~w |        656     3.51372    1.230575          1          5
-------------+---------------------------------------------------------
mean_log_a~t |      2,497    10.50184    2.046712    4.60517    15.6884
mean_log_a~h |      2,485    10.77825    2.652071    4.60517   16.43602
mean_log_f~c |      2,497    8.954654    1.619283   2.302585   12.73811
mean_log_f~h |      2,497    9.310334    2.017947   2.302585   12.77129
mean_log_i~e |      2,497    7.741738    1.587589   2.302585   11.27615
-------------+---------------------------------------------------------
mean_log_i~h |      2,497    8.843804    1.947273   2.302585    12.1153
s_mean_log~e |      2,496    6.621872    2.448007   2.302585   11.93162
s_mean_log~w |      2,143    9.470289    1.383876   2.302585   12.51668
 max_pension |      2,497     .556668    .4968779          0          1
max_pensio~h |      2,497    .4617541     .498635          0          1
-------------+---------------------------------------------------------
s_max_pens~n |      2,496    .5424679     .498293          0          1
s_max_pens~w |      2,143    .5296314    .4992377          0          1
mean_labor~e |      2,497    .1513448    .2495192          0          1
labor_forc~h |      2,235    .0375839    .1902302          0          1
s_mean_lab~e |      2,493    .1674272    .2804312          0          1
-------------+---------------------------------------------------------
s_labor_fo~h |          0
num_shared~d |      2,497    3.135362    2.057881          0         20
    age_diff |      2,496         4.5    4.175796          0         32
   educ_homo |      2,497    .4377253    .4962061          0          1
 racial_homo |      2,497    .8462155    .3608143          0          1
-------------+---------------------------------------------------------
   reli_homo |      2,497    .8486183    .3584923          0          1
    geo_homo |      2,497    .6836203    .4651561          0          1
    inc_homo |      2,497    .1998398    .3999599          0          1

-------------------------------------------------------------------------
-> group = 4

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      eduyrs |      3,648    12.41639    2.902893          0         17
    s_eduyrs |      3,648    12.33827    3.662652          0         17
       white |      3,648    .8714364    .3347622          0          1
       black |      3,648    .0989583     .298647          0          1
     s_white |      3,648    .8607456    .3462592          0          1
-------------+---------------------------------------------------------
     s_black |      3,648    .0978618    .2971685          0          1
   migration |      3,648    .0940241    .2919023          0          1
 s_migration |      3,648    .0901864    .2864879          0          1
  protestant |      3,648    .6529605    .4760937          0          1
    catholic |      3,648    .2765899    .4473732          0          1
-------------+---------------------------------------------------------
s_protestant |      3,648    .6151316    .4866309          0          1
  s_catholic |      3,648    .2711075    .4445924          0          1
       death |      3,648    .3991228    .4897852          0          1
   death_age |      1,456    77.20604    8.868888         52         98
   widow_age |          0
-------------+---------------------------------------------------------
   year_diff |          0
ever_retired |      3,648    .8519737    .3551748          0          1
yrs_diff_r~e |      1,158    19.06218    12.52702          0         69
s_ever_ret~d |      3,648     .870614    .3356726          0          1
s_yrs_diff~e |          0
-------------+---------------------------------------------------------
  child_dead |      3,521    .1033797    .3044974          0          1
yrs_diff_c~d |        151    6.880795    4.892071          0         23
s_yrs_diff~d |          0
   child_liv |      3,648    2.111739     1.74677          0         11
child_liv_~h |      3,614    1.858052    2.166102          0         11
-------------+---------------------------------------------------------
s_child_li~h |          0
mean_drink~s |      3,648     .870702    1.633881          0          7
mean_drink.. |      3,064    .9277633    1.841712          0          7
s_mean_dri~s |      3,421    1.481739    2.053628          0          7
s_mean_dri.. |          0
-------------+---------------------------------------------------------
mean_drink~m |      3,648    .4083553     .675869          0          6
mean_drink.. |      3,063    .3959082     .715031          0        7.5
s_mean_dri~m |      3,418    .8692588    1.212754          0   13.85714
s_mean_dri.. |          0
max_hosp_v~t |      3,646    .7375206    .4400421          0          1
-------------+---------------------------------------------------------
max_hosp_v~h |      3,062    .5600914     .496457          0          1
s_max_hosp~t |      3,424    .7225467    .4478075          0          1
s_max_hosp~w |          0
mean_hosp_~e |      3,646    .5018112    .9850682          0     31.875
mean_hosp_~h |      3,062    .6280753    1.029092          0         12
-------------+---------------------------------------------------------
s_mean_hos~e |      3,424    .3679377    .6215486          0       22.5
s_mean_hos~w |          0
max_nurs_h~e |      3,648    .0479715    .2137352          0          1
max_nurs_h~h |      3,064    .0313316    .1742407          0          1
s_max_nurs~e |      3,421    .0245542    .1547847          0          1
-------------+---------------------------------------------------------
s_max_nurs~w |          0
    mean_bmi |      3,639    27.31169    5.678317       12.6   61.73958
mean_bmi_b~h |      2,655    28.19449    6.290257       12.6       59.3
  s_mean_bmi |      3,420    27.92383     4.21285   17.16667   53.25714
s_mean_bmi~w |          0
-------------+---------------------------------------------------------
   mean_cesd |      3,594    1.403913    1.474505          0          8
mean_cesd_~h |      2,954    1.451422    1.661002          0          8
 s_mean_cesd |      3,288    .9288738    1.172628          0          8
s_mean_ces~w |          0
 mean_expend |      3,648    3499.526    4725.927          0   61349.81
-------------+---------------------------------------------------------
mean_expen~h |      3,064    3867.905    6539.967          0     124446
s_mean_exp~d |      3,421    2429.988    3154.945          0    64612.5
s_mean_exp~w |          0
num_symptoms |      3,647    1.740883    1.247503          0          6
num_sympto~h |      3,051    1.787938    1.213827          0          6
-------------+---------------------------------------------------------
s_num_symp~s |      3,424    1.750292    1.206843          0          6
s_num_symp~w |          0
   max_psych |      3,648    .2113487    .4083211          0          1
max_psych_~h |      3,065    .2156607     .411347          0          1
 s_max_psych |      3,424    .1051402    .3067788          0          1
-------------+---------------------------------------------------------
s_max_psyc~w |          0
mean_proxy~y |        632    3.176074    1.369344          1          5
min_proxy_~h |        328     3.42378    1.412152          1          5
s_mean_pro~y |        906    2.617358    1.103079          1          5
s_min_prox~w |          0
-------------+---------------------------------------------------------
mean_log_a~t |      3,648    9.931802    2.531023    4.60517    15.9426
mean_log_a~h |      3,639    10.48006    3.282839    4.60517   16.73137
mean_log_f~c |      3,648    8.206285    2.467132   2.302585   13.15521
mean_log_f~h |      3,648    8.780951    3.210204   2.302585   14.12117
mean_log_i~e |      3,648    6.486807    2.152523   2.302585   11.70139
-------------+---------------------------------------------------------
mean_log_i~h |      3,648    7.457616    2.782465   2.302585   12.20588
s_mean_log~e |      3,648    7.496599    2.707512   2.302585   12.94962
s_mean_log~w |          0
 max_pension |      3,648    .3141447     .464238          0          1
max_pensio~h |      3,648    .2264254    .4185749          0          1
-------------+---------------------------------------------------------
s_max_pens~n |      3,648    .5633224    .4960421          0          1
s_max_pens~w |          0
mean_labor~e |      3,648    .1836696    .2604128          0          1
labor_forc~h |      3,519    .0460358    .2095924          0          1
s_mean_lab~e |      3,648    .2521453     .295014          0          1
-------------+---------------------------------------------------------
s_labor_fo~h |          0
num_shared~d |      3,648    2.983279     1.91225          0         18
    age_diff |      3,647    3.695914    3.522741          0         33
   educ_homo |      3,648    .4394189    .4963844          0          1
 racial_homo |      3,648    .8475877    .3594693          0          1
-------------+---------------------------------------------------------
   reli_homo |      3,648    .8314145    .3744367          0          1
    geo_homo |      3,648    .6666667    .4714691          0          1
    inc_homo |      3,648    .2077851    .4057777          0          1


. 
. /* select the variables and prepare for transferring into long form */
. g s_birth_year = s_birth_year_4 
(5 missing values generated)

. 
. *before transferring to the long form, we need to first drop the genera
> ted average values for time-varying variables when conducting the descr
> iptive statistics. 
. drop child_liv mean_drink_days s_mean_drink_days mean_drink_num s_mean_
> drink_num max_hosp_visit s_max_hosp_visit mean_hosp_time s_mean_hosp_ti
> me max_nurs_home s_max_nurs_home mean_bmi s_mean_bmi mean_cesd s_mean_c
> esd mean_expend s_mean_expend max_high_bp s_max_high_bp max_diabetes s_
> max_diabetes max_cancer s_max_cancer max_lung s_max_lung max_heart s_ma
> x_heart max_stroke s_max_stroke max_psych s_max_psych mean_proxy_memory
>  s_mean_proxy_memory mean_log_asset mean_log_family_inc mean_log_income
>  s_mean_log_income max_pension s_max_pension mean_labor_force s_mean_la
> bor_force 

. 
. g child_dead_bf_widow = 1 if (child_dead_year <= year_widow & year_wido
> w != .)
(12,401 missing values generated)

. replace child_dead_bf_widow = 0 if child_dead_bf_widow != 1
(12,401 real changes made)

. 
. keep hhidpn group widow* male birth_year white black protestant catholi
> c migration eduyrs s_eduyrs s_white s_black s_protestant s_catholic s_m
> igration s_birth_year year_gap year_diff death death_age death_year dea
> th_wave exit_wave failure_year censor_year censor_age age_diff right_ce
> nsor  right_censor_alive right_censor_exit wave_start* wave_end* ever_r
> etired s_ever_retired child_dead child_dead_year year_widow child_dead_
> bf_widow child_liv* mean_drink_days* s_mean_drink_days* mean_drink_num*
>  s_mean_drink_num* max_hosp_visit* s_max_hosp_visit* mean_hosp_time* s_
> mean_hosp_time* max_nurs_home* s_max_nurs_home* mean_bmi* s_mean_bmi* m
> ean_cesd* s_mean_cesd* mean_expend* s_mean_expend* max_high_bp* s_max_h
> igh_bp* max_diabetes* s_max_diabetes* max_cancer* s_max_cancer* max_lun
> g* s_max_lung* max_heart* s_max_heart* max_stroke* s_max_stroke* max_ps
> ych* s_max_psych* min_proxy_memory* s_min_proxy_memory* mean_log_asset*
>  mean_log_fam_income* mean_log_income* s_mean_log_income* max_pension* 
> s_max_pension* labor_force* s_labor_force* num_shared_child  educ_homo 
> racial_homo reli_homo geo_homo inc_homo wt* wid_remar* divorce* widow_w
> ave year_since_widow* year_since_retire* year_since_child_dead* college
> _homo college s_college s_year_since_retire* wave_age* s_wave_age* asse
> t_class asset_4

. 
. 
. reshape long widow_ wave_start_ wave_end_ child_liv_ mean_drink_days_ s
> _mean_drink_days_ mean_drink_num_ s_mean_drink_num_ max_hosp_visit_ s_m
> ax_hosp_visit_ mean_hosp_time_ s_mean_hosp_time_ max_nurs_home_ s_max_n
> urs_home_ mean_bmi_ s_mean_bmi_ mean_cesd_ s_mean_cesd_ mean_expend_ s_
> mean_expend_ max_high_bp_ s_max_high_bp_ max_diabetes_ s_max_diabetes_ 
> max_cancer_ s_max_cancer_ max_lung_ s_max_lung_ max_heart_ s_max_heart_
>  max_stroke_ s_max_stroke_ max_psych_ s_max_psych_ min_proxy_memory_ s_
> min_proxy_memory_ mean_log_asset_ mean_log_fam_income_ mean_log_income_
>  s_mean_log_income_ max_pension_ s_max_pension_ labor_force_ s_labor_fo
> rce_ wt_ wave_start_age_ wave_end_age_ wid_remar_  divorce_ year_since_
> widow_ year_since_retire_ year_since_child_dead_ s_year_since_retire_ w
> ave_age_ s_wave_age_, i(hhidpn) j(wave)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14)
(variable widow_1 not found)
(variable wave_start_1 not found)
(variable wave_end_1 not found)
(variable mean_drink_days_1 not found)
(variable s_mean_drink_days_1 not found)
(variable mean_drink_num_1 not found)
(variable s_mean_drink_num_1 not found)
(variable max_hosp_visit_1 not found)
(variable s_max_hosp_visit_1 not found)
(variable mean_hosp_time_1 not found)
(variable s_mean_hosp_time_1 not found)
(variable max_nurs_home_1 not found)
(variable s_max_nurs_home_1 not found)
(variable mean_bmi_1 not found)
(variable s_mean_bmi_1 not found)
(variable mean_cesd_1 not found)
(variable s_mean_cesd_1 not found)
(variable mean_expend_1 not found)
(variable s_mean_expend_1 not found)
(variable max_high_bp_1 not found)
(variable s_max_high_bp_1 not found)
(variable max_diabetes_1 not found)
(variable s_max_diabetes_1 not found)
(variable max_cancer_1 not found)
(variable s_max_cancer_1 not found)
(variable max_lung_1 not found)
(variable s_max_lung_1 not found)
(variable max_heart_1 not found)
(variable s_max_heart_1 not found)
(variable max_stroke_1 not found)
(variable s_max_stroke_1 not found)
(variable max_psych_1 not found)
(variable s_max_psych_1 not found)
(variable min_proxy_memory_1 not found)
(variable s_min_proxy_memory_1 not found)
(variable mean_log_asset_1 not found)
(variable mean_log_fam_income_1 not found)
(variable mean_log_income_1 not found)
(variable s_mean_log_income_1 not found)
(variable max_pension_1 not found)
(variable s_max_pension_1 not found)
(variable wave_start_age_1 not found)
(variable wave_end_age_1 not found)
(variable wid_remar_1 not found)
(variable divorce_1 not found)
(variable year_since_widow_1 not found)
(variable year_since_retire_1 not found)
(variable year_since_child_dead_1 not found)
(variable s_year_since_retire_1 not found)
(variable wave_age_1 not found)
(variable s_wave_age_1 not found)
(variable widow_2 not found)
(variable wave_start_2 not found)
(variable wave_end_2 not found)
(variable mean_drink_days_2 not found)
(variable s_mean_drink_days_2 not found)
(variable mean_drink_num_2 not found)
(variable s_mean_drink_num_2 not found)
(variable max_hosp_visit_2 not found)
(variable s_max_hosp_visit_2 not found)
(variable mean_hosp_time_2 not found)
(variable s_mean_hosp_time_2 not found)
(variable max_nurs_home_2 not found)
(variable s_max_nurs_home_2 not found)
(variable mean_bmi_2 not found)
(variable s_mean_bmi_2 not found)
(variable mean_cesd_2 not found)
(variable s_mean_cesd_2 not found)
(variable mean_expend_2 not found)
(variable s_mean_expend_2 not found)
(variable max_high_bp_2 not found)
(variable s_max_high_bp_2 not found)
(variable max_diabetes_2 not found)
(variable s_max_diabetes_2 not found)
(variable max_cancer_2 not found)
(variable s_max_cancer_2 not found)
(variable max_lung_2 not found)
(variable s_max_lung_2 not found)
(variable max_heart_2 not found)
(variable s_max_heart_2 not found)
(variable max_stroke_2 not found)
(variable s_max_stroke_2 not found)
(variable max_psych_2 not found)
(variable s_max_psych_2 not found)
(variable min_proxy_memory_2 not found)
(variable s_min_proxy_memory_2 not found)
(variable mean_log_asset_2 not found)
(variable mean_log_fam_income_2 not found)
(variable mean_log_income_2 not found)
(variable s_mean_log_income_2 not found)
(variable max_pension_2 not found)
(variable s_max_pension_2 not found)
(variable wave_start_age_2 not found)
(variable wave_end_age_2 not found)
(variable wid_remar_2 not found)
(variable divorce_2 not found)
(variable year_since_widow_2 not found)
(variable year_since_retire_2 not found)
(variable year_since_child_dead_2 not found)
(variable s_year_since_retire_2 not found)
(variable wave_age_2 not found)
(variable s_wave_age_2 not found)
(variable widow_3 not found)
(variable wave_start_3 not found)
(variable wave_end_3 not found)
(variable mean_drink_days_3 not found)
(variable s_mean_drink_days_3 not found)
(variable mean_drink_num_3 not found)
(variable s_mean_drink_num_3 not found)
(variable max_hosp_visit_3 not found)
(variable s_max_hosp_visit_3 not found)
(variable mean_hosp_time_3 not found)
(variable s_mean_hosp_time_3 not found)
(variable max_nurs_home_3 not found)
(variable s_max_nurs_home_3 not found)
(variable mean_bmi_3 not found)
(variable s_mean_bmi_3 not found)
(variable mean_cesd_3 not found)
(variable s_mean_cesd_3 not found)
(variable mean_expend_3 not found)
(variable s_mean_expend_3 not found)
(variable max_high_bp_3 not found)
(variable s_max_high_bp_3 not found)
(variable max_diabetes_3 not found)
(variable s_max_diabetes_3 not found)
(variable max_cancer_3 not found)
(variable s_max_cancer_3 not found)
(variable max_lung_3 not found)
(variable s_max_lung_3 not found)
(variable max_heart_3 not found)
(variable s_max_heart_3 not found)
(variable max_stroke_3 not found)
(variable s_max_stroke_3 not found)
(variable max_psych_3 not found)
(variable s_max_psych_3 not found)
(variable min_proxy_memory_3 not found)
(variable s_min_proxy_memory_3 not found)
(variable mean_log_asset_3 not found)
(variable mean_log_fam_income_3 not found)
(variable mean_log_income_3 not found)
(variable s_mean_log_income_3 not found)
(variable max_pension_3 not found)
(variable s_max_pension_3 not found)
(variable wave_start_age_3 not found)
(variable wave_end_age_3 not found)
(variable wid_remar_3 not found)
(variable divorce_3 not found)
(variable year_since_widow_3 not found)
(variable year_since_retire_3 not found)
(variable year_since_child_dead_3 not found)
(variable s_year_since_retire_3 not found)
(variable wave_age_3 not found)
(variable s_wave_age_3 not found)

Data                               Wide   ->   Long
-------------------------------------------------------------------------
> ----
Number of observations           12,812   ->   179,368     
Number of variables                 709   ->   148         
j variable (14 values)                    ->   wave
xij variables:
           widow_1 widow_2 ... widow_14   ->   widow_
wave_start_1 wave_start_2 ... wave_start_14->  wave_start_
  wave_end_1 wave_end_2 ... wave_end_14   ->   wave_end_
child_liv_1 child_liv_2 ... child_liv_14  ->   child_liv_
mean_drink_days_1 mean_drink_days_2 ... mean_drink_days_14->mean_drink_da
> ys_
s_mean_drink_days_1 s_mean_drink_days_2 ... s_mean_drink_days_14->s_mean_
> drink_days_
mean_drink_num_1 mean_drink_num_2 ... mean_drink_num_14->mean_drink_num_
s_mean_drink_num_1 s_mean_drink_num_2 ... s_mean_drink_num_14->s_mean_dri
> nk_num_
max_hosp_visit_1 max_hosp_visit_2 ... max_hosp_visit_14->max_hosp_visit_
s_max_hosp_visit_1 s_max_hosp_visit_2 ... s_max_hosp_visit_14->s_max_hosp
> _visit_
mean_hosp_time_1 mean_hosp_time_2 ... mean_hosp_time_14->mean_hosp_time_
s_mean_hosp_time_1 s_mean_hosp_time_2 ... s_mean_hosp_time_14->s_mean_hos
> p_time_
max_nurs_home_1 max_nurs_home_2 ... max_nurs_home_14->max_nurs_home_
s_max_nurs_home_1 s_max_nurs_home_2 ... s_max_nurs_home_14->s_max_nurs_ho
> me_
  mean_bmi_1 mean_bmi_2 ... mean_bmi_14   ->   mean_bmi_
s_mean_bmi_1 s_mean_bmi_2 ... s_mean_bmi_14->  s_mean_bmi_
mean_cesd_1 mean_cesd_2 ... mean_cesd_14  ->   mean_cesd_
s_mean_cesd_1 s_mean_cesd_2 ... s_mean_cesd_14->s_mean_cesd_
mean_expend_1 mean_expend_2 ... mean_expend_14->mean_expend_
s_mean_expend_1 s_mean_expend_2 ... s_mean_expend_14->s_mean_expend_
max_high_bp_1 max_high_bp_2 ... max_high_bp_14->max_high_bp_
s_max_high_bp_1 s_max_high_bp_2 ... s_max_high_bp_14->s_max_high_bp_
max_diabetes_1 max_diabetes_2 ... max_diabetes_14->max_diabetes_
s_max_diabetes_1 s_max_diabetes_2 ... s_max_diabetes_14->s_max_diabetes_
max_cancer_1 max_cancer_2 ... max_cancer_14->  max_cancer_
s_max_cancer_1 s_max_cancer_2 ... s_max_cancer_14->s_max_cancer_
  max_lung_1 max_lung_2 ... max_lung_14   ->   max_lung_
s_max_lung_1 s_max_lung_2 ... s_max_lung_14->  s_max_lung_
max_heart_1 max_heart_2 ... max_heart_14  ->   max_heart_
s_max_heart_1 s_max_heart_2 ... s_max_heart_14->s_max_heart_
max_stroke_1 max_stroke_2 ... max_stroke_14->  max_stroke_
s_max_stroke_1 s_max_stroke_2 ... s_max_stroke_14->s_max_stroke_
max_psych_1 max_psych_2 ... max_psych_14  ->   max_psych_
s_max_psych_1 s_max_psych_2 ... s_max_psych_14->s_max_psych_
min_proxy_memory_1 min_proxy_memory_2 ... min_proxy_memory_14->min_proxy_
> memory_
s_min_proxy_memory_1 s_min_proxy_memory_2 ... s_min_proxy_memory_14->s_mi
> n_proxy_memory_
mean_log_asset_1 mean_log_asset_2 ... mean_log_asset_14->mean_log_asset_
mean_log_fam_income_1 mean_log_fam_income_2 ... mean_log_fam_income_14->m
> ean_log_fam_income_
mean_log_income_1 mean_log_income_2 ... mean_log_income_14->mean_log_inco
> me_
s_mean_log_income_1 s_mean_log_income_2 ... s_mean_log_income_14->s_mean_
> log_income_
max_pension_1 max_pension_2 ... max_pension_14->max_pension_
s_max_pension_1 s_max_pension_2 ... s_max_pension_14->s_max_pension_
labor_force_1 labor_force_2 ... labor_force_14->labor_force_
s_labor_force_1 s_labor_force_2 ... s_labor_force_14->s_labor_force_
                    wt_1 wt_2 ... wt_14   ->   wt_
wave_start_age_1 wave_start_age_2 ... wave_start_age_14->wave_start_age_
wave_end_age_1 wave_end_age_2 ... wave_end_age_14->wave_end_age_
wid_remar_1 wid_remar_2 ... wid_remar_14  ->   wid_remar_
     divorce_1 divorce_2 ... divorce_14   ->   divorce_
year_since_widow_1 year_since_widow_2 ... year_since_widow_14->year_since
> _widow_
year_since_retire_1 year_since_retire_2 ... year_since_retire_14->year_si
> nce_retire_
year_since_child_dead_1 year_since_child_dead_2 ... year_since_child_dead
> _14->year_since_child_dead_
s_year_since_retire_1 s_year_since_retire_2 ... s_year_since_retire_14->s
> _year_since_retire_
  wave_age_1 wave_age_2 ... wave_age_14   ->   wave_age_
s_wave_age_1 s_wave_age_2 ... s_wave_age_14->  s_wave_age_
-------------------------------------------------------------------------
> ----

. 
. 
. 
. foreach i in widow wave_start wave_end child_liv mean_drink_days s_mean
> _drink_days mean_drink_num s_mean_drink_num max_hosp_visit s_max_hosp_v
> isit mean_hosp_time s_mean_hosp_time max_nurs_home s_max_nurs_home mean
> _bmi s_mean_bmi mean_cesd s_mean_cesd mean_expend s_mean_expend max_hig
> h_bp s_max_high_bp max_diabetes s_max_diabetes max_cancer s_max_cancer 
> max_lung s_max_lung max_heart s_max_heart max_stroke s_max_stroke max_p
> sych s_max_psych min_proxy_memory s_min_proxy_memory mean_log_asset mea
> n_log_fam_income mean_log_income s_mean_log_income max_pension s_max_pe
> nsion labor_force s_labor_force wt wave_start_age wave_end_age wid_rema
> r divorce year_since_widow year_since_retire year_since_child_dead s_ye
> ar_since_retire wave_age s_wave_age {
  2.         rename `i'_ `i'
  3.         recode `i' (.u = .)
  4. }
(0 changes made to widow)
(0 changes made to wave_start)
(0 changes made to wave_end)
(0 changes made to child_liv)
(0 changes made to mean_drink_days)
(0 changes made to s_mean_drink_days)
(0 changes made to mean_drink_num)
(0 changes made to s_mean_drink_num)
(0 changes made to max_hosp_visit)
(6,145 changes made to s_max_hosp_visit)
(0 changes made to mean_hosp_time)
(0 changes made to s_mean_hosp_time)
(0 changes made to max_nurs_home)
(6,145 changes made to s_max_nurs_home)
(0 changes made to mean_bmi)
(0 changes made to s_mean_bmi)
(0 changes made to mean_cesd)
(0 changes made to s_mean_cesd)
(0 changes made to mean_expend)
(0 changes made to s_mean_expend)
(0 changes made to max_high_bp)
(6,162 changes made to s_max_high_bp)
(0 changes made to max_diabetes)
(6,162 changes made to s_max_diabetes)
(0 changes made to max_cancer)
(6,162 changes made to s_max_cancer)
(0 changes made to max_lung)
(6,162 changes made to s_max_lung)
(0 changes made to max_heart)
(6,162 changes made to s_max_heart)
(0 changes made to max_stroke)
(6,162 changes made to s_max_stroke)
(0 changes made to max_psych)
(6,162 changes made to s_max_psych)
(0 changes made to min_proxy_memory)
(0 changes made to s_min_proxy_memory)
(0 changes made to mean_log_asset)
(0 changes made to mean_log_fam_income)
(0 changes made to mean_log_income)
(0 changes made to s_mean_log_income)
(0 changes made to max_pension)
(0 changes made to s_max_pension)
(0 changes made to labor_force)
(14,386 changes made to s_labor_force)
(0 changes made to wt)
(0 changes made to wave_start_age)
(0 changes made to wave_end_age)
(0 changes made to wid_remar)
(0 changes made to divorce)
(0 changes made to year_since_widow)
(0 changes made to year_since_retire)
(0 changes made to year_since_child_dead)
(0 changes made to s_year_since_retire)
(0 changes made to wave_age)
(0 changes made to s_wave_age)

. drop if wave < 4
(38,436 observations deleted)

. drop if divorce == 1
(2,610 observations deleted)

. gen dead = 1 if death_wave <= wave 
(94,841 missing values generated)

. replace dead = 0 if death_wave >wave 
(94,841 real changes made)

. drop if dead[_n] == 1 & dead[_n-1] == 1 & hhidpn[_n] == hhidpn[_n-1]
(31,048 observations deleted)

. replace year_since_child_dead = 0 if year_since_child_dead == .
(17,751 real changes made)

. replace year_since_retire = 0 if year_since_retire == .
(16,221 real changes made)

. replace year_since_widow = 0 if year_since_widow == . 
(94,613 real changes made)

. replace s_year_since_retire = 0 if s_year_since_retire == .
(16,270 real changes made)

. 
. save "C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood\stat
> a_preparation.dta", replace
file C:\Users\pangu\OneDrive -
    Nexus365\thesis\survival\widowhood\stata_preparation.dta saved

. 
. preserve

. keep if male == 1
(54,725 observations deleted)

. save "C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood\male
> .dta", replace
file C:\Users\pangu\OneDrive -
    Nexus365\thesis\survival\widowhood\male.dta saved

. 
. restore

. 
. preserve

. keep if male == 0
(52,549 observations deleted)

. save "C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood\fema
> le.dta", replace
file C:\Users\pangu\OneDrive -
    Nexus365\thesis\survival\widowhood\female.dta saved

. 
. restore

. 
. /*
> /* select the variables, prepare for transferring into long form 
> keep hhidpn male birth_year race educ birth_place migration year_gap re
> ligion s_race* s_educ* s_birth_place* s_migration* s_religion* s_birth_
> year* mean_drink_days*  mean_drink_num* max_cond* mean_health* mean_hos
> p_time* max_hosp_visit* min_income_rank* min_asset_rank* mean_bmi* max_
> nurs_home* mean_cesd* mean_expend* max_high_bp* max_diabetes* max_cance
> r* max_lung* max_heart* max_stroke* max_psych* max_arthritis* max_smoke
> * min_proxy_memory* max_adl* s_mean_drink_days*  s_mean_drink_num* s_ma
> x_cond* s_mean_health* s_mean_hosp_time* s_max_hosp_visit* s_min_income
> _rank*  s_mean_bmi* s_max_nurs_home* s_mean_cesd* s_mean_expend* s_max_
> high_bp* s_max_diabetes* s_max_cancer* s_max_lung* s_max_heart* s_max_s
> troke* s_max_psych* s_max_arthritis* s_max_smoke* s_min_proxy_memory* s
> _max_adl* widow_* wid_remar_* divorce_* wave_start_age* wave_end_age* e
> duc_homo reli_homo racial_homo inc_homo geo_homo death_year death_wave 
> exit_wave failure_year censor_year censor_age age_diff right_censor div
> orce_censor right_censor_alive right_censor_exit wave_start* wave_end* 
> cesd* adl* health* drink_days* drink_num* 
> 
> drop s_birth_place_1 s_birth_place_2 s_birth_place_3 s_birth_year_1 s_b
> irth_year_2 s_birth_year_3 s_race_1 s_race_2 s_race_3 s_educ_1 s_educ_2
>  s_educ_3 s_migration_1 s_migration_2 s_migration_3 s_religion_1 s_reli
> gion_2 s_religion_3 
> 
> reshape long s_birth_year_ s_race_ s_educ_ s_birth_place_ s_migration_ 
> s_religion_  mean_drink_days_  mean_drink_num_ max_cond_ mean_health_ m
> ean_hosp_time_ max_hosp_visit_ min_income_rank_ min_asset_rank_ mean_bm
> i_ max_nurs_home_ mean_cesd_ mean_expend_ max_high_bp_ max_diabetes_ ma
> x_cancer_ max_lung_ max_heart_ max_stroke_ max_psych_ max_arthritis_ ma
> x_smoke_ min_proxy_memory_ max_adl_ s_mean_drink_days_  s_mean_drink_nu
> m_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_visit_ s_min
> _income_rank_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_
>  s_max_high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ 
> s_max_stroke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_min_proxy_me
> mory_ s_max_adl_ mean_drink_days1_  mean_drink_num1_ max_cond1_ mean_he
> alth1_ mean_hosp_time1_ max_hosp_visit1_ min_income_rank1_ min_asset_ra
> nk1_ mean_bmi1_ max_nurs_home1_ mean_cesd1_ mean_expend1_ max_high_bp1_
>  max_diabetes1_ max_cancer1_ max_lung1_ max_heart1_ max_stroke1_ max_ps
> ych1_ max_arthritis1_ max_smoke1_ min_proxy_memory1_ max_adl1_ s_mean_d
> rink_days1_  s_mean_drink_num1_ s_max_cond1_ s_mean_health1_ s_mean_hos
> p_time1_ s_max_hosp_visit1_ s_min_income_rank1_  s_mean_bmi1_ s_max_nur
> s_home1_ s_mean_cesd1_ s_mean_expend1_ s_max_high_bp1_ s_max_diabetes1_
>  s_max_cancer1_ s_max_lung1_ s_max_heart1_ s_max_stroke1_ s_max_psych1_
>  s_max_arthritis1_ s_max_smoke1_ s_min_proxy_memory1_ s_max_adl1_ mean_
> drink_days2_  mean_drink_num2_ max_cond2_ mean_health2_ mean_hosp_time2
> _ max_hosp_visit2_ min_income_rank2_ min_asset_rank2_ mean_bmi2_ max_nu
> rs_home2_ mean_cesd2_ mean_expend2_ max_high_bp2_ max_diabetes2_ max_ca
> ncer2_ max_lung2_ max_heart2_ max_stroke2_ max_psych2_ max_arthritis2_ 
> max_smoke2_ min_proxy_memory2_ max_adl2_ s_mean_drink_days2_  s_mean_dr
> ink_num2_ s_max_cond2_ s_mean_health2_ s_mean_hosp_time2_ s_max_hosp_vi
> sit2_ s_min_income_rank2_  s_mean_bmi2_ s_max_nurs_home2_ s_mean_cesd2_
>  s_mean_expend2_ s_max_high_bp2_ s_max_diabetes2_ s_max_cancer2_ s_max_
> lung2_ s_max_heart2_ s_max_stroke2_ s_max_psych2_ s_max_arthritis2_ s_m
> ax_smoke2_ s_min_proxy_memory2_ s_max_adl2_ widow_ wid_remar_ divorce_ 
> wave_start_age_ wave_end_age_ wave_start_ wave_end_ cesd_ adl_ health_ 
> drink_days_ drink_num_ , i(hhidpn) j(wave)
> 
> drop if wave < 4
> rename wid_remar_ wid_remar 
> rename divorce_ divorce
> drop if divorce == 1
> gen dead = 1 if death_wave <= wave 
> replace dead = 0 if death_wave >wave 
> drop if dead[_n] == 1 & dead[_n-1] == 1 & hhidpn[_n] == hhidpn[_n-1]
> 
> 
> /************************ STEP II: INITIAL LOGIT MODEL TO PREDICT PROPE
> NSITY OF WIDOWHOOD ****************************************************
> **************/
> /* generate the ordered variables */ 
> gen white = 1 if race == 1
> replace white = 0 if race!= 1
> gen black = 1 if race == 2
> replace black = 0 if race != 2
> 
> gen s_white = 1 if s_race == 1
> replace s_white = 0 if s_race != 1
> gen s_black = 1 if s_race == 2
> replace s_black = 0 if s_race != 2 
> 
> gen protestant = 1 if religion == 1
> replace protestant= 0 if religion != 1
> g catholic = 1 if religion == 2
> replace catholic = 0 if religion != 2
> 
> gen s_protestant = 1 if s_religion == 1
> replace s_protestant= 0 if s_religion != 1
> g s_catholic = 1 if s_religion == 2
> replace s_catholic = 0 if s_religion != 2
> 
> /* predict widowhood */
> /* adding the category of missing */
> 
> replace s_race = s_race[_n-1] if (s_race==.|s_race==.u|s_race==.v|s_rac
> e ==.m)& hhidpn[_n] == hhidpn[_n-1]
> replace s_educ = s_educ[_n-1] if (s_educ==.|s_educ==.u|s_educ==.v|s_edu
> c ==.m)& hhidpn[_n] == hhidpn[_n-1]
> replace s_migration = s_migration[_n-1] if (s_migration==.|s_migration=
> =.u|s_migration==.v|s_migration ==.m)& hhidpn[_n] == hhidpn[_n-1]
> replace s_birth_year = s_birth_year[_n-1] if (s_birth_year==.|s_birth_y
> ear==.u|s_birth_year==.v|s_birth_year ==.m)& hhidpn[_n] == hhidpn[_n-1]
> rename wave_start_ wave_start
> g s_wave_start_age = wave_start - s_birth_year 
> 
> /** ROBUSTNESS CHECKPOINT I: CASES WIDOWED AND REMARRIED ***/
> tab wid_remar 
> save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\main.dta", replace /* all the analysis below, except robustness ch
> eck II for multiple imputation, uses this dataset */
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/main.dta", replace
> preserve 
> 
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow male i.race i.educ i.migration protestant catholic i.s_
> race i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_ 
>  s_mean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_h
> osp_visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_
> max_high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_m
> ax_stroke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_h
> omo reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start
> _age 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction.dta", replace
>  save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data
> /Data_new/widow_prediction.dta", replace 
> restore 
> preserve 
> keep if male == 1
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_m
> ean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_
> visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_
> high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_s
> troke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo 
> reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age
>  
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male.dta", replace /* long form data */ 
> 
> /* save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Da
> ta/Data_new/widow_prediction_male.dta", replace */
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male.dta", replace
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male_propensity.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male_propensity.dta", replace
> 
> restore
> 
> preserve 
> keep if male == 0
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_m
> ean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_
> visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_
> high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_s
> troke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo 
> reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age
>  
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female.dta", replace
> 
>  save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data
> /Data_new/widow_prediction_female.dta", replace 
> 
> 
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female_propensity.dta", replace
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_female_propensity.dta", replace 
> 
> 
> restore 
> 
> /* save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Da
> ta/Data_new/widow_prediction_female.dta", replace */
> 
> 
> 
> /**************************************** STEP III: ADJUSTING AGE WEIGH
> TS FOR TREATMENT　AND CONTROL FOR BOX PLOT*****************************
> ******/
> preserve 
> 
> 
> keep hhidpn wave widow_ wave_start_age_
> 
> reshape wide widow_  wave_start_age_, i(hhidpn) j(wave)
> 
> g ever_widowed = 0
> g widow_wave = .
> forvalues i = 4(1)14{
>         replace ever_widowed = 1 if widow_`i'== 1
> }
> 
> forvalues i =5(1)14{
>         local j = `i' - 1
>         replace widow_wave= `i' if widow_`i' == 1 & widow_`j' == 0
> }
> 
> 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_male_propensity.dta"
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_male_propensity.dta"
> drop _m 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_female_propensity.dta"
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_female_propensity.dta"
> drop _m 
> 
> g widow_age = . 
> g widow_ps = .
> 
> forvalues i = 5(1)14{
>         replace widow_age = wave_start_age_`i' if widow_wave == `i'
>         replace widow_ps = propensity_widow_`i' if widow_wave == `i'
> }
> 
> 
> /*save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Da
> ta_new\ever_widowed.dta", replace
> graph box widow_ps, title("weighted treatment group") ytitle("propensit
> y scores")
> graph save "Graph" "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_pro
> ject\widowed_and_mortality\output\treatment_propensity_box_plot.gph", r
> eplace
> graph export "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\w
> idowed_and_mortality\output\treatment_propensity_box_plot.png", as(png)
>  name("Graph") replace */
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/ever_widowed.dta", replace
> graph box widow_ps, title("weighted treatment group") ytitle("propensit
> y scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/treatment_propensity_box_plot.gph
> ", replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/treatment_propensity_box_plot.png", as(
> png) name("Graph") replace 
> collapse (count) hhidpn, by(widow_age)
> rename hhidpn count_treatment
> drop if widow_age == . 
> egen sum_treatment = total(count_treatment)
> gen percent_treatment = count_treatment/sum_treatment 
> 
> * save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Da
> ta_new\age_dis_treatment.dta" , replace 
> 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_treatment.dta", replace 
> restore 
> 
> /* control group age adjustments */
> 
>  preserve 
> clear
> * use "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male.dta", clear
> 
>  use "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male.dta", clear
> 
> 
> 
> * merge 1:1 hhidpn  wave using "C:\Users\pangu\OneDrive - Nexus365\proj
> ects\HRS_project\Data\Data_new\widow_prediction_female.dta"
> merge 1:1 hhidpn  wave using "/Users/guanghuipan/OneDrive - Nexus365/pr
> ojects/HRS_project/Data/Data_new/widow_prediction_female.dta"
> drop _m 
> 
> keep if widow_ == 0
>  *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Da
> ta_new\never_widowed_long.dta" , replace 
> 
>   save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Dat
> a/Data_new/never_widowed_long.dta" , replace 
> 
> collapse (count) hhidpn, by(wave_start_age_)
> 
> 
> rename wave_start_age_ widow_age 
> drop if widow_age == .
> 
> rename hhidpn count_control
> 
> egen sum_control = total(count_control)
> g percent_control = count_control/sum_control  
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_control.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_control.dta" , replace 
> 
> *merge 1:1 widow_age using "C:\Users\pangu\OneDrive - Nexus365\projects
> \HRS_project\Data\Data_new\age_dis_treatment.dta"
> 
> merge 1:1 widow_age using "/Users/guanghuipan/OneDrive - Nexus365/proje
> cts/HRS_project/Data/Data_new/age_dis_treatment.dta"
> drop _m 
> 
> /* generate the weights */ 
> 
> rename widow_age wave_start_age_
> gen age_weights = percent_control/percent_treatment
> 
> replace age_weights = 0.00001 if age_weights == . 
> 
> /*save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Da
> ta_new\age_dis.dta" , replace 
> 
> merge 1:n wave_start_age_ using "C:\Users\pangu\OneDrive - Nexus365\pro
> jects\HRS_project\Data\Data_new\never_widowed_long.dta"  */
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis.dta" , replace 
> 
> merge 1:n wave_start_age_ using "/Users/guanghuipan/OneDrive - Nexus365
> /projects/HRS_project/Data/Data_new/never_widowed_long.dta" 
> 
> 
> drop _m 
> * calculating the propensity distribution for control group */ 
> /*graph box propensity_widow [aw= age_weights], title("weighted control
>  group") ytitle("propensity scores")
> graph save "Graph" "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_pro
> ject\widowed_and_mortality\output\control_propensity_box_plot.gph", rep
> lace
> graph export "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\w
> idowed_and_mortality\output\control_propensity_box_plot.png", as(png) n
> ame("Graph") replace *
> 
> graph box propensity_widow [aw= age_weights], title("weighted control g
> roup") ytitle("propensity scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/control_propensity_box_plot.gph",
>  replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/control_propensity_box_plot.png", as(pn
> g) name("Graph") replace 
> 
> 
> 
> 
> 
> restore 
> 
> /******************************* ROBUSTNESS CHECK II: MISSING DATA TREA
> TMENT *************************************/
> 
> * Method 1: exclude all data with missing values for logit regression 
> 
> preserve 
> 
> foreach i in widow male race educ migration protestant catholic s_race 
> s_educ s_migration s_protestant s_catholic s_mean_drink_days_  s_mean_d
> rink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_visit
> _  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_high_
> bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_stroke
> _ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo reli_
> homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s | `i' == .u 
> 
> }
> 
> 
> 
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> 
> xi: logit widow male i.race i.educ i.migration protestant catholic i.s_
> race i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_ 
>  s_mean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_h
> osp_visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_
> max_high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_m
> ax_stroke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_h
> omo reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start
> _age 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_exclude_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_exclude_missing.dta", replace
> 
> restore 
> 
> preserve 
> keep if male == 1
> 
> foreach i in widow male race educ migration protestant catholic s_race 
> s_educ s_migration s_protestant s_catholic s_mean_drink_days_  s_mean_d
> rink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_visit
> _  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_high_
> bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_stroke
> _ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo reli_
> homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s | `i' == .u 
> 
> }
> 
> 
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_m
> ean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_
> visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_
> high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_s
> troke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo 
> reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age
>  
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male_exclude_missing.dta", replace /* long form 
> data */ 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male_exclude_missing.dta", replace /* long fo
> rm data */
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male_propensity_exclude_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male_propensity_exclude_missing.dta", replace
> 
> /* save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Da
> ta/Data_new/widow_prediction_male.dta", replace */
> 
> restore
> 
> preserve 
> 
> keep if male == 0
> 
> foreach i in widow male race educ migration protestant catholic s_race 
> s_educ s_migration s_protestant s_catholic s_mean_drink_days_  s_mean_d
> rink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_visit
> _  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_high_
> bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_stroke
> _ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo reli_
> homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s| `i' == .u 
> 
> }
> 
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_mea
> n_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_vi
> sit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_hi
> gh_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_str
> oke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo re
> li_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration s_protestant s_catholic s_mean_drink_days_  s_m
> ean_drink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_
> visit_  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_
> high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_s
> troke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo 
> reli_homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age
>  
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female_exclude_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_female_exclude_missing.dta", replace
> 
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female_propensity_exclude_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_female_propensity_exclude_missing.dta", repla
> ce
> 
> restore 
> preserve
> 
> foreach i in widow male race educ migration protestant catholic s_race 
> s_educ s_migration s_protestant s_catholic s_mean_drink_days_  s_mean_d
> rink_num_ s_max_cond_ s_mean_health_ s_mean_hosp_time_ s_max_hosp_visit
> _  s_mean_bmi_ s_max_nurs_home_ s_mean_cesd_ s_mean_expend_ s_max_high_
> bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_stroke
> _ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo reli_
> homo racial_homo inc_homo geo_homo wave_start_age s_wave_start_age {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s | `i' == .u 
> 
> }
> 
> 
> keep hhidpn wave widow_ wave_start_age_
> 
> reshape wide widow_  wave_start_age_, i(hhidpn) j(wave)
> 
> g ever_widowed = 0
> g widow_wave = .
> forvalues i = 4(1)14{
>         replace ever_widowed = 1 if widow_`i'== 1
> }
> 
> forvalues i =5(1)14{
>         local j = `i' - 1
>         replace widow_wave= `i' if widow_`i' == 1 & widow_`j' == 0
> }
> 
> 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_male_propensity_exclude_missin
> g.dta"
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_male_propensity_exclude_mis
> sing.dta"
> 
> drop _m 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_female_propensity_exclude_miss
> ing.dta"
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_female_propensity_exclude_m
> issing.dta"
> drop _m 
> 
> g widow_age = . 
> g widow_ps = .
> 
> forvalues i = 5(1)14{
>         replace widow_age = wave_start_age_`i' if widow_wave == `i'
>         replace widow_ps = propensity_widow_`i' if widow_wave == `i'
> }
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\ever_widowed_exclude_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/ever_widowed_exclude_missing.dta", replace
> 
> /*graph box widow_ps, title("weighted treatment group/exclude missing")
>  ytitle("propensity scores")
> graph save "Graph" "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_pro
> ject\widowed_and_mortality\output\treatment_propensity_box_plot_exclude
> _missing.gph", replace
> graph export "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\w
> idowed_and_mortality\output\treatment_propensity_box_plot_exclude_missi
> ng.png", as(png) name("Graph") replace */
> 
> graph box widow_ps, title("weighted treatment group/exclude missing") y
> title("propensity scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/treatment_propensity_box_plot_exc
> lude_missing.gph", replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/treatment_propensity_box_plot_exclude_m
> issing.png", as(png) name("Graph") replace 
> 
> 
> collapse (count) hhidpn, by(widow_age)
> rename hhidpn count_treatment
> drop if widow_age == . 
> egen sum_treatment = total(count_treatment)
> gen percent_treatment = count_treatment/sum_treatment 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_treatment_exclude_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_treatment_exclude_missing.dta" , replace 
> 
> /*save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Dat
> a/Data_new/ever_widowed.dta", replace */
> restore 
> 
> /* control group age adjustments */
> 
>  preserve 
> clear
> /*use "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male_exclude_missing.dta", clear
> merge 1:1 hhidpn  wave using "C:\Users\pangu\OneDrive - Nexus365\projec
> ts\HRS_project\Data\Data_new\widow_prediction_female_exclude_missing.dt
> a"*/
> 
> use "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/D
> ata_new/widow_prediction_male_exclude_missing.dta", clear
> merge 1:1 hhidpn  wave using "/Users/guanghuipan/OneDrive - Nexus365/pr
> ojects/HRS_project/Data/Data_new/widow_prediction_female_exclude_missin
> g.dta"
> drop _m 
> 
> keep if widow_ == 0
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\never_widowed_long_exclude_missing.dta" , replace 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/never_widowed_long_exclude_missing.dta" , replace 
> 
> 
> collapse (count) hhidpn, by(wave_start_age_)
> 
> 
> rename wave_start_age_ widow_age 
> drop if widow_age == .
> 
> rename hhidpn count_control
> 
> egen sum_control = total(count_control)
> g percent_control = count_control/sum_control  
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_control_exclude_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_control_exclude_missing.dta" , replace 
> 
> *merge 1:1 widow_age using "C:\Users\pangu\OneDrive - Nexus365\projects
> \HRS_project\Data\Data_new\age_dis_treatment_exclude_missing.dta"
> 
> merge 1:1 widow_age using "/Users/guanghuipan/OneDrive - Nexus365/proje
> cts/HRS_project/Data/Data_new/age_dis_treatment_exclude_missing.dta"
> 
> drop _m 
> 
> /* generate the weights */ 
> 
> rename widow_age wave_start_age_
> gen age_weights = percent_control/percent_treatment
> 
> replace age_weights = 0.00001 if age_weights == . 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_exclude_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_exclude_missing.dta" , replace 
> 
> *merge 1:n wave_start_age_ using "C:\Users\pangu\OneDrive - Nexus365\pr
> ojects\HRS_project\Data\Data_new\never_widowed_long_exclude_missing.dta
> " 
> merge 1:n wave_start_age_ using "/Users/guanghuipan/OneDrive - Nexus365
> /projects/HRS_project/Data/Data_new/never_widowed_long_exclude_missing.
> dta" 
> 
> drop _m 
> * calculating the propensity distribution for control group */ 
> /*graph box propensity_widow [aw= age_weights], title("weighted control
>  group/exclude missing") ytitle("propensity scores")
> graph save "Graph" "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_pro
> ject\widowed_and_mortality\output\control_propensity_box_plot_exclude_m
> issing.gph", replace
> graph export "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\w
> idowed_and_mortality\output\control_propensity_box_plot_exclude_missing
> .png", as(png) name("Graph") replace *
> 
> graph box propensity_widow [aw= age_weights], title("weighted control g
> roup/exclude missing") ytitle("propensity scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/control_propensity_box_plot_exclu
> de_missing.gph", replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/control_propensity_box_plot_exclude_mis
> sing.png", as(png) name("Graph") replace
> 
> 
> restore 
> 
> 
> 
> * Method 2: Impute missing data 
> 
> * for categorical variables, we impute the missing data with a missing 
> category 
> 
> * note: we could not impute all the cases, we only impute the cases who
>  just widowed (widow[t] == 1 & widow[t-1] == 0) or not widowed (we can'
> t impute those who widowed for a period) so that we could make predicti
> ons on their propensity. 
> 
> preserve 
> keep if hhidpn[_n] == hhidpn[_n-1] & widow_[_n] == 1 & widow_[_n-1]== 1
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widowed_multiple_years.dta",replace 
> *restore 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widowed_multiple_years.dta",replace 
> restore 
> 
> * preserve 
> drop if hhidpn[_n] == hhidpn[_n-1] & widow_[_n] == 1 & widow_[_n-1]== 1
> 
> foreach i of var wave_start_age s_wave_start_age {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s | `i' == .u 
> 
> }
> 
> foreach i of var male race educ migration protestant catholic s_race s_
> educ s_migration s_protestant s_catholic  s_max_hosp_visit_  s_max_nurs
> _home_  s_max_high_bp_ s_max_diabetes_ s_max_cancer_ s_max_lung_ s_max_
> heart_ s_max_stroke_ s_max_psych_ s_max_arthritis_ s_max_smoke_ s_max_a
> dl_ educ_homo reli_homo racial_homo inc_homo geo_homo {
>         replace `i' = 999 if `i' ==. 
>         replace `i' = 999 if `i' == .m | `i' == .d | `i' == .v | `i' ==
>  .r | `i' == .s |`i' == .u
> }
> 
> recode  s_max_hosp_visit_  s_max_nurs_home_  s_max_high_bp_ s_max_diabe
> tes_ s_max_cancer_ s_max_lung_ s_max_heart_ s_max_stroke_ s_max_psych_ 
> s_max_arthritis_ s_max_smoke_ s_max_adl_ educ_homo reli_homo racial_hom
> o inc_homo geo_homo (.=999)
> 
> replace s_mean_health_ = int(s_mean_health_)
> /* for continous variabls: 
> s_mean_hosp_time_ s_mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_m
> ean_cesd_ s_mean_expend_
> * multiple imputation for continuous variables */
> 
> foreach i in s_mean_health_ s_mean_hosp_time_ s_mean_drink_days_  s_mea
> n_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_expend_ s_max_cond_{
>         quietly: reg `i'   i.s_max_hosp_visit_  i.s_max_nurs_home_  i.s
> _max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.s_max_h
> eart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_smoke_ 
> i.s_max_adl_ 
>         predict `i'_pre
>         replace `i' = `i'_pre if `i' == .
> }
> *merge 1:1 hhidpn wave using "C:\Users\pangu\OneDrive - Nexus365\projec
> ts\HRS_project\Data\Data_new\widowed_multiple_years.dta"
> merge 1:1 hhidpn wave using "/Users/guanghuipan/OneDrive - Nexus365/pro
> jects/HRS_project/Data/Data_new/widowed_multiple_years.dta"
> drop _m 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\multiple_years_imputations.dta", replace
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/multiple_years_imputations.dta", replace
> preserve 
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_time_ s_
> mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_exp
> end_ s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs_home_
>   i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.s_
> max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_sm
> oke_  i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> xi: logit widow male i.race i.educ i.migration protestant catholic i.s_
> race i.s_educ i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_ti
> me_ s_mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_me
> an_expend_ s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs
> _home_  i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung
> _ i.s_max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_
> max_smoke_  i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_impute_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_impute_missing.dta", replace
> 
> restore 
> 
> preserve
> 
> keep if male == 1
> sum widow male i.race i.educ i.migration protestant catholic i.s_race i
> .s_educ i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_time_ s_
> mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_exp
> end_ s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs_home_
>   i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.s_
> max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_sm
> oke_  i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_time_ 
> s_mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_e
> xpend_ s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs_hom
> e_  i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.
> s_max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_
> smoke_  i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_male_impute_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male_impute_missing.dta", replace
> 
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> * save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Da
> ta_new\widow_prediction_male_propensity_impute_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_male_propensity_impute_missing.dta", replace
> 
> restore
> preserve
> 
> keep if male == 0
> sum widow  i.race i.educ i.migration protestant catholic i.s_race i.s_e
> duc i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_time_ s_mean
> _drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_expend_
>  s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs_home_  i.
> s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.s_max_
> heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_smoke_
>   i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> xi: logit widow  i.race i.educ i.migration protestant catholic i.s_race
>  i.s_educ i.s_migration i.s_protestant i.s_catholic  s_mean_hosp_time_ 
> s_mean_drink_days_  s_mean_drink_num_ s_mean_bmi_ s_mean_cesd_ s_mean_e
> xpend_ s_max_cond_ s_mean_health_ i.s_max_hosp_visit_  i.s_max_nurs_hom
> e_  i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ i.s_max_lung_ i.
> s_max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_arthritis_ i.s_max_
> smoke_  i.educ_homo i.reli_homo i.racial_homo i.inc_homo i.geo_homo
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female_impute_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_female_impute_missing.dta", replace
> 
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\widow_prediction_female_propensity_impute_missing.dta", replace
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/widow_prediction_female_propensity_impute_missing.dta", replac
> e
> 
> restore 
> 
> preserve 
> 
> keep hhidpn wave widow_ wave_start_age_
> 
> reshape wide widow_  wave_start_age_, i(hhidpn) j(wave)
> 
> g ever_widowed = 0
> g widow_wave = .
> forvalues i = 4(1)14{
>         replace ever_widowed = 1 if widow_`i'== 1
> }
> 
> forvalues i =5(1)14{
>         local j = `i' - 1
>         replace widow_wave= `i' if widow_`i' == 1 & widow_`j' == 0
> }
> 
> 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_male_propensity_impute_missing
> .dta"
> 
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_male_propensity_impute_miss
> ing.dta"
> drop _m 
> 
> *merge 1:1 hhidpn using "C:\Users\pangu\OneDrive - Nexus365\projects\HR
> S_project\Data\Data_new\widow_prediction_female_propensity_impute_missi
> ng.dta"
> merge 1:1 hhidpn using "/Users/guanghuipan/OneDrive - Nexus365/projects
> /HRS_project/Data/Data_new/widow_prediction_female_propensity_impute_mi
> ssing.dta"
> drop _m 
> 
> g widow_age = . 
> g widow_ps = .
> 
> forvalues i = 5(1)14{
>         replace widow_age = wave_start_age_`i' if widow_wave == `i'
>         replace widow_ps = propensity_widow_`i' if widow_wave == `i'
> }
> 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\ever_widowed_impute_missing.dta", replace
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/ever_widowed_impute_missing.dta", replace
> /*
> graph box widow_ps, title("weighted treatment group/imputed missing") y
> title("propensity scores")
> graph save "Graph" "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_pro
> ject\widowed_and_mortality\output\treatment_propensity_box_plot_impute_
> missing.gph", replace
> graph export "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\w
> idowed_and_mortality\output\treatment_propensity_box_plot_impute_missin
> g.png", as(png) name("Graph") replace */
> 
> graph box widow_ps, title("weighted treatment group/imputed missing") y
> title("propensity scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/treatment_propensity_box_plot_imp
> ute_missing.gph", replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/treatment_propensity_box_plot_impute_mi
> ssing.png", as(png) name("Graph") replace 
> 
> collapse (count) hhidpn, by(widow_age)
> rename hhidpn count_treatment
> drop if widow_age == . 
> egen sum_treatment = total(count_treatment)
> gen percent_treatment = count_treatment/sum_treatment 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_treatment_impute_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_treatment_impute_missing.dta" , replace 
> 
> 
> /*save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Dat
> a/Data_new/ever_widowed.dta", replace */
> restore 
> 
> /* control group age adjustments */
> 
>  preserve 
> clear
> *use "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\widow_prediction_male_impute_missing.dta", clear
> use "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/D
> ata_new/widow_prediction_male_impute_missing.dta", clear
> *merge 1:1 hhidpn  wave using "C:\Users\pangu\OneDrive - Nexus365\proje
> cts\HRS_project\Data\Data_new\widow_prediction_female_impute_missing.dt
> a"
> merge 1:1 hhidpn  wave using "/Users/guanghuipan/OneDrive - Nexus365/pr
> ojects/HRS_project/Data/Data_new/widow_prediction_female_impute_missing
> .dta"
> drop _m 
> 
> keep if widow_ == 0
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\never_widowed_long_impute_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/never_widowed_long_impute_missing.dta" , replace 
> 
> collapse (count) hhidpn, by(wave_start_age_)
> 
> 
> rename wave_start_age_ widow_age 
> drop if widow_age == .
> 
> rename hhidpn count_control
> 
> egen sum_control = total(count_control)
> g percent_control = count_control/sum_control  
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_control_impute_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_control_impute_missing.dta" , replace 
> 
> *merge 1:1 widow_age using "C:\Users\pangu\OneDrive - Nexus365\projects
> \HRS_project\Data\Data_new\age_dis_treatment_impute_missing.dta"
> 
> merge 1:1 widow_age using "/Users/guanghuipan/OneDrive - Nexus365/proje
> cts/HRS_project/Data/Data_new/age_dis_treatment_impute_missing.dta"
> 
> drop _m 
> 
> /* generate the weights */ 
> 
> rename widow_age wave_start_age_
> gen age_weights = percent_control/percent_treatment
> 
> replace age_weights = 0.00001 if age_weights == . 
> 
> *save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Dat
> a_new\age_dis_impute_missing.dta" , replace 
> 
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/age_dis_impute_missing.dta" , replace 
> 
> *merge 1:n wave_start_age_ using "C:\Users\pangu\OneDrive - Nexus365\pr
> ojects\HRS_project\Data\Data_new\never_widowed_long_impute_missing.dta"
>  
> 
> merge 1:n wave_start_age_ using "/Users/guanghuipan/OneDrive - Nexus365
> /projects/HRS_project/Data/Data_new/never_widowed_long_impute_missing.d
> ta" 
> 
> drop _m 
> * calculating the propensity distribution for control group */ 
> graph box propensity_widow [aw= age_weights], title("weighted control g
> roup/imputed missing") ytitle("propensity scores")
> graph save "Graph" "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS
> _project/widowed_and_mortality/output/control_propensity_box_plot_imput
> e_missing.gph", replace
> graph export "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_proje
> ct/widowed_and_mortality/output/control_propensity_box_plot_impute_miss
> ing.png", as(png) name("Graph") replace 
> 
> 
> 
> restore 
> 
> /*
> 
> 
> sum widow male i.race i.educ i.migration i.protestant i.catholic i.s_ra
> ce i.s_educ i.s_migration i.s_protestant i.s_catholic i.s_mean_drink_da
> ys_  i.s_mean_drink_num_ i.s_max_cond_ i.s_mean_health_ i.s_mean_hosp_t
> ime_ i.s_max_hosp_visit_  i.s_mean_bmi_ i.s_max_nurs_home_ i.s_mean_ces
> d_ i.s_mean_expend_ i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_cancer_ 
> i.s_max_lung_ i.s_max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_max_art
> hritis_ i.s_max_smoke_ i.s_max_adl_ i.educ_homo i.reli_homo i.racial_ho
> mo i.inc_homo i.geo_homo wave_start_age s_wave_start_age 
> 
> xi: logit widow male i.race i.educ i.migration i.protestant i.catholic 
> i.s_race i.s_educ i.s_migration i.s_protestant i.s_catholic i.s_mean_dr
> ink_days_  i.s_mean_drink_num_ i.s_max_cond_ i.s_mean_health_ i.s_mean_
> hosp_time_ i.s_max_hosp_visit_  i.s_mean_bmi_ i.s_max_nurs_home_ i.s_me
> an_cesd_ i.s_mean_expend_ i.s_max_high_bp_ i.s_max_diabetes_ i.s_max_ca
> ncer_ i.s_max_lung_ i.s_max_heart_ i.s_max_stroke_ i.s_max_psych_ i.s_m
> ax_arthritis_ i.s_max_smoke_ i.s_max_adl_ i.educ_homo i.reli_homo i.rac
> ial_homo i.inc_homo i.geo_homo wave_start_age s_wave_start_age 
> 
> 
> predict propensity_widow 
> replace propensity_widow = propensity_widow[_n-1] if propensity_widow =
> = . & hhidpn[_n]==hhidpn[_n-1] & widow[_n] == 1 & widow[_n-1]==1
> drop if propensity_widow == .
> 
> 
> save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\widow_prediction_female_impute_missing.dta", replace
> 
> keep hhidpn propensity_widow wave
> rename propensity_widow propensity_widow_
> reshape wide propensity_widow_, i(hhidpn) j(wave)
> 
> save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\Data
> _new\widow_prediction_female_propensity_impute_missing.dta", replace
> 
> *restore 
> *preserve
> 
> 
> 
> 
> 
> 
> 
> 
> /* outcome variable: survival years */ 
> 
> /*
> /*gen divorce = 0 
> forvalues i = 5(1)14{
>         replace divorce  = 1 if r`i'mstat == 5| r`i'mstat == 6 |r`i'mst
> at == 4
> }
>  */
> /* this is a broader definition, as we include the separated couples */
>  
> 
> 
> foreach i in divorce ragender birth_year race educ birth_place migratio
> n religion  drink_days_4 drink_num_4 cond_4 health_4 hosp_4 hosp_time_4
>  cesd_4 s_birth_year_4 s_race_4 s_educ_4 s_birth_place_4 s_migration_4 
> s_religion_4  s_drink_days_4 s_drink_num_4 s_cond_4 s_health_4 s_hosp_4
>  s_hosp_time_4 s_cesd_4  rank_asset_4 child_liv_4 num_shared_child time
> s_div_4 s_times_div_4 times_mar_4 s_times_mar_4 times_wid_4 s_times_wid
> _4 marriage_len_4 s_marriage_len_4 cur_mar_len_4 r4wtresp educ_homo rac
> ial_homo reli_homo inc_homo inc_miss geo_homo asset_miss age_diff  {
>         drop if `i' == . 
>         drop if `i' == .m | `i' == .d | `i' == .v | `i' == .r | `i' == 
> .s
> }
> 
> sum survival_year divorce ragender birth_year race educ birth_place mig
> ration religion rank_income_4 drink_days_4 drink_num_4 cond_4 health_4 
> hosp_4 hosp_time_4 cesd_4 s_birth_year_4 s_race_4 s_educ_4 s_birth_plac
> e_4 s_migration_4 s_religion_4 s_rank_income_4 s_drink_days_4 s_drink_n
> um_4 s_cond_4 s_health_4 s_hosp_4 s_hosp_time_4 s_cesd_4  rank_asset_4 
> child_liv_4 num_shared_child times_div_4 s_times_div_4 times_mar_4 s_ti
> mes_mar_4 times_wid_4 s_times_wid_4 marriage_len_4 s_marriage_len_4 cur
> _mar_len_4  r4wtresp educ_homo racial_homo reli_homo inc_homo inc_miss 
> geo_homo asset_miss age_diff 
> 
> 
> /* covariates for survival time *
> * to predict survival time, we need the covariates which are related to
>  death itself 
> * recode the death year with waves, and we need to obtain the informati
> on from the waves before the person's death 
> 
> foreach i in mean_drink_days mean_drink_num mean_hosp_time max_hosp_vis
> it mean_income mean_asset mean_cesd mean_cond mean_health {
>         egen `i' = rowmax(`i'_4 `i'_5 `i'_6 `i'_7 `i'_8 `i'_9 `i'_10 `i
> '_11 `i'_12 `i'_13 `i'_14)
> }
> 
> gen mean_income_missing = 1 if mean_income ==.
> replace mean_income_missing = 0 if mean_income_missing != 1
> replace mean_income= 0 if mean_income== .
> 
> gen mean_asset_missing = 1 if mean_asset == .
> replace mean_asset_missing = 0 if mean_asset_missing != 1
> replace mean_asset = 0 if mean_asset == .
> 
> /* further research should impute the values 
> foreach i in mean_drink_days mean_drink_num mean_hosp_time max_hosp_vis
> it mean_income mean_asset mean_cesd mean_cond mean_health {
>         drop if `i' == . 
> }
> */
> */
> 
> 
> /* censor individuals who widowed before divorce */
> forvalues i = 4(1)14{
>         gen wid_censor_`i' = 0
> }
> 
> forvalues i = 4(1)14{
>         gen divorce_new_`i' = 0 
> }
> 
> forvalues i = 5(1)14{
>         local j =  `i' - 1
>         replace divorce_new_`i' = 1 if divorce_new_`j' == 1 
>         replace divorce_new_`i'  = 1 if r`i'mstat == 5| r`i'mstat == 6 
> |r`i'mstat == 4
> }
> forvalues i = 5(1)14{
>         local j = `i' - 1
>         replace wid_censor_`i' = 1 if wid_censor_`j' == 1 
>         replace wid_censor_`i' = 1 if  divorce_new_`i' == 0 & widow_`i'
>  == 1 
> }
> 
> 
> egen wid_censor_time_sum = rowtotal(wid_censor_5 wid_censor_6 wid_censo
> r_7 wid_censor_8 wid_censor_9 wid_censor_10 wid_censor_11 wid_censor_12
>  wid_censor_13 wid_censor_14)
> 
> 
> 
> gen wid_censor_wave = 11 - wid_censor_time_sum + 4
> recode wid_censor_wave (4 = 1998)(5=2000)(6=2002)(7=2004)(8=2006)(9=200
> 8)(10=2010)(11=2012)(12=2014)(13=2016)(14 = 2018), gen(wid_censor_year)
> replace censor_year =  wid_censor_year - int_year_1998 if wid_censor_ye
> ar <= min(rexityr, int_year_2018) 
> replace survival_year = min(failure_year, censor_year)
> replace right_censor = 0 if failure_year <= censor_year
> 
> /* divorce revise */ 
> /* Below added to change divorce to 0 if widow censoredd (Jiaxin)*/
> replace divorce = 0 if wid_censor_year <= min(rexityr, int_year_2018) 
> 
> gen age_death = death_year - birth_year
> 
> sum survival_year divorce ragender birth_year race educ birth_place mig
> ration religion  drink_days_4 drink_num_4 cond_4 health_4 hosp_4 hosp_t
> ime_4 cesd_4 s_birth_year_4 s_race_4 s_educ_4 s_birth_place_4 s_migrati
> on_4 s_religion_4  s_drink_days_4 s_drink_num_4 s_cond_4 s_health_4 s_h
> osp_4 s_hosp_time_4 s_cesd_4  rank_asset_4 child_liv_4 num_shared_child
>  times_div_4 s_times_div_4 times_mar_4 s_times_mar_4 times_wid_4 s_time
> s_wid_4 marriage_len_4 s_marriage_len_4 cur_mar_len_4  r4wtresp mean_dr
> ink_days mean_drink_num mean_hosp_time max_hosp_visit mean_income mean_
> asset mean_cesd mean_cond mean_health age_death educ_homo racial_homo r
> eli_homo inc_homo inc_miss geo_homo asset_miss age_diff 
> 
> 
> keep hhid pn right_censor survival_year divorce ragender birth_year rac
> e educ birth_place migration religion  drink_days_4 drink_num_4 cond_4 
> health_4 hosp_4 hosp_time_4 cesd_4 s_birth_year_4 s_race_4 s_educ_4 s_b
> irth_place_4 s_migration_4 s_religion_4  s_drink_days_4 s_drink_num_4 s
> _cond_4 s_health_4 s_hosp_4 s_hosp_time_4 s_cesd_4  rank_asset_4 child_
> liv_4 num_shared_child times_div_4 s_times_div_4 times_mar_4 s_times_ma
> r_4 times_wid_4 s_times_wid_4 marriage_len_4 s_marriage_len_4 cur_mar_l
> en_4 r4wtresp mean_drink_days mean_drink_num mean_hosp_time max_hosp_vi
> sit mean_income mean_asset mean_cesd mean_cond mean_health age_death ed
> uc_homo racial_homo reli_homo inc_homo inc_miss geo_homo asset_miss age
> _diff censor_year failure_year censor_age male death
> 
> /* save "C:\Users\pangu\OneDrive - Nexus365\projects\HRS_project\Data\D
> ata_new\divorce_prediction.dta" , replace */
> save "/Users/guanghuipan/OneDrive - Nexus365/projects/HRS_project/Data/
> Data_new/divorce_prediction.dta", replace
> 
> */ */
> */
. timer off 1

. timer list 1
   1:   1643.12 /        1 =    1643.1190

. 
. log close
      name:  <unnamed>
       log:  C:\Users\pangu\OneDrive - Nexus365\thesis\survival\widowhood
> \codes\widowhood_new.log
  log type:  text
 closed on:  23 Sep 2023, 16:24:22
-------------------------------------------------------------------------
